{
    "title": "Authchanger Arguments",
    "description": "Arguments that are passed to authchanger during Jamf Connect Installation",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://docs.jamf.com/jamf-connect/administrator-guide/authchanger.html"
        }
    ],
    "__preferencedomain": "com.jamf.connect.authchanger",
    "properties": {
        "Arguments": {
            "title": "Arguments",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "authchanger Argument"
                    }
                }
            ]
        }
    }
}
