{
    "title": "Initial Password Settings",
    "description": "Used to determine how Jamf Connect creates a local password during account creation and if a users local and network passwords should be verified during each login to make sure they are in sync",
    "__preferencedomain": "com.jamf.connect.login",
    "properties": {
        "OIDCNewPassword": {
            "title": "Create a Separate Local Password",
            "description": "If set to true, this key prompts users to create a new password for their new local account. If set to false, this key prompts users to re-enter their network password, which also becomes the local account password. This ensures a user's network and local password are synced during user creation",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "OIDCROPGID": {
            "title": "Client ID (Password Verification)",
            "description": "The Client ID of the registered app in your IdP used for authenticating the user's password via a resource owner password grant (ROPG) workflow",
            "options": {
                "inputAttributes": {
                    "placeholder": "9fcc52c7-ee36-4889-8517-lkjslkjoe23"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "CreateJamfConnectPassword": {
            "title": "Create Jamf Connect Keychain Item",
            "description": "Automatically create a keychain item for Jamf Connect during the account creation process. This allows the Jamf Connect menu bar app to populate user credentials in the Sign In window when the app is first opened",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        }
    }
}
