{
    "title": "Google Chrome Password Manager Preferences",
    "__version": "1.0",
    "__preferencedomain": "com.google.Chrome",
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "PasswordLeakDetectionEnabled": {
            "title": "Enable leak detection for entered credentials",
            "description": "(PasswordLeakDetectionEnabled)-Setting the policy to Enabled lets users have Google Chrome check whether usernames and passwords entered were part of a leak. If the policy is set, users can't change it in Google Chrome. If not set, credential leak checking is allowed, but the user can turn it off. This behavior will not trigger if Safe Browsing is disabled (either by policy or by the user). In order to force Safe Browsing on, use the SafeBrowsingEnabled policy or the SafeBrowsingProtectionLevel policy",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PasswordLeakDetectionEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PasswordManagerEnabled": {
            "title": "Enable saving passwords to the password manager",
            "description": "(PasswordManagerEnabled)-Setting the policy to Enabled means users have Google Chrome remember passwords and provide them the next time they sign in to a site. Setting the policy to Disabled means users can't save new passwords, but previously saved passwords will still work",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PasswordManagerEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        }
    }
}
