{
    "title": "Google Chrome Printing Preferences Manifest",
    "__preferencedomain": "com.google.Chrome",
    "properties": {
        "CloudPrintProxyEnabled": {
            "title": "Enable Google Cloud Print proxy",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=CloudPrintProxyEnabled"
                }
            ],
            "description": "Enables Google Chrome to act as a proxy between Google Cloud Print and legacy printers connected to the machine",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "CloudPrintSubmitEnabled": {
            "title": "Enable submission of documents to Google Cloud Print",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=CloudPrintSubmitEnabled"
                }
            ],
            "description": "Enables Google Chrome to submit documents to Google Cloud Print for printing. NOTE: This only affects Google Cloud Print support in Google Chrome. It does not prevent users from submitting print jobs on web sites",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "CloudPrintWarningsSuppressed": {
            "title": "Suppress Google Cloud Print deprecation messages",
            "description": "This policy controls whether Google Cloud Print deprecation warnings are shown to users in the print preview dialog or settings pages",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DefaultPrinterSelection": {
            "title": "Default printer selection rules",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DefaultPrinterSelection"
                }
            ],
            "description": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DefaultPrinterSelection",
            "options": {
                "inputAttributes": {
                    "placeholder": "kind: cloud"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "DisablePrintPreview": {
            "title": "Disable Print Preview",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DisablePrintPreview"
                }
            ],
            "description": "Show the system print dialog instead of print preview",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PrintHeaderFooter": {
            "title": "Print Headers and Footers",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PrintHeaderFooter"
                }
            ],
            "description": "Force 'headers and footers' to be on or off in the printing dialog",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PrintPreviewUseSystemDefaultPrinter": {
            "title": "Use System Default Printer as Default",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PrintPreviewUseSystemDefaultPrinter"
                }
            ],
            "description": "Causes Google Chrome to use the system default printer as the default choice in Print Preview instead of the most recently used printer",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PrinterTypeDenyList": {
            "title": "Disable printer types on the deny list",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PrinterTypeDenyList"
                }
            ],
            "description": "privet = Zeroconf-based (mDNS + DNS-SD) protocol destinations. extension = Extension-based destinations. pdf = The 'Save as PDF' destination. local = Local printer destinations. cloud = Google Cloud Print and 'Save to Google Drive' destinations",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "PrintingAllowedBackgroundGraphicsModes": {
            "title": "Restrict background graphics printing mode",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PrintingAllowedBackgroundGraphicsModes"
                }
            ],
            "description": "Restricts background graphics printing mode. Unset policy is treated as no restriction. any = Allow printing both with and without background graphcis. enabled = Allow printing only with background graphics. disabled = Allow printing only without background graphics",
            "options": {
                "inputAttributes": {
                    "placeholder": "any"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "PrintingBackgroundGraphicsDefault": {
            "title": "Default background graphics printing mode",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PrintingBackgroundGraphicsDefault"
                }
            ],
            "description": "Overrides default background graphics printing mode. enabled = Enable background graphics printing mode by default. disabled = Disable background graphics printing mode by default",
            "options": {
                "inputAttributes": {
                    "placeholder": "enabled"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "PrintingEnabled": {
            "title": "Enable printing",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PrintingEnabled"
                }
            ],
            "description": "Enables printing in Google Chrome and prevents users from changing this setting",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PrintingPaperSizeDefault": {
            "type": "object",
            "title": "Default printing page size",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PrintingPaperSizeDefault"
                }
            ],
            "properties": {
                "custom_size": {
                    "properties": {
                        "height": {
                            "description": "Height of the page in micrometers",
                            "type": "integer"
                        },
                        "width": {
                            "description": "Width of the page in micrometers",
                            "type": "integer"
                        }
                    },
                    "required": [
                        "width",
                        "height"
                    ],
                    "type": "object"
                },
                "name": {
                    "enum": [
                        "custom",
                        "asme_f_28x40in",
                        "iso_2a0_1189x1682mm",
                        "iso_a0_841x1189mm",
                        "iso_a10_26x37mm",
                        "iso_a1_594x841mm",
                        "iso_a2_420x594mm",
                        "iso_a3_297x420mm",
                        "iso_a4-extra_235.5x322.3mm",
                        "iso_a4-tab_225x297mm",
                        "iso_a4_210x297mm",
                        "iso_a5-extra_174x235mm",
                        "iso_a5_148x210mm",
                        "iso_a6_105x148mm",
                        "iso_a7_74x105mm",
                        "iso_a8_52x74mm",
                        "iso_a9_37x52mm",
                        "iso_b0_1000x1414mm",
                        "iso_b10_31x44mm",
                        "iso_b1_707x1000mm",
                        "iso_b2_500x707mm",
                        "iso_b3_353x500mm",
                        "iso_b4_250x353mm",
                        "iso_b5-extra_201x276mm",
                        "iso_b5_176x250mm",
                        "iso_b6_125x176mm",
                        "iso_b6c4_125x324mm",
                        "iso_b7_88x125mm",
                        "iso_b8_62x88mm",
                        "iso_b9_44x62mm",
                        "iso_c0_917x1297mm",
                        "iso_c10_28x40mm",
                        "iso_c1_648x917mm",
                        "iso_c2_458x648mm",
                        "iso_c3_324x458mm",
                        "iso_c4_229x324mm",
                        "iso_c5_162x229mm",
                        "iso_c6_114x162mm",
                        "iso_c6c5_114x229mm",
                        "iso_c7_81x114mm",
                        "iso_c7c6_81x162mm",
                        "iso_c8_57x81mm",
                        "iso_c9_40x57mm",
                        "iso_dl_110x220mm",
                        "jis_exec_216x330mm",
                        "jpn_chou2_111.1x146mm",
                        "jpn_chou3_120x235mm",
                        "jpn_chou4_90x205mm",
                        "jpn_hagaki_100x148mm",
                        "jpn_kahu_240x322.1mm",
                        "jpn_kaku2_240x332mm",
                        "jpn_oufuku_148x200mm",
                        "jpn_you4_105x235mm",
                        "na_10x11_10x11in",
                        "na_10x13_10x13in",
                        "na_10x14_10x14in",
                        "na_10x15_10x15in",
                        "na_11x12_11x12in",
                        "na_11x15_11x15in",
                        "na_12x19_12x19in",
                        "na_5x7_5x7in",
                        "na_6x9_6x9in",
                        "na_7x9_7x9in",
                        "na_9x11_9x11in",
                        "na_a2_4.375x5.75in",
                        "na_arch-a_9x12in",
                        "na_arch-b_12x18in",
                        "na_arch-c_18x24in",
                        "na_arch-d_24x36in",
                        "na_arch-e_36x48in",
                        "na_b-plus_12x19.17in",
                        "na_c5_6.5x9.5in",
                        "na_c_17x22in",
                        "na_d_22x34in",
                        "na_e_34x44in",
                        "na_edp_11x14in",
                        "na_eur-edp_12x14in",
                        "na_f_44x68in",
                        "na_fanfold-eur_8.5x12in",
                        "na_fanfold-us_11x14.875in",
                        "na_foolscap_8.5x13in",
                        "na_govt-legal_8x13in",
                        "na_govt-letter_8x10in",
                        "na_index-3x5_3x5in",
                        "na_index-4x6-ext_6x8in",
                        "na_index-4x6_4x6in",
                        "na_index-5x8_5x8in",
                        "na_invoice_5.5x8.5in",
                        "na_ledger_11x17in",
                        "na_legal-extra_9.5x15in",
                        "na_legal_8.5x14in",
                        "na_letter-extra_9.5x12in",
                        "na_letter-plus_8.5x12.69in",
                        "na_letter_8.5x11in",
                        "na_number-10_4.125x9.5in",
                        "na_number-11_4.5x10.375in",
                        "na_number-12_4.75x11in",
                        "na_number-14_5x11.5in",
                        "na_personal_3.625x6.5in",
                        "na_super-a_8.94x14in",
                        "na_super-b_13x19in",
                        "na_wide-format_30x42in",
                        "om_dai-pa-kai_275x395mm",
                        "om_folio-sp_215x315mm",
                        "om_invite_220x220mm",
                        "om_italian_110x230mm",
                        "om_juuro-ku-kai_198x275mm",
                        "om_large-photo_200x300",
                        "om_pa-kai_267x389mm",
                        "om_postfix_114x229mm",
                        "om_small-photo_100x150mm",
                        "prc_10_324x458mm",
                        "prc_16k_146x215mm",
                        "prc_1_102x165mm",
                        "prc_2_102x176mm",
                        "prc_32k_97x151mm",
                        "prc_3_125x176mm",
                        "prc_4_110x208mm",
                        "prc_5_110x220mm",
                        "prc_6_120x320mm",
                        "prc_7_160x230mm",
                        "prc_8_120x309mm",
                        "roc_16k_7.75x10.75in",
                        "roc_8k_10.75x15.5in",
                        "jis_b0_1030x1456mm",
                        "jis_b1_728x1030mm",
                        "jis_b2_515x728mm",
                        "jis_b3_364x515mm",
                        "jis_b4_257x364mm",
                        "jis_b5_182x257mm",
                        "jis_b6_128x182mm",
                        "jis_b7_91x128mm",
                        "jis_b8_64x91mm",
                        "jis_b9_45x64mm",
                        "jis_b10_32x45mm"
                    ],
                    "type": "string"
                }
            }
        }
    }
}
