{
    "title": "com.google.chrome.misc",
    "description": "Google Chrome Miscellaneous Preferences",
    "__preferencedomain": "com.google.Chrome",
    "properties": {
        "AbusiveExperienceInterventionEnforce": {
            "title": "Abusive Experience Intervention Enforce",
            "description": "Allows you to set whether sites with abusive experiences should be prevented from opening new windows or tabs",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AbusiveExperienceInterventionEnforce"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AccessibilityImageLabelsEnabled": {
            "title": "Enable Get Image Descriptions from Google",
            "description": "(AccessibilityImageLabelsEnabled)-The Get Image Descriptions from Google accessibility feature enables visually-impaired screen reader users to get descriptions of unlabeled images on the web. Users who choose to enable it will have the option of using an anonymous Google service to provide automatic descriptions for unlabeled images they encounter on the web. If this feature is enabled, the content of images will be sent to Google servers in order to generate a description. No cookies or other user data is sent, and Google does not save or log any image content. If this policy is set to true, the Get Image Descriptions from Google feature will be enabled, though it will only affect users who are using a screen reader or other similar assistive technology",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AccessibilityImageLabelsEnabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "AdditionalDnsQueryTypesEnabled": {
            "title": "Allow DNS queries for additional DNS record types",
            "description": "(AdditionalDnsQueryTypesEnabled)-This policy controls whether Google Chrome may query additional DNS record types when making insecure DNS requests. This policy has no effect on DNS queries made via Secure DNS, which may always query additional DNS types",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://chromeenterprise.google/policies/#AdditionalDnsQueryTypesEnabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "AdsSettingForIntrusiveAdsSites": {
            "title": "Ads setting for sites with intrusive ads",
            "description": "Allows you to set whether ads should be blocked on sites with intrusive ads. 1 = Allow ads on all sites 2 = Do not allow ads on sites with intrusive ads",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AdsSettingForIntrusiveAdsSites"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        1,
                        2
                    ],
                    "enum_titles": [
                        1,
                        2
                    ],
                    "default": 1
                }
            ]
        },
        "AdvancedProtectionAllowed": {
            "title": "Enable additional protections for users enrolled in the Advanced Protection program",
            "description": "(AdvancedProtectionAllowed)-This policy controls whether users enrolled in the Advanced Protection program receive extra protections. Some of these features may involve the sharing of data with Google (for example, Advanced Protection users will be able to send their downloads to Google for malware scanning). If set to True or not set, enrolled users will receive extra protections. If set to False, Advanced Protection users will receive only the standard consumer features",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AdvancedProtectionAllowed"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "AllowDeletingBrowserHistory": {
            "title": "Enable deleting browser and download history",
            "description": "Enables deleting browser history and download history in Google Chrome and prevents users from changing this setting",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AllowDeletingBrowserHistory"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AllowDinosaurEasterEgg": {
            "title": "Allow Dinosaur Easter Egg Game",
            "description": "Allow users to play dinosaur easter egg game when device is offline",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AllowDinosaurEasterEgg"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AllowFileSelectionDialogs": {
            "title": "Allow invocation of file selection dialogs",
            "description": "Allows access to local files on the machine by allowing Google Chrome to display file selection dialogs. If you enable this setting, users can open file selection dialogs as normal",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AllowFileSelectionDialogs"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AllowSyncXHRInPageDismissal": {
            "title": "Allows a page to perform synchronous XHR requests during page dismissal",
            "description": "This policy allows an admin to specify that a page may send synchronous XHR requests during page dismissal. When the policy is set to enabled, pages are allowed to send synchronous XHR requests during page dismissal",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AllowSyncXHRInPageDismissal"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AllowedDomainsForApps": {
            "title": "Define domains allowed to access G Suite",
            "description": "Enables Google Chrome's restricted log in feature in G Suite and prevents users from changing this setting. If you define this setting, the user will only be able to access Google Apps using accounts from the comma separated specified domains (note that to allow gmail.com/googlemail.com accounts, you should add consumer_accounts to the list of domains)",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AllowedDomainsForApps"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "AlternateErrorPagesEnabled": {
            "title": "Enable alternate error pages",
            "description": "Enables the use of alternate error pages that are built into Google Chrome (such as 'page not found') and prevents users from changing this setting",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AlternateErrorPagesEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AlwaysOpenPdfExternally": {
            "title": "Always Open PDF files externally",
            "description": "Disables the internal PDF viewer in Google Chrome. Instead it treats it as download and allows the user to open PDF files with the default application",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AlwaysOpenPdfExternally"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AmbientAuthenticationInPrivateModesEnabled": {
            "title": "Enable Ambient Authentication for profile types",
            "description": "Configuring this policy will allow/disallow ambient authentication for Incognito and Guest profiles in Google Chrome. 0 = Enable ambient authentication in regular sessions only. 1 = Enable ambient authentication in incognito and regular sessions. 2 = Enable ambient authentication in guest and regular sessions. 3 = Enable ambient authentication in regular, incognito and guest sessions",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AmbientAuthenticationInPrivateModesEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2,
                        3
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2,
                        3
                    ],
                    "default": 1
                }
            ]
        },
        "AudioCaptureAllowed": {
            "title": "Allow or deny audio capture",
            "description": "If enabled or not configured (default), the user will be prompted for audio capture access except for URLs configured in the AudioCaptureAllowedUrls list which will be granted access without prompting",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AudioCaptureAllowed"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AudioCaptureAllowedUrls": {
            "title": "URLs that will be granted access to audio capture devices without prompt",
            "description": "Patterns in this list will be matched against the security origin of the requesting URL. If a match is found, access to audio capture devices will be granted without prompt",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AudioCaptureAllowedUrls"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "AudioSandboxEnabled": {
            "title": "Allow the audio sandbox to run",
            "description": "This policy controls the audio process sandbox. If this policy is enabled, the audio process will run sandboxed. If this policy is disabled, the audio process will run unsandboxed and the WebRTC audio-processing module will run in the renderer process. This leaves users open to security risks related to running the audio subsystem unsandboxed. If this policy is not set, the default configuration for the audio sandbox will be used, which may differ per platform. This policy is intended to give enterprises flexibility to disable the audio sandbox if they use security software setups that interfere with the sandbox",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AudioSandboxEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AutoLaunchProtocolsFromOrigins": {
            "title": "Define a list of protocols that can launch an external application from listed origins without prompting the user",
            "description": "(AutoLaunchProtocolsFromOrigins)-Allows you to set a list of protocols, and for each protocol an associated list of allowed origin patterns, that can launch an external application without prompting the user. The trailing separator should not be included when listing the protocol, so list skype instead of skype: or skype://. If this policy is set, a protocol will only be permitted to launch an external application without prompting by policy if the protocol is listed, and the origin of the site trying to launch the protocol matches one of the origin patterns in that protocol's allowed_origins list. If either condition is false the external protocol launch prompt will not be omitted by policy. If this policy is not set, no protocols can launch without a prompt by default. Users may opt out of prompts on a per-protocol/per-site basis unless the ExternalProtocolDialogShowAlwaysOpenCheckbox policy is set to Disabled. This policy has no impact on per-protocol/per-site prompt exemptions set by users",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AutoLaunchProtocolsFromOrigins"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "Protocol": {
                            "type": "object",
                            "title": "Protocol",
                            "properties": {
                                "protocol": {
                                    "title": "Protocol",
                                    "anyOf": [
                                        {
                                            "type": "null",
                                            "title": "Not Configured"
                                        },
                                        {
                                            "title": "Configured",
                                            "type": "string",
                                            "options": {
                                                "inputAttributes": {
                                                    "placeholder": "outlook"
                                                }
                                            }
                                        }
                                    ]
                                },
                                "allowed_origins": {
                                    "title": "Allowed Origins",
                                    "anyOf": [
                                        {
                                            "type": "null",
                                            "title": "Not Configured"
                                        },
                                        {
                                            "title": "Configured",
                                            "type": "array",
                                            "items": {
                                                "type": "string",
                                                "title": "Allowed Origin"
                                            }
                                        }
                                    ]
                                }
                            }
                        }
                    }
                }
            ]
        },
        "AutoOpenAllowedForURLs": {
            "title": "URLs where AutoOpenFileTypes can apply",
            "description": "(AutoOpenAllowedForURLs)-List of URLs specifying which urls AutoOpenFileTypes will apply to. This policy has no impact on automatically open values set by users. If this policy is set, files will only automatically open by policy if the url is part of this set and the file type is listed in AutoOpenFileTypes. If either condition is false the download won't automatically open by policy. If this policy isn't set, all downloads where the file type is in AutoOpenFileTypes will automatically open",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AutoOpenAllowedForURLs"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "URL Pattern"
                    }
                }
            ]
        },
        "AutoOpenFileTypes": {
            "title": "List of file types that should be automatically opened on download",
            "description": "(AutoOpenFileTypes)-List of file types that should be automatically opened on download. The leading separator should not be included when listing the file type, so list txt instead of .txt. Files with types that should be automatically opened will still be subject to the enabled safe browsing checks and won't be opened if they fail those checks. If this policy isn't set, only file types that a user has already specified to automatically be opened will do so when downloaded",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AutoOpenFileTypes"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "File Extension"
                    }
                }
            ]
        },
        "AutofillAddressEnabled": {
            "title": "Enable AutoFill for addresses",
            "description": "Enables Google Chrome's AutoFill feature and allows users to auto complete address information in web forms using previously stored information",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AutofillAddressEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AutofillCreditCardEnabled": {
            "title": "Enable AutoFill for credit cards",
            "description": "Enables Google Chrome's AutoFill feature and allows users to auto complete credit card information in web forms using previously stored information",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AutofillCreditCardEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AutoplayAllowed": {
            "title": "Allow media autoplay",
            "description": "Allows you to control if videos can play automatically (without user consent) with audio content in Google Chrome",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AutoplayAllowed"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AutoplayAllowlist": {
            "title": "Allow media autoplay on an allow list of URL patterns",
            "description": "Controls the allow list of URL patterns that autoplay will always be enabled on. If autoplay is enabled then videos can play automatically (without user consent) with audio content in Google Chrome. A valid URL patterns specifications are: - [*.]domain.tld (matches domain.tld and all sub-domains) - host (matches an exact hostname) - scheme://host:port (supported schemes: http,https) - scheme://[*.]domain.tld:port (supported schemes: http,https) - file://path (The path has to be an absolute path and start with a '/') - a.b.c.d (matches an exact IPv4 ip) - [a:b:c:d:e:f:g:h] (matches an exact IPv6 ip)",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=AutoplayAllowlist"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "AutoplayWhitelist": {
            "title": "Allow media autoplay on a whitelist of URL patterns (Deprecated)",
            "description": "Controls the whitelist of URL patterns that autoplay will always be enabled on. If autoplay is enabled then videos can play automatically (without user consent) with audio content in Google Chrome. A valid URL patterns specifications are: - [*.]domain.tld (matches domain.tld and all sub-domains) - host (matches an exact hostname) - scheme://host:port (supported schemes: http,https) - scheme://[*.]domain.tld:port (supported schemes: http,https) - file://path (The path has to be an absolute path and start with a '/') - a.b.c.d (matches an exact IPv4 ip) - [a:b:c:d:e:f:g:h] (matches an exact IPv6 ip)",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "BlockThirdPartyCookies": {
            "title": "Block third party cookies",
            "description": "Enabling this setting prevents cookies from being set by web page elements that are not from the domain that is in the browser's address bar",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=BlockThirdPartyCookies"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BookmarkBarEnabled": {
            "title": "Enable Bookmark Bar",
            "description": "If you enable this setting, Google Chrome will show a bookmark bar.",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=BookmarkBarEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BrowserAddPersonEnabled": {
            "title": "Enable add person in user manager",
            "description": "If this policy is set to true or not configured, Google Chrome will allow Add Person from the user manager",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=BrowserAddPersonEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BrowserGuestModeEnabled": {
            "title": "Enable guest mode in browser",
            "description": "If this policy is set to true or not configured, Google Chrome will enable guest logins. Guest logins are Google Chrome profiles where all windows are in incognito mode",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=BrowserGuestModeEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BrowserGuestModeEnforced": {
            "title": "Enforce browser guest mode",
            "description": "If this policy is set to enabled, Google Chrome will enforce guest sessions and prevents profile logins. Guest logins are Google Chrome profiles where all windows are in incognito mode",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=BrowserGuestModeEnforced"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BrowserNetworkTimeQueriesEnabled": {
            "title": "Allow queries to a Google time service",
            "description": "Setting this policy to false stops Google Chrome from occasionally sending queries to a Google server to retrieve an accurate timestamp. These queries will be enabled if this policy is set to True or is not set",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=BrowserNetworkTimeQueriesEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BrowserSignin": {
            "title": "Browser sign in settings",
            "description": "This policy controls the sign-in behavior of the browser. It allows you to specify if the user can sign in to Google Chrome with their account and use account related services like Chrome sync. 0 = Disable browser sign-in 1 = Enable browser sign-in 2 = Force users to sign-in to use the browser",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=BrowserSignin"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2
                    ],
                    "default": 0
                }
            ]
        },
        "BrowserThemeColor": {
            "title": "Configure the color of the browser's theme",
            "description": "(BrowserThemeColor)-This policy allows admins to configure the color of Google Chrome's theme. The input string should be a valid hex color string matching the format #RRGGBB",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#BrowserThemeColor"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "#RRGGBB"
                        }
                    }
                }
            ]
        },
        "BrowsingDataLifetime": {
            "type": "array",
            "title": "Browsing Data Lifetiime",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=BrowsingDataLifetime"
                }
            ],
            "items": {
                "type": "object",
                "properties": {
                    "data_types": {
                        "title": "Data Types",
                        "anyOf": [
                            {
                                "type": "null",
                                "title": "Not Configured"
                            },
                            {
                                "title": "Configured",
                                "type": "array",
                                "items": {
                                    "type": "string",
                                    "enum": [
                                        "browsing_history",
                                        "download_history",
                                        "cookies_and_other_site_data",
                                        "cached_images_and_files",
                                        "password_signin",
                                        "autofill",
                                        "site_settings",
                                        "hosted_app_data"
                                    ]
                                }
                            }
                        ]
                    },
                    "time_to_live_in_hours": {
                        "title": "TTL in Hours",
                        "anyOf": [
                            {
                                "type": "null",
                                "title": "Not Configured"
                            },
                            {
                                "title": "Configured",
                                "type": "integer"
                            }
                        ]
                    }
                }
            }
        },
        "BuiltInDnsClientEnabled": {
            "title": "Use built-in DNS client",
            "description": "Controls whether the built-in DNS client is used in Google Chrome. This does not affect which DNS servers are used; just the software stack which is used to communicate with them. For example if the operating system is configured to use an enterprise DNS server, that same server would be used by the built-in DNS client. It is however possible that the built-in DNS client will address servers in different ways by using more modern DNS-related protocols such as DNS-over-TLS",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=BuiltInDnsClientEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BuiltinCertificateVerifierEnabled": {
            "title": "Enable Built-in Certificate Verification Checks",
            "description": "(BuiltinCertificateVerifierEnabled)-When this setting is enabled, Google Chrome will perform verification of server certificates using the built-in certificate verifier. When this setting is disabled, Google Chrome will perform verification of server certificates using the legacy certificate verifier provided by the platform. When this setting is not set, the built-in or the legacy certificate verifier may be used. This policy is planned to be removed in Google Chrome for Mac OS X version 91, when support for the legacy certificate verifier on Mac OS X is planned to be removed",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=BuiltinCertificateVerifierEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "CECPQ2Enabled": {
            "title": "CECPQ2 post-quantum key-agreement enabled for TLS",
            "description": "(CECPQ2Enabled)-If this policy is not configured, or is set to enabled, then Google Chrome will follow the default rollout process for CECPQ2, a post-quantum key-agreement algorithm in TLS",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://chromeenterprise.google/policies/#CECPQ2Enabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "CertificateTransparencyEnforcementDisabledForCas": {
            "title": "Disable Certificate Transparency enforcement for a list of subjectPublicKeyInfo hashes",
            "description": "Disables enforcing Certificate Transparency requirements for a list of subjectPublicKeyInfo hashes. https://cloud.google.com/docs/chrome-enterprise/policies/?policy=CertificateTransparencyEnforcementDisabledForCas",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=CertificateTransparencyEnforcementDisabledForCas"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Public Key Hash"
                    }
                }
            ]
        },
        "CertificateTransparencyEnforcementDisabledForLegacyCas": {
            "title": "Disable Certificate Transparency enforcement for a list of Legacy Certificate Authorities",
            "description": "Disables enforcing Certificate Transparency requirements for a list of Legacy Certificate Authorities. https://cloud.google.com/docs/chrome-enterprise/policies/?policy=CertificateTransparencyEnforcementDisabledForLegacyCas",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=CertificateTransparencyEnforcementDisabledForLegacyCas"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Public Key Hash"
                    }
                }
            ]
        },
        "CertificateTransparencyEnforcementDisabledForUrls": {
            "title": "Disable Certificate Transparency enforcement for a list of URLs",
            "description": "Disables enforcing Certificate Transparency requirements to the listed URLs. A URL pattern is formatted according to https://www.chromium.org/administrators/url-blacklist-filter-format. However, because certificates are valid for a given hostname independent of the scheme, port, or path, only the hostname portion of the URL is considered. Wildcard hosts are not supported",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=CertificateTransparencyEnforcementDisabledForUrls"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "URL"
                    }
                }
            ]
        },
        "ChromeVariations": {
            "title": "Availability of Chrome Update Variations",
            "description": "Configuring this policy allows to specify which variations are allowed to be applied in Google Chrome. Variations provide a mean for offering modifications to Google Chrome without shipping a new version of the browser by selectively enabling or disabling already existing features. Setting the VariationsEnabled (value 0), or leaving the policy not set allows all variations to be applied to the browser. Setting the CriticalFixesOnly (value 1), allows only variations considered critical security or stability fixes to be applied to Google Chrome. Setting the VariationsDisabled (value 2), prevent all variations from being applied to the browser. Please note that this mode can potentially prevent the Google Chrome developers from providing criticial security fixes in a timely manner and is thus not recommended",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ChromeVariations"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2
                    ],
                    "default": 0
                }
            ]
        },
        "ClearBrowsingDataOnExitList": {
            "title": "Clear Browsing Data on Exit",
            "description": "(ClearBrowsingDataOnExitList)-Configures a list of browsing data types that should be deleted when the user closes all browser windows. The available data types are browsing history (browsing_history), download history (download_history), cookies (cookies_and_other_site_data), cache(cached_images_and_files), autofill (autofill), passwords (password_signin), site settings (site_settings) and hosted apps data (hosted_app_data). This policy does not take precedence over AllowDeletingBrowserHistory",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#ClearBrowsingDataOnExitList"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "options": {
                            "enum_titles": [
                                "Browsing History",
                                "Download History",
                                "Cookies and other Site Data",
                                "Cached Imagesa and Files",
                                "Password Sign-in",
                                "Autofill",
                                "Site Settings",
                                "Hosted App Data"
                            ]
                        },
                        "enum": [
                            "browsing_history",
                            "download_history",
                            "cookies_and_other_site_data",
                            "cached_images_and_files",
                            "password_signin",
                            "autofill",
                            "site_settings",
                            "hosted_app_data"
                        ]
                    }
                }
            ]
        },
        "ClickToCallEnabled": {
            "title": "Enable the Click to Call Feature",
            "description": "Enable the Click to Call feature which allows users to send phone numbers from Chrome Desktops to an Android device when the user is Signed-in. For more information, see help center article: https://support.google.com/chrome/answer/9430554?hl=en",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ClickToCallEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "CommandLineFlagSecurityWarningsEnabled": {
            "title": "Enable security warnings for command-line flags",
            "description": "If disabled, prevents security warnings from appearing when Chrome is launched with some potentially dangerous command-line flags",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=CommandLineFlagSecurityWarningsEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ComponentUpdatesEnabled": {
            "title": "Enable component updates in Google Chrome",
            "description": "Enables component updates for all components in Google Chrome when not set or set to True",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ComponentUpdatesEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ContextAwareAccessSignalsAllowlist": {
            "title": "Enable attestation flow for a list of URLs",
            "description": "(ContextAwareAccessSignalsAllowlist)-Enable Chrome Enterprise Platform Identity Connector for a list of URLs",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#ContextAwareAccessSignalsAllowlist"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "URL Pattern"
                    }
                }
            ]
        },
        "DNSInterceptionChecksEnabled": {
            "title": "DNS interception checks enabled",
            "description": "This policy configures a local switch that can be used to disable DNS interception checks. The checks attempt to discover whether the browser is behind a proxy that redirects unknown host names",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DNSInterceptionChecksEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DefaultBrowserSettingEnabled": {
            "title": "Set Google Chrome as Default Browser",
            "description": "Configures the default browser checks in Google Chrome and prevents users from changing them. If you enable this setting, Google Chrome will always check on startup whether it is the default browser and automatically register itself if possible",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DefaultBrowserSettingEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DefaultDownloadDirectory": {
            "title": "Set default download directory",
            "description": "Configures the default directory that Google Chrome will use for downloading files. See https://www.chromium.org/administrators/policy-list-3/user-data-directory-variables for a list of variables that can be used",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DefaultDownloadDirectory"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "DefaultSearchProviderContextMenuAccessAllowed": {
            "title": "Allow default search provider context menu search access",
            "description": "(DefaultSearchProviderContextMenuAccessAllowed)-Enables the use of a default search provider on the context menu. If you set this policy to disabled the search context menu item that relies on your default search provider will not be available. If this policy is set to enabled or not set, the context menu item for your default search provider will be available. The policy value is only appled when the DefaultSearchProviderEnabled policy is enabled, and is not applicable otherwise",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DefaultSearchProviderContextMenuAccessAllowed"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "<##>"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "DeveloperToolsAvailability": {
            "title": "Control where Developer Tools can be used",
            "description": "Allows you to control where Developer Tools can be used 0 = Disallow usage of the Developer Tools on extensions installed by enterprise policy, allow usage of the Developer Tools in other contexts 1 = Allow usage of the Developer Tools 2 = Disallow usage of the Developer Tools",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DeveloperToolsAvailability"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2
                    ],
                    "default": 1
                }
            ]
        },
        "Disable3DAPIs": {
            "title": "Disable support for 3D graphics APIs",
            "description": "Enabling this setting prevents web pages from accessing the graphics processing unit (GPU). Specifically, web pages can not access the WebGL API and plugins can not use the Pepper 3D API",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=Disable3DAPIs"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableSafeBrowsingProceedAnyway": {
            "title": "Disable proceeding from the Safe Browsing warning page",
            "description": "The Safe Browsing service shows a warning page when users navigate to sites that are flagged as potentially malicious. Enabling this setting prevents users from proceeding anyway from the warning page to the malicious site",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DisableSafeBrowsingProceedAnyway"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableScreenshots": {
            "title": "Disable taking screenshots",
            "description": "If enabled, screenshots cannot be taken using keyboard shortcuts or extension APIs",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DisableScreenshots"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DiskCacheDir": {
            "title": "Set disk cache directory",
            "description": "Configures the directory that Google Chrome will use for storing cached files on the disk. See  https://www.chromium.org/administrators/policy-list-3/user-data-directory-variables for a list of variables that can be used",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DiskCacheDir"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "DiskCacheSize": {
            "title": "Set disk cache size in bytes",
            "description": "Configures the cache size that Google Chrome will use for storing cached files on the disk",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DiskCacheSize"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "DnsOverHttpsMode": {
            "title": "Controls the mode of DNS-over-HTTPS",
            "description": "Controls the mode of the DNS-over-HTTPS resolver. Please note that this policy will only set the default mode for each query. The mode may be overridden for special types of queries such as requests to resolve a DNS-over-HTTPS server hostname. off = Disable DNS-over-HTTPS automatic = Enable DNS-over-HTTPS with insecure fallback secure = Enable DNS-over-HTTPS without insecure fallback",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DnsOverHttpsMode"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "DnsOverHttpsTemplates": {
            "title": "Specify URI template of desired DNS-over-HTTPS resolver",
            "description": "The URI template of the desired DNS-over-HTTPS resolver. To specify multiple DNS-over-HTTPS resolvers, separate the corresponding URI templates with spaces",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DnsOverHttpsTemplates"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "DownloadDirectory": {
            "title": "Set download directory",
            "description": "Configures the directory that Google Chrome will use for downloading files",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DownloadDirectory"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "DownloadRestrictions": {
            "title": "Download Restrictions",
            "description": "Configures the type of downloads that Google Chrome will completely block, without letting users override the security decision. 0 = No special restrictions 1 = Block dangerous downloads 2 = Block potentially dangerous downloads 3 = Block all downloads 4 = Block malicious downloads",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DownloadRestrictions"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2,
                        3,
                        4
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2,
                        3,
                        4
                    ],
                    "default": 0
                }
            ]
        },
        "EditBookmarksEnabled": {
            "title": "Enable or disable bookmark editing",
            "description": "If you enable this setting, bookmarks can be added, removed or modified. This is the default also when this policy is not set",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=EditBookmarksEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableExperimentalPolicies": {
            "title": "Enable Experimental Policies",
            "description": "(EnableExperimentalPolicies)-Allows Google Chrome to load experimental policies. WARNING: Experimental policies are unsupported and subject to change or be removed without notice in future version of the browser! An experimental policy may not be finished or still have known or unknown defects. It may be changed or even removed without any notification. By enabling experimental policies, you could lose browser data or compromise your security or privacy. If a policy is not in the list and it's not officially released, its value will be ignored on Beta and Stable channel. If a policy is in the list and it's not officially released, its value will be applied. This policy has no effect on already released policies",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=EnableExperimentalPolicies"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Policy"
                    }
                }
            ]
        },
        "EnableOnlineRevocationChecks": {
            "title": "Enable online OCSP/CRL checks",
            "description": "In light of the fact that soft-fail, online revocation checks provide no effective security benefit, they are disabled by default in Google Chrome version 19 and later. By setting this policy to true, the previous behavior is restored and online OCSP/CRL checks will be performed",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=EnableOnlineRevocationChecks"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnterpriseHardwarePlatformAPIEnabled": {
            "title": "Enables managed extensions to use the Enterprise Hardware Platform API",
            "description": "When this policy is set to enabled, extensions installed by enterprise policy are allowed to use the Enterprise Hardware Platform API",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=EnterpriseHardwarePlatformAPIEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ExternalProtocolDialogShowAlwaysOpenCheckbox": {
            "title": "Show an Always open checkbox in external protocol dialog",
            "description": "This policy controls whether or not the Always open checkbox is shown on external protocol launch confirmation prompts. If this policy is set to True, when an external protocol confirmation is shown, the user may choose to Always open the protocol without future confirmation prompts",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ExternalProtocolDialogShowAlwaysOpenCheckbox"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnterpriseRealTimeUrlCheckMode": {
            "title": "Check Safe Browsing status of URLs in real time",
            "description": "(EnterpriseRealTimeUrlCheckMode)-This policy controls checking URLs in real time to identify unsafe URLs",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#EnterpriseRealTimeUrlCheckMode"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "Real time URL check is disabled",
                            "Real time check for main frame URLs is enabled"
                        ]
                    },
                    "enum": [
                        0,
                        1
                    ]
                }
            ]
        },
        "FetchKeepaliveDurationSecondsOnShutdown": {
            "title": "Fetch keepalive duration on Shutdown",
            "description": "(FetchKeepaliveDurationSecondsOnShutdown)-Controls the duration (in seconds) allowed for keepalive requests on browser shutdown",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#FetchKeepaliveDurationSecondsOnShutdown"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "minimum": 0,
                    "maximum": 5,
                    "default": 0
                }
            ]
        },
        "ForceEphemeralProfiles": {
            "title": "Ephemeral profile",
            "description": "If set to enabled this policy forces the profile to be switched to ephemeral mode. If this policy is specified as an OS policy (e.g. GPO on Windows) it will apply to every profile on the system; if the policy is set as a Cloud policy it will apply only to a profile signed in with a managed account",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ForceEphemeralProfiles"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ForceGoogleSafeSearch": {
            "title": "Force Google SafeSearch",
            "description": "Forces queries in Google Web Search to be done with SafeSearch set to active and prevents users from changing this setting",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ForceGoogleSafeSearch"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ForcedLanguages": {
            "title": "Configure the content and order of preferred languages",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#ForcedLanguages"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Language"
                    }
                }
            ]
        },
        "ForceYouTubeRestrict": {
            "title": "Force minimum YouTube Restricted Mode",
            "description": "Enforces a minimum Restricted Mode on YouTube and prevents users from picking a less restricted mode. If this setting is set to Strict, Strict Restricted Mode on YouTube is always active. If this setting is set to Moderate, the user may only pick Moderate Restricted Mode and Strict Restricted Mode on YouTube, but cannot disable Restricted Mode. If this setting is set to Off or no value is set, Restricted Mode on YouTube is not enforced by Google Chrome. External policies such as YouTube policies might still enforce Restricted Mode, though. 0 = Do not enforce Restricted Mode on YouTube 1 = Enforce at least Moderate Restricted Mode on YouTube 2 = Enforce Strict Restricted Mode for YouTube",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ForceYouTubeRestrict"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2
                    ],
                    "default": 1
                }
            ]
        },
        "GloballyScopeHTTPAuthCacheEnabled": {
            "title": "Enable globally scoped HTTP auth cache",
            "description": "This policy configures a single global per profile cache with HTTP server authentication credentials. If this policy is unset or disabled, the browser will use the default behavior of cross-site auth, which as of version 80, will be to scope HTTP server authentication credentials by top-level site, so if two sites use resources from the same authenticating domain, credentials will need to be provided independently in the context of both sites. Cached proxy credentials will be reused across sites. If the policy is enabled, HTTP auth credentials entered in the context of one site will automatically be used in the context of another. Enabling this policy leaves sites open to some types of cross-site attacks, and allows users to be tracked across sites even without cookies by adding entries to the HTTP auth cache using credentials embedded in URLs. This policy is intended to give enterprises depending on the legacy behavior a chance to update their login procedures, and will be removed in the future",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=GloballyScopeHTTPAuthCacheEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "HSTSPolicyBypassList": {
            "title": "List of names that will bypass the HSTS policy check",
            "description": "Hostnames specified in this list will be exempt from the HSTS policy check that could potentially upgrade requests from http to https. Only single-label hostnames are allowed in this policy",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=HSTSPolicyBypassList"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "HardwareAccelerationModeEnabled": {
            "title": "Use hardware acceleration when available",
            "description": "If this policy is set to true or left unset, hardware acceleration will be enabled unless a certain GPU feature is blacklisted",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=HardwareAccelerationModeEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "HeadlessMode": {
            "title": "Control use of the Headless Mode",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#HeadlessMode"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "Allow the use of headless mode",
                            "Do not allow the use of headless mode"
                        ]
                    },
                    "enum": [
                        1,
                        2
                    ]
                }
            ]
        },
        "HideWebStoreIcon": {
            "title": "Hide the web store from the New Tab Page and app launcher",
            "description": "Hide the Chrome Web Store app and footer link from the New Tab Page and Google Chrome OS app launcher",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=HideWebStoreIcon"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "HistoryClustersVisible": {
            "title": "Show history clusters on the Chrome history page",
            "description": "(HistoryClustersVisible)-This policy controls the visibility of history clusters on the Chrome history page",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://chromeenterprise.google/policies/#HistoryClustersVisible"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "HttpsOnlyMode": {
            "title": "Allow HTTPS-Only Mode to be enabled",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#HttpsOnlyMode"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "enum_titles": [
                            "Allowed",
                            "Disallowed",
                            "Force Enabled (Not Currently Supported)"
                        ]
                    },
                    "enum": [
                        "allowed",
                        "disallowed",
                        "force_enabled"
                    ]
                }
            ]
        },
        "ImportAutofillFormData": {
            "title": "Import autofill form data from default browser on first run",
            "description": "This policy forces the autofill form data to be imported from the previous default browser if enabled. If enabled, this policy also affects the import dialog",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ImportAutofillFormData"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ImportBookmarks": {
            "title": "Import bookmarks from default browser on first run",
            "description": "This policy forces bookmarks to be imported from the current default browser if enabled. If enabled, this policy also affects the import dialog",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ImportBookmarks"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ImportHistory": {
            "title": "Import browsing history from default browser on first run",
            "description": "This policy forces the browsing history to be imported from the current default browser if enabled. If enabled, this policy also affects the import dialog",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ImportHistory"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ImportHomepage": {
            "title": "Import of homepage from default browser on first run",
            "description": "This policy forces the home page to be imported from the current default browser if enabled",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ImportHomepage"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ImportSavedPasswords": {
            "title": "Import saved passwords from default browser on first run",
            "description": "This policy forces the saved passwords to be imported from the previous default browser if enabled. If enabled, this policy also affects the import dialog",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ImportSavedPasswords"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ImportSearchEngine": {
            "title": "Import search engines from default browser on first run",
            "description": "This policy forces search engines to be imported from the current default browser if enabled. If enabled, this policy also affects the import dialog",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ImportSearchEngine"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "IncognitoModeAvailability": {
            "title": "Incognito mode availability",
            "description": "Specifies whether the user may open pages in Incognito mode in Google Chrome. 0 = Incognito mode available 1 = Incognito mode disabled 2 = Incognito mode forced",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=IncognitoModeAvailability"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2
                    ],
                    "default": 1
                }
            ]
        },
        "InsecureFormsWarningsEnabled": {
            "title": "Enable warnings for insecure forms",
            "description": "(InsecureFormsWarningsEnabled)-This policy controls the treatment for insecure forms (forms that submit over HTTP) embedded in secure (HTTPS) sites in the browser. If the policy is enabled or unset, a full page warning will be shown when an insecure form is submitted. Additionally, a warning bubble will be shown next to the form fields when they are focused, and autofill will be disabled for those forms. If the policy is disabled, warnings will not be shown for insecure forms, and autofill will work normally",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=InsecureFormsWarningsEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "InsecurePrivateNetworkRequestsAllowed": {
            "title": "Allow insecure requests to private networks",
            "description": "(InsecurePrivateNetworkRequestsAllowed)-Controls whether websites are allowed to make requests to more-private network endpoints in an insecure manner. This policy relates to the Private Network Access specification. See https://wicg.github.io/private-network-access/ for more details",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://chromeenterprise.google/policies/#InsecurePrivateNetworkRequestsAllowed"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "InsecurePrivateNetworkRequestsAllowedForUrls": {
            "title": "Private insecure network allow list",
            "description": "(InsecurePrivateNetworkRequestsAllowedForUrls)-List of URL patterns. Requests initiated from websites served by matching origins are not subject to Private Network Access checks",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#InsecurePrivateNetworkRequestsAllowedForUrls"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "URL Pattern"
                    }
                }
            ]
        },
        "IntensiveWakeUpThrottlingEnabled": {
            "title": "Enable Intensive Wakeup Throttling for Javascript",
            "description": "(IntensiveWakeUpThrottlingEnabled)-When enabled the IntensiveWakeUpThrottling feature causes Javascript timers in background tabs to be aggressively throttled and coalesced, running no more than once per minute after a page has been backgrounded for 5 minutes or more. This is a web standards compliant feature, but it may break functionality on some websites by causing certain actions to be delayed by up to a minute. However, it results in significant CPU and battery savings when enabled. See https://bit.ly/30b1XR4 for more details. If this policy is set to enabled then the feature will be force enabled, and users will not be able to override this. If this policy is set to disabled then the feature will be force disabled, and users will not be able to override this. If this policy is left unset then the feature will be controlled by its own internal logic, which can be manually configured by users. Note that the policy is applied per renderer process, with the most recent value of the policy setting in force when a renderer process starts. A full restart is required to ensure that all loaded tabs receive a consistent policy setting. It is harmless for processes to be running with different values of this policy",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=IntensiveWakeUpThrottlingEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "IsolateOrigins": {
            "title": "Enable Site Isolation for specified origins",
            "description": "If the policy is enabled, each of the named origins in a comma-separated list will run in its own process. This will also isolate origins named by subdomains; e.g. specifying https://example.com/ will also cause https://foo.example.com/ to be isolated as part of the https://example.com/ site. If the policy is not configured or disabled, the user will be able to change this setting",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=IsolateOrigins"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "LensRegionSearchEnabled": {
            "title": "Allow Google Lens region search menu item to be shown in context menu if supported",
            "description": "(LensRegionSearchEnabled)-Leaving the policy unset or setting it to Enabled allows users to view and use the Google Lens region search menu item in the context menu",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://chromeenterprise.google/policies/#LensRegionSearchEnabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "LockIconInAddressBarEnabled": {
            "title": "Enable lock icon in the omnibox for secure connections",
            "description": "(LockIconInAddressBarEnabled)-This policy controls the treatment for lock icon in the omnibox. From Chrome M93, there is a new omnibox icon for secure connections. If the policy is Enabled, Chrome will use the existing lock icon for secure connections",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://chromeenterprise.google/policies/#LockIconInAddressBarEnabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "LookalikeWarningAllowlistDomains": {
            "title": "Suppress lookalike domain warnings on domains",
            "description": "(LookalikeWarningAllowlistDomains)-This policy prevents the display of lookalike URL warnings on the sites listed. These warnings are typically shown on sites that Google Chrome believes might be trying to spoof another site the user is familiar with. If the policy is enabled and set to one or more domains, no lookalike warnings pages will be shown when the user visits pages on that domain. If the policy is disabled, not set, or set to an empty list, warnings may appear on any site the user visits. A hostname can be allowed with a complete host match, or any domain match. For example, a URL like https://foo.example.com/bar may have warnings suppressed if this list includes either foo.example.com or example.com",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=LookalikeWarningAllowlistDomains"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Domain"
                    }
                }
            ]
        },
        "ManagedAccountsSigninRestriction": {
            "title": "Add restrictions on managed accounts",
            "description": "(ManagedAccountsSigninRestriction)-This policy requires SigninInterceptionEnabled to be set to True to take effect. If this policy is set to 'primary_account' at the machine level, all managed accounts will be forced to be primary. If this policy is set to 'primary_account' on an account, that account will always be a primary account, but may have secondary accounts in its profile",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#ManagedAccountsSigninRestriction"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "enum_titles": [
                            "Primary Account",
                            "Strict Primary Account",
                            "None"
                        ]
                    },
                    "enum": [
                        "primary_account",
                        "primary_account_strict",
                        "none"
                    ]
                }
            ]
        },
        "MaxConnectionsPerProxy": {
            "title": "Maximal number of concurrent connections to the proxy server",
            "description": "Specifies the maximal number of simultaneous connections to the proxy server. Some proxy servers can not handle high number of concurrent connections per client and this can be solved by setting this policy to a lower value. The value of this policy should be lower than 100 and higher than 6 and the default value is 32",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=MaxConnectionsPerProxy"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "default": 32
                }
            ]
        },
        "MaxInvalidationFetchDelay": {
            "title": "Maximum fetch delay after a policy invalidation",
            "description": "Specifies the maximum delay in milliseconds between receiving a policy invalidation and fetching the new policy from the device management service. Setting this policy overrides the default value of 10000 milliseconds. Valid values for this policy are in the range from 1000 (1 second) to 300000 (5 minutes). Any values not in this range will be clamped to the respective boundary",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=MaxInvalidationFetchDelay"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "MediaRecommendationsEnabled": {
            "title": "Enable Media Recommendations",
            "description": "(MediaRecommendationsEnabled)-By default the browser will show media recommendations that are personalized to the user. Setting this policy to Disabled will result in these recommendations being hidden from the user. Setting this policy to Enabled or leaving it unset will result in the media recommendations being shown to the user",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=MediaRecommendationsEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "MediaRouterCastAllowAllIPs": {
            "title": "Allow Google Cast to connect to Cast devices on all IP addresses",
            "description": "If this policy is set to true, Google Cast will connect to Cast devices on all IP addresses, not just RFC1918/RFC4193 private addresses. If this policy is set to false, Google Cast will connect to Cast devices on RFC1918/RFC4193 private addresses only",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=MediaRouterCastAllowAllIPs"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "MetricsReportingEnabled": {
            "title": "Enable reporting of usage and crash-related data",
            "description": "Enables anonymous reporting of usage and crash-related data about Google Chrome to Google and prevents users from changing this setting",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=MetricsReportingEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "NTPCardsVisible": {
            "title": "Show cards on the New Tab Page",
            "description": "(NTPCardsVisible)-This policy controls the visibility of cards on the New Tab Page. Cards surface entry points to launch common user journeys based on the user's browsing behavior",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "NTPContentSuggestionsEnabled": {
            "title": "Show content suggestions on the New Tab page",
            "description": "(NTPContentSuggestionsEnabled)-Setting the policy to True or leaving it unset displays autogenerated content suggestions on the New Tab page, based on the user's browsing history, interests, or location",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "NTPCustomBackgroundEnabled": {
            "title": "Allow users to customize the background on the New Tab page",
            "description": "If the policy is set to false, the New Tab page won't allow users to customize the background. Any existing custom background will be permanently removed even if the policy is set to true later",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=NTPCustomBackgroundEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "NearbyShareAllowed": {
            "title": "Allow Nearby Share to be enabled",
            "description": "(NearbyShareAllowed)-If this setting is enabled, users will be allowed to opt in to Nearby Share, which allows them to send and receive files from people closeby",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "NetworkPredictionOptions": {
            "title": "Enable network prediction",
            "description": "Enables network prediction in Google Chrome and prevents users from changing this setting. 0 = Predict network actions on any network connection 1 = Predict network actions on any network that is not cellular. (Deprecated in 50, removed in 52. After 52, if value 1 is set, it will be treated as 0 - predict network actions on any network connection.) 2 = Do not predict network actions on any network connection",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=NetworkPredictionOptions"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2
                    ],
                    "default": 0
                }
            ]
        },
        "OnBulkDataEntryEnterpriseConnector": {
            "title": "Configuration policy for the OnBulkDataEntry Chrome Enterprise Connector",
            "description": "(OnBulkDataEntryEnterpriseConnector)-List of Chrome Enterprise Connectors services settings to be applied to the OnBulkDataEntry Enterprise Connector, which triggers when data is entered in Chrome from the clipboard or by drag and dropping web content",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#OnBulkDataEntryEnterpriseConnector"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "properties": {
                            "block_until_verdict": {
                                "type": "integer"
                            },
                            "custom_messages": {
                                "items": {
                                    "properties": {
                                        "language": {
                                            "type": "string"
                                        },
                                        "learn_more_url": {
                                            "type": "string"
                                        },
                                        "message": {
                                            "type": "string"
                                        },
                                        "tag": {
                                            "type": "string"
                                        }
                                    },
                                    "type": "object"
                                },
                                "type": "array"
                            },
                            "disable": {
                                "items": {
                                    "properties": {
                                        "tags": {
                                            "items": {
                                                "type": "string"
                                            },
                                            "type": "array"
                                        },
                                        "url_list": {
                                            "items": {
                                                "type": "string"
                                            },
                                            "type": "array"
                                        }
                                    },
                                    "type": "object"
                                },
                                "type": "array"
                            },
                            "enable": {
                                "items": {
                                    "properties": {
                                        "tags": {
                                            "items": {
                                                "type": "string"
                                            },
                                            "type": "array"
                                        },
                                        "url_list": {
                                            "items": {
                                                "type": "string"
                                            },
                                            "type": "array"
                                        }
                                    },
                                    "type": "object"
                                },
                                "type": "array"
                            },
                            "minimum_data_size": {
                                "minimum": 0,
                                "type": "integer"
                            },
                            "require_justification_tags": {
                                "items": {
                                    "type": "string"
                                },
                                "type": "array"
                            },
                            "service_provider": {
                                "type": "string"
                            }
                        },
                        "type": "object"
                    }
                }
            ]
        },
        "OnFileAttachedEnterpriseConnector": {
            "title": "Configuration policy for the OnFileAttached Chrome Enterprise Connector",
            "description": "(OnFileAttachedEnterpriseConnector)-List of Chrome Enterprise Connectors services settings to be applied to the OnFileAttached Enterprise Connector, which triggers when a file is attached to Chrome",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#OnFileAttachedEnterpriseConnector"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "properties": {
                            "block_large_files": {
                                "type": "boolean"
                            },
                            "block_password_protected": {
                                "type": "boolean"
                            },
                            "block_until_verdict": {
                                "type": "integer"
                            },
                            "custom_messages": {
                                "items": {
                                    "properties": {
                                        "language": {
                                            "type": "string"
                                        },
                                        "learn_more_url": {
                                            "type": "string"
                                        },
                                        "message": {
                                            "type": "string"
                                        },
                                        "tag": {
                                            "type": "string"
                                        }
                                    },
                                    "type": "object"
                                },
                                "type": "array"
                            },
                            "disable": {
                                "items": {
                                    "properties": {
                                        "tags": {
                                            "items": {
                                                "type": "string"
                                            },
                                            "type": "array"
                                        },
                                        "url_list": {
                                            "items": {
                                                "type": "string"
                                            },
                                            "type": "array"
                                        }
                                    },
                                    "type": "object"
                                },
                                "type": "array"
                            },
                            "enable": {
                                "items": {
                                    "properties": {
                                        "tags": {
                                            "items": {
                                                "type": "string"
                                            },
                                            "type": "array"
                                        },
                                        "url_list": {
                                            "items": {
                                                "type": "string"
                                            },
                                            "type": "array"
                                        }
                                    },
                                    "type": "object"
                                },
                                "type": "array"
                            },
                            "require_justification_tags": {
                                "items": {
                                    "type": "string"
                                },
                                "type": "array"
                            },
                            "service_provider": {
                                "type": "string"
                            }
                        },
                        "type": "object"
                    }
                }
            ]
        },
        "OnFileDownloadedEnterpriseConnector": {
            "title": "Configuration policy for the OnFileDownloaded Chrome Enterprise Connector",
            "description": "(OnFileDownloadedEnterpriseConnector)-List of Chrome Enterprise Connectors services settings to be applied to the OnFileDownloaded Enterprise Connector, which triggers when a file is downloaded in Chrome",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#OnFileDownloadedEnterpriseConnector"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "properties": {
                            "block_large_files": {
                                "type": "boolean"
                            },
                            "block_password_protected": {
                                "type": "boolean"
                            },
                            "block_until_verdict": {
                                "type": "integer"
                            },
                            "custom_messages": {
                                "items": {
                                    "properties": {
                                        "language": {
                                            "type": "string"
                                        },
                                        "learn_more_url": {
                                            "type": "string"
                                        },
                                        "message": {
                                            "type": "string"
                                        },
                                        "tag": {
                                            "type": "string"
                                        }
                                    },
                                    "type": "object"
                                },
                                "type": "array"
                            },
                            "disable": {
                                "items": {
                                    "properties": {
                                        "tags": {
                                            "items": {
                                                "type": "string"
                                            },
                                            "type": "array"
                                        },
                                        "url_list": {
                                            "items": {
                                                "type": "string"
                                            },
                                            "type": "array"
                                        }
                                    },
                                    "type": "object"
                                },
                                "type": "array"
                            },
                            "enable": {
                                "items": {
                                    "properties": {
                                        "tags": {
                                            "items": {
                                                "type": "string"
                                            },
                                            "type": "array"
                                        },
                                        "url_list": {
                                            "items": {
                                                "type": "string"
                                            },
                                            "type": "array"
                                        }
                                    },
                                    "type": "object"
                                },
                                "type": "array"
                            },
                            "require_justification_tags": {
                                "items": {
                                    "type": "string"
                                },
                                "type": "array"
                            },
                            "service_provider": {
                                "type": "string"
                            }
                        },
                        "type": "object"
                    }
                }
            ]
        },
        "OnSecurityEventEnterpriseConnector": {
            "title": "Configuration policy for the OnSecurityEvent Chrome Enterprise Connector",
            "description": "(OnSecurityEventEnterpriseConnector)-List of Chrome Enterprise Connectors services settings to be applied to the OnSecurityEvent Enterprise Connector, which triggers when a security event occurs in Chrome. This includes negative verdicts from analysis Enterprise Connectors, password reuse, navigations to unsafe pages and other security sensitive user actions",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#OnSecurityEventEnterpriseConnector"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "properties": {
                            "enabled_event_names": {
                                "items": {
                                    "type": "string"
                                },
                                "type": "array"
                            },
                            "service_provider": {
                                "type": "string"
                            }
                        },
                        "type": "object"
                    }
                }
            ]
        },
        "OverrideSecurityRestrictionsOnInsecureOrigin": {
            "title": "Origins or hostname patterns for which restrictions on insecure origins should not apply",
            "description": "The policy specifies a list of origins (URLs) or hostname patterns (such as *.example.com) for which security restrictions on insecure origins will not apply",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=OverrideSecurityRestrictionsOnInsecureOrigin"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "PaymentMethodQueryEnabled": {
            "title": "Allow websites to query for available payment methods",
            "description": "Allows you to set whether websites are allowed to check if the user has payment methods saved",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PaymentMethodQueryEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PolicyAtomicGroupsEnabled": {
            "title": "Enables the concept of policy atomic groups",
            "description": "If this policy is enabled, policies coming from the an atomic group that do not share the source with the highest priority from that group will be ignored",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PolicyAtomicGroupsEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PolicyDictionaryMultipleSourceMergeList": {
            "title": "Allow merging dictionary policies from different sources. ",
            "description": "Setting the policy allows merging of selected policies when they come from different sources, with the same scopes and level. This merging is in the first level keys of the dictionary from each source. The key coming from the highest priority source takes precedence",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PolicyDictionaryMultipleSourceMergeList"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "PolicyListMultipleSourceMergeList": {
            "title": "Allow merging list policies from different sources",
            "description": "Setting the policy allows merging of selected policies when they come from different sources, with the same scopes and level",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PolicyListMultipleSourceMergeList"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "PolicyRefreshRate": {
            "title": "Refresh rate for user policy",
            "description": "Specifies the period in milliseconds at which the device management service is queried for user policy information. Setting this policy overrides the default value of 3 hours. Valid values for this policy are in the range from 1800000 (30 minutes) to 86400000 (1 day)",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PolicyRefreshRate"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "ProfilePickerOnStartupAvailability": {
            "title": "Profile picker availability on startup",
            "description": "(ProfilePickerOnStartupAvailability)-Specifies whether the profile picker is enabled, disabled or forced at the browser startup",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#ProfilePickerOnStartupAvailability"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "Profile picker available at startup",
                            "Profile picker disabled at startup",
                            "Profile picker forced at startup"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2
                    ]
                }
            ]
        },
        "PromotionalTabsEnabled": {
            "title": "Enable showing full-tab promotional content",
            "description": "Allows you to control the presentation of full-tab promotional and/or educational content in Google Chrome",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PromotionalTabsEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PromptForDownloadLocation": {
            "title": "Ask where to save each file before downloading",
            "description": "If the policy is enabled, the user will be asked where to save each file before downloading",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PromptForDownloadLocation"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ProxySettings": {
            "type": "object",
            "title": "Proxy settings",
            "description": "Setting the policy configures the proxy settings for Chrome and ARC-apps, which ignore all proxy-related options specified from the command line",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ProxySettings"
                }
            ],
            "properties": {
                "ProxyMode": {
                    "title": "Proxy Mode",
                    "description": "Sets the proxy mode",
                    "type": "string"
                },
                "ProxyPacUrl": {
                    "title": "Proxy PAC Url",
                    "description": "Sets the proxy PAC URL",
                    "type": "string"
                },
                "ProxyServer": {
                    "title": "Proxy Server",
                    "description": "Sets the proxy server",
                    "type": "string"
                },
                "ProxyServerMode": {
                    "title": "Proxy server mode",
                    "description": "Sets the proxy server mode",
                    "type": "integer"
                },
                "ProxyBypassList": {
                    "title": "Proxy bypass list",
                    "description": "Sets the proxy bypass list",
                    "type": "string"
                }
            }
        },
        "QuicAllowed": {
            "title": "Allow QUIC protocol",
            "description": "(QuicAllowed)-Setting the policy to Enabled or leaving it unset allows the use of QUIC protocol in Google Chrome",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=QuicAllowed"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "RelaunchNotification": {
            "title": "Notify a user that a browser relaunch or device restart is recommended or required",
            "description": "Notify users that Google Chrome must be relaunched or Google Chrome OS must be restarted to apply a pending update. 1 = Show a recurring prompt to the user indicating that a relaunch is recommended 2 = Show a recurring prompt to the user indicating that a relaunch is required",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=RelaunchNotification"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        1,
                        2
                    ],
                    "enum_titles": [
                        1,
                        2
                    ],
                    "default": 1
                }
            ]
        },
        "RelaunchNotificationPeriod": {
            "title": "Set the time period for update notifications",
            "description": "Allows you to set the time period, in milliseconds, over which users are notified that Google Chrome must be relaunched or that a Google Chrome OS device must be restarted to apply a pending update",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=RelaunchNotificationPeriod"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "RelaunchWindow": {
            "type": "object",
            "title": "Set the time interval for relaunch",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#RelaunchWindow"
                }
            ],
            "properties": {
                "entries": {
                    "items": {
                        "properties": {
                            "duration_mins": {
                                "description": "Time period (minutes) that specifies the length of the relaunch window.",
                                "maximum": 1440,
                                "minimum": 1,
                                "type": "integer"
                            },
                            "start": {
                                "description": "Time interpreted in local wall-clock 24h format.",
                                "id": "Time",
                                "properties": {
                                    "hour": {
                                        "maximum": 23,
                                        "minimum": 0,
                                        "type": "integer"
                                    },
                                    "minute": {
                                        "maximum": 59,
                                        "minimum": 0,
                                        "type": "integer"
                                    }
                                },
                                "required": [
                                    "hour",
                                    "minute"
                                ],
                                "type": "object"
                            }
                        },
                        "required": [
                            "start",
                            "duration_mins"
                        ],
                        "type": "object"
                    },
                    "type": "array"
                }
            }
        },
        "RemoteDebuggingAllowed": {
            "title": "Allow remote debugging",
            "description": "(RemoteDebuggingAllowed)-Controls whether users may use remote debugging",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://chromeenterprise.google/policies/#RemoteDebuggingAllowed"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "RoamingProfileLocation": {
            "title": "Set the roaming profile directory",
            "description": "(RoamingProfileLocation)-Configures the directory that Google Chrome will use for storing the roaming copy of the profiles",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#RoamingProfileLocation"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "/Users/Shared/ChromeRoamingProfiles"
                        }
                    }
                }
            ]
        },
        "RoamingProfileSupportEnabled": {
            "title": "Enable the creation of roaming copies for Google Chrome profile data",
            "description": "(RoamingProfileSupportEnabled)-If you enable this setting, the settings stored in Google Chrome profiles like bookmarks, autofill data, passwords, etc. will also be written to a file stored in the Roaming user profile folder or a location specified by the Administrator through the RoamingProfileLocation policy. Enabling this policy disables cloud sync",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://chromeenterprise.google/policies/#RoamingProfileSupportEnabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "RestrictSigninToPattern": {
            "title": "Restrict which Google accounts are allowed to be set as browser primary accounts in Google Chrome",
            "description": "Contains a regular expression which is used to determine which Google accounts can be set as browser primary accounts in Google Chrome (i.e. the account that is chosen during the Sync opt-in flow)",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=RestrictSigninToPattern"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "RunAllFlashInAllowMode": {
            "title": "Extend Flash content setting to all content",
            "description": "If you enable this setting, all Flash content embedded on websites that have been set to allow Flash in content settings -- either by the user or by enterprise policy -- will be run, including content from other origins or small content",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=RunAllFlashInAllowMode"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SSLErrorOverrideAllowed": {
            "title": "Allow proceeding from the SSL warning page",
            "description": "Chrome shows a warning page when users navigate to sites that have SSL errors. By default or when this policy is set to true, users are allowed to click through these warning pages",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SSLErrorOverrideAllowed"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SSLErrorOverrideAllowedForOrigins": {
            "title": "Allow proceeding from the SSL warning page on specific origins",
            "description": "(SSLErrorOverrideAllowedForOrigins)-If SSLErrorOverrideAllowed is Disabled, setting the policy lets you set a list of origin patterns that specify the sites where a user can click through warning pages Google Chrome shows when users navigate to sites that have SSL errors",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#SSLErrorOverrideAllowedForOrigins"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "URL Pattern"
                    }
                }
            ]
        },
        "SSLVersionMin": {
            "title": "Minimum SSL version enabled",
            "description": "If this policy is not configured then Google Chrome uses a default minimum version which is TLS 1.0. Otherwise it may be set to one of the following values: tls1, tls1.1 or tls1.2",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SSLVersionMin"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "SafeSitesFilterBehavior": {
            "title": "Control SafeSites adult content filtering",
            "description": "This policy controls the application of the SafeSites URL filter. This filter uses the Google Safe Search API to classify URLs as pornographic or not. 0 = Do not filter sites for adult content 1 = Filter top level sites (but not embedded iframes) for adult content",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SafeSitesFilterBehavior"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1
                    ],
                    "enum_titles": [
                        0,
                        1
                    ],
                    "default": 0
                }
            ]
        },
        "SandboxExternalProtocolBlocked": {
            "title": "Allow Chrome to block navigations toward external protocols in sandboxed iframes",
            "description": "(SandboxExternalProtocolBlocked)-Chrome will block navigations toward external protocols inside sandboxed iframe",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://chromeenterprise.google/policies/#SandboxExternalProtocolBlocked"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "SavingBrowserHistoryDisabled": {
            "title": "Disable saving browser history",
            "description": "Disables saving browser history in Google Chrome and prevents users from changing this setting",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SavingBrowserHistoryDisabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ScrollToTextFragmentEnabled": {
            "title": "Enable scrolling to text specified in URL fragments",
            "description": "(ScrollToTextFragmentEnabled)-This feature allows for hyperlinks and address bar URL navigations to target specific text within a web page, which will be scrolled to once the loading of the web page is complete",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ScrollToTextFragmentEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SearchSuggestEnabled": {
            "title": "Enable search suggestions",
            "description": "Enables search suggestions in Google Chrome's omnibox and prevents users from changing this setting",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SearchSuggestEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SecurityKeyPermitAttestation": {
            "title": "URLs/domains automatically permitted direct Security Key attestation",
            "description": "Setting the policy specifies URLs and domains for which no prompt appears when attestation certificates from Security Keys are requested. A signal is also sent to the Security Key indicating that individual attestation may be used. Without this, when sites request attestation of Security Keys, users are prompted in Google Chrome version 65 and later. URLs will only match as U2F appIDs. Domains only match as webauthn RP IDs. So to cover both U2F and webauthn APIs, list the appID URL and domain for a given site",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SecurityKeyPermitAttestation"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "SharedArrayBufferUnrestrictedAccessAllowed": {
            "title": "Specifies whether SharedArrayBuffers can be used in a non cross-origin-isolated context",
            "description": "(SharedArrayBufferUnrestrictedAccessAllowed)-Specifies whether SharedArrayBuffers can be used in a non cross-origin-isolated context",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://chromeenterprise.google/policies/#SharedArrayBufferUnrestrictedAccessAllowed"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "SharedClipboardEnabled": {
            "title": "Enable the Shared Clipboard Feature",
            "description": "Enable the Shared Clipboard feature which allows users to send text between Chrome Desktops and an Android device when Sync is enabled and the user is Signed-in",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SharedClipboardEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ShowAppsShortcutInBookmarkBar": {
            "title": "Show the apps shortcut in the bookmark bar",
            "description": "Enables or disables the apps shortcut in the bookmark bar",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ShowAppsShortcutInBookmarkBar"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ShowFullUrlsInAddressBar": {
            "title": "Show Full URLs",
            "description": "(ShowFullUrlsInAddressBar)-This feature enables display of the full URL in the address bar. If this policy is set to True, then the full URL will be shown in the address bar, including schemes and subdomains. If this policy is set to False, then the default URL display will apply. If this policy is left unset, then the default URL display will apply and the user will be able to toggle between default and full URL display with a context menu option",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=ShowFullUrlsInAddressBar"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SignedHTTPExchangeEnabled": {
            "title": "Enable Signed HTTP Exchange (SXG) support",
            "description": "Enable support for Signed HTTP Exchange (SXG)",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SignedHTTPExchangeEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SigninInterceptionEnabled": {
            "title": "Enable signin interception",
            "description": "(SigninInterceptionEnabled)-This settings enables or disables signin interception",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://chromeenterprise.google/policies/#SigninInterceptionEnabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "SitePerProcess": {
            "title": "Enable Site Isolation for every site",
            "description": "Setting the policy to Enabled isolates all sites. (Each site runs in its own process.) Setting the policy to Disabled or leaving it unset doesn't turn off site isolation, but it lets users opt out (for example, by using Disable site isolation in chrome://flags). IsolateOrigins might also be useful for fine-tuning origins. On Google Chrome OS version 76 and earlier, set the DeviceLoginScreenSitePerProcess device policy to the same value",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SitePerProcess"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SpellCheckServiceEnabled": {
            "title": "Enable or disable spell checking web service",
            "description": "Google Chrome can use a Google web service to help resolve spelling errors. If this setting is enabled, then this service is always used. If this setting is disabled, then this service is never used",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SpellCheckServiceEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SpellcheckEnabled": {
            "title": "Enable spellcheck",
            "description": "If this policy is not set, the user can enable or disable spellcheck in the language settings",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SpellcheckEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "StricterMixedContentTreatmentEnabled": {
            "title": "Enable stricter treatment for mixed content (Deprecated)",
            "description": "This policy controls the treatment for mixed content (HTTP content in HTTPS sites) in the browser. If the policy is set to true or unset, audio and video mixed content will be autoupgraded to HTTPS (i.e. the URL will be rewritten as HTTPS, without a fallback if the resource is not available over HTTPS) and a 'Not Secure' warning will be shown in the URL bar for image mixed content",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SuppressUnsupportedOSWarning": {
            "title": "Suppress the unsupported OS warning",
            "description": "Suppresses the warning that appears when Google Chrome is running on a computer or operating system that is no longer supported",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SuppressUnsupportedOSWarning"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SyncDisabled": {
            "title": "Disable synchronization of data with Google",
            "description": "Disables data synchronization in Google Chrome using Google-hosted synchronization services and prevents users from changing this setting",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SyncDisabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SyncTypesListDisabled": {
            "title": "List of types that should be excluded from synchronization",
            "description": "If this policy is set all specified data types will be excluded from synchronization both for Google Sync as well as for roaming profile synchronization. This can be beneficial to reduce the size of the roaming profile or limit the type of data uploaded to the Google Sync Servers. The current data types for this policy are: bookmarks, preferences, passwords, autofill, themes, typedUrls, extensions, apps, tabs, wifiConfiguration",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SyncTypesListDisabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "TLS13HardeningForLocalAnchorsEnabled": {
            "title": "Enable a TLS 1.3 security feature for local trust anchors",
            "description": "This policy controls a security feature in TLS 1.3 which protects connections against downgrade attacks. It is backwards-compatible and will not affect connections to compliant TLS 1.2 servers or proxies. However, older versions of some TLS-intercepting proxies have an implementation flaw which causes them to be incompatible",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "TabFreezingEnabled": {
            "title": "Allow background tabs freeze",
            "description": "Controls whether Google Chrome can freeze tabs that have been in the background for at least 5 minutes",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "TaskManagerEndProcessEnabled": {
            "title": "Enable ending processes in Task Manager",
            "description": "If set to false, the 'End process' button is disabled in the Task Manager",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=TaskManagerEndProcessEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "TotalMemoryLimitMb": {
            "title": "Set limit on megabytes of memory a single Chrome instance can use",
            "description": "Configures the amount of memory that a single Google Chrome instance can use before tabs start being discarded (I.E. the memory used by the tab will be freed and the tab will have to be reloaded when switched to) to save memory",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=TotalMemoryLimitMb"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "TranslateEnabled": {
            "title": "Enable Translate",
            "description": "Enables the integrated Google Translate service on Google Chrome",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=TranslateEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "URLBlocklist": {
            "title": "Block access to a list of URLs",
            "description": "This policy prevents the user from loading web pages from blocked URLs. The blocklist provides a list of URL patterns that specify which URLs will be blocked. A URL pattern has to be formatted according to https://www.chromium.org/administrators/url-blacklist-filter-format",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=URLAllowlist"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "URLAllowlist": {
            "title": "Allow access to a list of URLs",
            "description": "Allows access to the listed URLs, as exceptions to the URL Deny List. See the description of the URL deny list policy for the format of entries of this list",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=URLAllowlist"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "UrlKeyedAnonymizedDataCollectionEnabled": {
            "title": "Enable URL-keyed anonymized data collection",
            "description": "Enable URL-keyed anonymized data collection in Google Chrome and prevents users from changing this setting",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=UrlKeyedAnonymizedDataCollectionEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "UserAgentClientHintsGREASEUpdateEnabled": {
            "title": "Control the User-Agent Client Hints GREASE Update feature",
            "description": "(UserAgentClientHintsEnabled)-When enabled the User-Agent Client Hints GREASE Update feature aligns the User-Agent GREASE algorithm with the latest spec",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#UserAgentClientHintsGREASEUpdateEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "UserAgentReduction": {
            "title": "Enable or disable the User-Agent Reduction",
            "description": "(UserAgentReduction)-The User-Agent HTTP request header is scheduled to be reduced. In order to facilitate testing and compatibility, this policy can enable the reduction feature for all websites, or disable the ability for origin trials or field trials to enable the feature",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#UserAgentReduction"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "User Agent reduction will be controllable via Field-Trials and Origin-Trials",
                            "User Agent reduction disabled, and not enabled by Field-Trials or Origin-Trials",
                            "User Agent reduction will be enabled for all origins"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2
                    ]
                }
            ]
        },
        "UserDataDir": {
            "title": "Set user data directory",
            "description": "Configures the directory that Google Chrome will use for storing user data. If you set this policy, Google Chrome will use the provided directory regardless whether the user has specified the '--user-data-dir' flag or not. To avoid data loss or other unexpected errors this policy should not be set to a volume's root directory or to a directory used for other purposes, because Google Chrome manages its contents. See https://www.chromium.org/administrators/policy-list-3/user-data-directory-variables for a list of variables that can be used",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=UserDataDir"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "UserDataSnapshotRetentionLimit": {
            "title": "Total number of user data shapshots permitted",
            "description": "(UserDataSnapshotRetentionLimit)-Following each major version update, Chrome will create a snapshot of certain portions of the user's browsing data for use in case of a later emergency version rollback. If an emergency rollback is performed to a version for which a user has a corresponding snapshot, the data in the snapshot is restored. This allows users to retain such settings as bookmarks and autofill data. If this policy is not set, the default value of 3 is used. If the policy is set, old snapshots are deleted as needed to respect the limit. If the policy is set to 0, no snapshots will be taken",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=UserDataSnapshotRetentionLimit"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "default": 3
                }
            ]
        },
        "UserFeedbackAllowed": {
            "title": "Allow user feedback",
            "description": "Allow user feedback. If the policy is set to false, users can not send feedback to Google",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=UserFeedbackAllowed"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "VideoCaptureAllowed": {
            "title": "Allow or deny video capture",
            "description": "If enabled or not configured (default), the user will be prompted for video capture access except for URLs configured in the VideoCaptureAllowedUrls list which will be granted access without prompting",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=VideoCaptureAllowed"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "VideoCaptureAllowedUrls": {
            "title": "URLs that will be granted access to video capture devices without prompt",
            "description": "Patterns in this list will be matched against the security origin of the requesting URL. If a match is found, access to video capture devices will be granted without prompt",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=VideoCaptureAllowedUrls"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "WPADQuickCheckEnabled": {
            "title": "Enable WPAD optimization",
            "description": "Allows to turn off WPAD (Web Proxy Auto-Discovery) optimization in Google Chrome",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=WPADQuickCheckEnabled"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "WebAppInstallForceList": {
            "type": "object",
            "title": "Configure list of force-installed Web Apps",
            "description": "Setting the policy specifies a list of web apps that install silently, without user interaction, and which users can't uninstall or turn off",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=WebAppInstallForceList"
                }
            ],
            "properties": {
                "url": {
                    "title": "URL",
                    "description": "URL",
                    "type": "string"
                },
                "create_desktop_shortcut": {
                    "title": "Create Desktop Shortcut",
                    "description": "Create Desktop Shortcut",
                    "type": "boolean"
                },
                "default_launch_container": {
                    "title": "Default launch container",
                    "description": "Default launch container",
                    "type": "string"
                }
            }
        },
        "WebComponentsV0Enabled": {
            "title": "Re-enable Web Components v0 API until M84",
            "description": "The Web Components v0 APIs (Shadow DOM v0, Custom Elements v0, and HTML Imports) were deprecated in 2018, and have been disabled by default starting in M80. This policy allows these features to be selectively re-enabled until M84",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "WebRtcAllowLegacyTLSProtocols": {
            "title": "Allow legacy TLS/DTLS downgrade in WebRTC",
            "description": "(WebRtcAllowLegacyTLSProtocols)-If enabled, WebRTC peer connections can downgrade to obsolete versions of the TLS/DTLS (DTLS 1.0, TLS 1.0 and TLS 1.1) protocols. When this policy is disabled or not set, these TLS/DTLS versions are disabled. This policy is temporary and will be removed in a future version of Google Chrome",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=WebRtcAllowLegacyTLSProtocols"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "WebRtcEventLogCollectionAllowed": {
            "title": "Allow collection of WebRTC event logs from Google services",
            "description": "Setting the policy to True allows Google Chrome to collect WebRTC event logs from Google services such as Hangouts Meet and upload them to Google. These logs have diagnostic information for debugging issues with audio or video meetings in Google Chrome, such as the time and size of RTP packets, feedback about congestion on the network, and metadata about time and quality of audio and video frames",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=WebRtcEventLogCollectionAllowed"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "WebRtcLocalIpsAllowedUrls": {
            "title": "URLs for which local IPs are exposed in WebRTC ICE candidates",
            "description": "Patterns in this list will be matched against the security origin of the requesting URL. If a match is found or chrome://flags/#enable-webrtc-hide-local-ips-with-mdns is Disabled, the local IP addresses are shown in WebRTC ICE candidates. Otherwise, local IP addresses are concealed with mDNS hostnames. Please note that this policy weakens the protection of local IPs if needed by administrators",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=WebRtcLocalIpsAllowedUrls"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "WebRtcIPHandling": {
            "title": "The IP handling policy of WebRTC",
            "description": "(WebRtcIPHandling)-This policy allows restricting which IP addresses and interfaces WebRTC uses when attempting to find the best available connection. See RFC 8828 section 5.2 (https://tools.ietf.org/html/rfc8828.html#section-5.2). When unset, defaults to using all available interfaces",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://chromeenterprise.google/policies/#WebRtcIPHandling"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "default"
                        }
                    }
                }
            ]
        },
        "WebRtcUdpPortRange": {
            "title": "Restrict the range of local UDP ports used by WebRTC",
            "description": "If the policy is set, the UDP port range used by WebRTC is restricted to the specified port interval (endpoints included)",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=WebRtcUdpPortRange"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        }
    }
}
