{
    "title": "Google Chrome Printing Preferences Manifest",
    "__preferencedomain": "com.google.Chrome",
    "properties": {
        "CloudPrintProxyEnabled": {
            "title": "Enable Google Cloud Print proxy",
            "description": "Enables Google Chrome to act as a proxy between Google Cloud Print and legacy printers connected to the machine",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "CloudPrintSubmitEnabled": {
            "title": "Enable submission of documents to Google Cloud Print",
            "description": "Enables Google Chrome to submit documents to Google Cloud Print for printing. NOTE: This only affects Google Cloud Print support in Google Chrome. It does not prevent users from submitting print jobs on web sites",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "CloudPrintWarningsSuppressed": {
            "title": "Suppress Google Cloud Print deprecation messages",
            "description": "This policy controls whether Google Cloud Print deprecation warnings are shown to users in the print preview dialog or settings pages",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DefaultPrinterSelection": {
            "title": "Default printer selection rules",
            "description": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=DefaultPrinterSelection",
            "options": {
                "inputAttributes": {
                    "placeholder": "kind: cloud"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "DisablePrintPreview": {
            "title": "Disable Print Preview",
            "description": "Show the system print dialog instead of print preview",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PrintHeaderFooter": {
            "title": "Print Headers and Footers",
            "description": "Force 'headers and footers' to be on or off in the printing dialog",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PrintPreviewUseSystemDefaultPrinter": {
            "title": "Use System Default Printer as Default",
            "description": "Causes Google Chrome to use the system default printer as the default choice in Print Preview instead of the most recently used printer",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PrinterTypeDenyList": {
            "title": "Disable printer types on the deny list",
            "description": "privet = Zeroconf-based (mDNS + DNS-SD) protocol destinations. extension = Extension-based destinations. pdf = The 'Save as PDF' destination. local = Local printer destinations. cloud = Google Cloud Print and 'Save to Google Drive' destinations",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "PrintingAllowedBackgroundGraphicsModes": {
            "title": "Restrict background graphics printing mode",
            "description": "Restricts background graphics printing mode. Unset policy is treated as no restriction. any = Allow printing both with and without background graphcis. enabled = Allow printing only with background graphics. disabled = Allow printing only without background graphics",
            "options": {
                "inputAttributes": {
                    "placeholder": "any"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "PrintingBackgroundGraphicsDefault": {
            "title": "Default background graphics printing mode",
            "description": "Overrides default background graphics printing mode. enabled = Enable background graphics printing mode by default. disabled = Disable background graphics printing mode by default",
            "options": {
                "inputAttributes": {
                    "placeholder": "enabled"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "PrintingEnabled": {
            "title": "Enable printing",
            "description": "Enables printing in Google Chrome and prevents users from changing this setting",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        }
    }
}
