{
    "title": "com.google.chrome.misc",
    "description": "Google Chrome Miscellaneous Preferences",
    "__preferencedomain": "com.google.Chrome",
    "properties": {
        "AbusiveExperienceInterventionEnforce": {
            "title": "Abusive Experience Intervention Enforce",
            "description": "Allows you to set whether sites with abusive experiences should be prevented from opening new windows or tabs",
            "property_order": 1,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AdsSettingForIntrusiveAdsSites": {
            "title": "Ads setting for sites with intrusive ads",
            "description": "Allows you to set whether ads should be blocked on sites with intrusive ads. 1 = Allow ads on all sites 2 = Do not allow ads on sites with intrusive ads",
            "property_order": 2,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        1,
                        2
                    ],
                    "enum_titles": [
                        1,
                        2
                    ],
                    "default": 1
                }
            ]
        },
        "AllowDeletingBrowserHistory": {
            "title": "Enable deleting browser and download history",
            "description": "Enables deleting browser history and download history in Google Chrome and prevents users from changing this setting",
            "property_order": 3,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AllowDinosaurEasterEgg": {
            "title": "Allow Dinosaur Easter Egg Game",
            "description": "Allow users to play dinosaur easter egg game when device is offline",
            "property_order": 4,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AllowFileSelectionDialogs": {
            "title": "Allow invocation of file selection dialogs",
            "description": "Allows access to local files on the machine by allowing Google Chrome to display file selection dialogs. If you enable this setting, users can open file selection dialogs as normal",
            "property_order": 5,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AllowOutdatedPlugins": {
            "title": "Allow running plugins that are outdated",
            "description": "If you enable this setting, outdated plugins are used as normal plugins. If you disable this setting, outdated plugins will not be used and users will not be asked for permission to run them",
            "property_order": 6,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AllowPopupsDuringPageUnload": {
            "title": "Allows a page to show popups during its unloading",
            "description": "This policy allows an admin to specify that a page may show popups during its unloading. When the policy is set to enabled, pages are allowed to show popups while they are being unloaded",
            "property_order": 7,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AllowSyncXHRInPageDismissal": {
            "title": "Allows a page to perform synchronous XHR requests during page dismissal",
            "description": "This policy allows an admin to specify that a page may send synchronous XHR requests during page dismissal. When the policy is set to enabled, pages are allowed to send synchronous XHR requests during page dismissal",
            "property_order": 8,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AllowedDomainsForApps": {
            "title": "Define domains allowed to access G Suite",
            "description": "Enables Google Chrome's restricted log in feature in G Suite and prevents users from changing this setting. If you define this setting, the user will only be able to access Google Apps using accounts from the comma separated specified domains (note that to allow gmail.com/googlemail.com accounts, you should add consumer_accounts to the list of domains)",
            "property_order": 9,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "AlternateErrorPagesEnabled": {
            "title": "Enable alternate error pages",
            "description": "Enables the use of alternate error pages that are built into Google Chrome (such as 'page not found') and prevents users from changing this setting",
            "property_order": 10,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AlwaysOpenPdfExternally": {
            "title": "Always Open PDF files externally",
            "description": "Disables the internal PDF viewer in Google Chrome. Instead it treats it as download and allows the user to open PDF files with the default application",
            "property_order": 5,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AmbientAuthenticationInPrivateModesEnabled": {
            "title": "Enable Ambient Authentication for profile types",
            "description": "Configuring this policy will allow/disallow ambient authentication for Incognito and Guest profiles in Google Chrome. 0 = Enable ambient authentication in regular sessions only. 1 = Enable ambient authentication in incognito and regular sessions. 2 = Enable ambient authentication in guest and regular sessions. 3 = Enable ambient authentication in regular, incognito and guest sessions",
            "property_order": 12,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2,
                        3
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2,
                        3
                    ],
                    "default": 1
                }
            ]
        },
        "AudioCaptureAllowed": {
            "title": "Allow or deny audio capture",
            "description": "If enabled or not configured (default), the user will be prompted for audio capture access except for URLs configured in the AudioCaptureAllowedUrls list which will be granted access without prompting",
            "property_order": 13,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AudioCaptureAllowedUrls": {
            "title": "URLs that will be granted access to audio capture devices without prompt",
            "description": "Patterns in this list will be matched against the security origin of the requesting URL. If a match is found, access to audio capture devices will be granted without prompt",
            "property_order": 14,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "AudioSandboxEnabled": {
            "title": "Allow the audio sandbox to run",
            "description": "This policy controls the audio process sandbox. If this policy is enabled, the audio process will run sandboxed. If this policy is disabled, the audio process will run unsandboxed and the WebRTC audio-processing module will run in the renderer process. This leaves users open to security risks related to running the audio subsystem unsandboxed. If this policy is not set, the default configuration for the audio sandbox will be used, which may differ per platform. This policy is intended to give enterprises flexibility to disable the audio sandbox if they use security software setups that interfere with the sandbox",
            "property_order": 15,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AutofillAddressEnabled": {
            "title": "Enable AutoFill for addresses",
            "description": "Enables Google Chrome's AutoFill feature and allows users to auto complete address information in web forms using previously stored information",
            "property_order": 16,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AutofillCreditCardEnabled": {
            "title": "Enable AutoFill for credit cards",
            "description": "Enables Google Chrome's AutoFill feature and allows users to auto complete credit card information in web forms using previously stored information",
            "property_order": 17,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AutoplayAllowed": {
            "title": "Allow media autoplay",
            "description": "Allows you to control if videos can play automatically (without user consent) with audio content in Google Chrome",
            "property_order": 18,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AutoplayWhitelist": {
            "title": "Allow media autoplay on a whitelist of URL patterns",
            "description": "Controls the whitelist of URL patterns that autoplay will always be enabled on. If autoplay is enabled then videos can play automatically (without user consent) with audio content in Google Chrome. A valid URL patterns specifications are: - [*.]domain.tld (matches domain.tld and all sub-domains) - host (matches an exact hostname) - scheme://host:port (supported schemes: http,https) - scheme://[*.]domain.tld:port (supported schemes: http,https) - file://path (The path has to be an absolute path and start with a '/') - a.b.c.d (matches an exact IPv4 ip) - [a:b:c:d:e:f:g:h] (matches an exact IPv6 ip)",
            "property_order": 19,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "BlockThirdPartyCookies": {
            "title": "Block third party cookies",
            "description": "Enabling this setting prevents cookies from being set by web page elements that are not from the domain that is in the browser's address bar",
            "property_order": 20,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BookmarkBarEnabled": {
            "title": "Enable Bookmark Bar",
            "description": "If you enable this setting, Google Chrome will show a bookmark bar.",
            "property_order": 21,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BrowserAddPersonEnabled": {
            "title": "Enable add person in user manager",
            "description": "If this policy is set to true or not configured, Google Chrome will allow Add Person from the user manager",
            "property_order": 22,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BrowserGuestModeEnabled": {
            "title": "Enable guest mode in browser",
            "description": "If this policy is set to true or not configured, Google Chrome will enable guest logins. Guest logins are Google Chrome profiles where all windows are in incognito mode",
            "property_order": 23,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BrowserGuestModeEnforced": {
            "title": "Enforce browser guest mode",
            "description": "If this policy is set to enabled, Google Chrome will enforce guest sessions and prevents profile logins. Guest logins are Google Chrome profiles where all windows are in incognito mode",
            "property_order": 24,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BrowserNetworkTimeQueriesEnabled": {
            "title": "Allow queries to a Google time service",
            "description": "Setting this policy to false stops Google Chrome from occasionally sending queries to a Google server to retrieve an accurate timestamp. These queries will be enabled if this policy is set to True or is not set",
            "property_order": 25,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "BrowserSignin": {
            "title": "Browser sign in settings",
            "description": "This policy controls the sign-in behavior of the browser. It allows you to specify if the user can sign in to Google Chrome with their account and use account related services like Chrome sync. 0 = Disable browser sign-in 1 = Enable browser sign-in 2 = Force users to sign-in to use the browser",
            "property_order": 26,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2
                    ],
                    "default": 0
                }
            ]
        },
        "BuiltInDnsClientEnabled": {
            "title": "Use built-in DNS client",
            "description": "Controls whether the built-in DNS client is used in Google Chrome. This does not affect which DNS servers are used; just the software stack which is used to communicate with them. For example if the operating system is configured to use an enterprise DNS server, that same server would be used by the built-in DNS client. It is however possible that the built-in DNS client will address servers in different ways by using more modern DNS-related protocols such as DNS-over-TLS",
            "property_order": 27,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "CertificateTransparencyEnforcementDisabledForCas": {
            "title": "Disable Certificate Transparency enforcement for a list of subjectPublicKeyInfo hashes",
            "description": "Disables enforcing Certificate Transparency requirements for a list of subjectPublicKeyInfo hashes. https://cloud.google.com/docs/chrome-enterprise/policies/?policy=CertificateTransparencyEnforcementDisabledForCas",
            "property_order": 28,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "CertificateTransparencyEnforcementDisabledForLegacyCas": {
            "title": "Disable Certificate Transparency enforcement for a list of Legacy Certificate Authorities",
            "description": "Disables enforcing Certificate Transparency requirements for a list of Legacy Certificate Authorities. https://cloud.google.com/docs/chrome-enterprise/policies/?policy=CertificateTransparencyEnforcementDisabledForLegacyCas",
            "property_order": 29,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "CertificateTransparencyEnforcementDisabledForUrls": {
            "title": "Disable Certificate Transparency enforcement for a list of URLs",
            "description": "Disables enforcing Certificate Transparency requirements to the listed URLs. A URL pattern is formatted according to https://www.chromium.org/administrators/url-blacklist-filter-format. However, because certificates are valid for a given hostname independent of the scheme, port, or path, only the hostname portion of the URL is considered. Wildcard hosts are not supported",
            "property_order": 30,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "ChromeVariations": {
            "title": "Availability of Chrome Update Variations",
            "description": "Configuring this policy allows to specify which variations are allowed to be applied in Google Chrome. Variations provide a mean for offering modifications to Google Chrome without shipping a new version of the browser by selectively enabling or disabling already existing features. Setting the VariationsEnabled (value 0), or leaving the policy not set allows all variations to be applied to the browser. Setting the CriticalFixesOnly (value 1), allows only variations considered critical security or stability fixes to be applied to Google Chrome. Setting the VariationsDisabled (value 2), prevent all variations from being applied to the browser. Please note that this mode can potentially prevent the Google Chrome developers from providing criticial security fixes in a timely manner and is thus not recommended",
            "property_order": 30,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "pattern": "[0-2]",
                    "enum": [
                        0,
                        1,
                        2
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2
                    ],
                    "default": 0
                }
            ]
        },
        "ClickToCallEnabled": {
            "title": "Enable the Click to Call Feature",
            "description": "Enable the Click to Call feature which allows users to send phone numbers from Chrome Desktops to an Android device when the user is Signed-in. For more information, see help center article: https://support.google.com/chrome/answer/9430554?hl=en",
            "property_order": 31,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "CommandLineFlagSecurityWarningsEnabled": {
            "title": "Enable security warnings for command-line flags",
            "description": "If disabled, prevents security warnings from appearing when Chrome is launched with some potentially dangerous command-line flags",
            "property_order": 35,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ComponentUpdatesEnabled": {
            "title": "Enable component updates in Google Chrome",
            "description": "Enables component updates for all components in Google Chrome when not set or set to True",
            "property_order": 10,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DNSInterceptionChecksEnabled": {
            "title": "DNS interception checks enabled",
            "description": "This policy configures a local switch that can be used to disable DNS interception checks. The checks attempt to discover whether the browser is behind a proxy that redirects unknown host names",
            "property_order": 37,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DefaultBrowserSettingEnabled": {
            "title": "Set Google Chrome as Default Browser",
            "description": "Configures the default browser checks in Google Chrome and prevents users from changing them. If you enable this setting, Google Chrome will always check on startup whether it is the default browser and automatically register itself if possible",
            "property_order": 38,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DefaultDownloadDirectory": {
            "title": "Set default download directory",
            "description": "Configures the default directory that Google Chrome will use for downloading files. See https://www.chromium.org/administrators/policy-list-3/user-data-directory-variables for a list of variables that can be used",
            "property_order": 39,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "DeveloperToolsAvailability": {
            "title": "Control where Developer Tools can be used",
            "description": "Allows you to control where Developer Tools can be used 0 = Disallow usage of the Developer Tools on extensions installed by enterprise policy, allow usage of the Developer Tools in other contexts 1 = Allow usage of the Developer Tools 2 = Disallow usage of the Developer Tools",
            "property_order": 40,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2
                    ],
                    "default": 1
                }
            ]
        },
        "Disable3DAPIs": {
            "title": "Disable support for 3D graphics APIs",
            "description": "Enabling this setting prevents web pages from accessing the graphics processing unit (GPU). Specifically, web pages can not access the WebGL API and plugins can not use the Pepper 3D API",
            "property_order": 41,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableSafeBrowsingProceedAnyway": {
            "title": "Disable proceeding from the Safe Browsing warning page",
            "description": "The Safe Browsing service shows a warning page when users navigate to sites that are flagged as potentially malicious. Enabling this setting prevents users from proceeding anyway from the warning page to the malicious site",
            "property_order": 42,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableScreenshots": {
            "title": "Disable taking screenshots",
            "description": "If enabled, screenshots cannot be taken using keyboard shortcuts or extension APIs",
            "property_order": 43,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DiskCacheDir": {
            "title": "Set disk cache directory",
            "description": "Configures the directory that Google Chrome will use for storing cached files on the disk. See  https://www.chromium.org/administrators/policy-list-3/user-data-directory-variables for a list of variables that can be used",
            "property_order": 44,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "DiskCacheSize": {
            "title": "Set disk cache size in bytes",
            "description": "Configures the cache size that Google Chrome will use for storing cached files on the disk",
            "property_order": 45,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "DnsOverHttpsMode": {
            "title": "Controls the mode of DNS-over-HTTPS",
            "description": "Controls the mode of the DNS-over-HTTPS resolver. Please note that this policy will only set the default mode for each query. The mode may be overridden for special types of queries such as requests to resolve a DNS-over-HTTPS server hostname. off = Disable DNS-over-HTTPS automatic = Enable DNS-over-HTTPS with insecure fallback secure = Enable DNS-over-HTTPS without insecure fallback",
            "property_order": 46,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "DnsOverHttpsTemplates": {
            "title": "Specify URI template of desired DNS-over-HTTPS resolver",
            "description": "The URI template of the desired DNS-over-HTTPS resolver. To specify multiple DNS-over-HTTPS resolvers, separate the corresponding URI templates with spaces",
            "property_order": 47,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "DownloadDirectory": {
            "title": "Set download directory",
            "description": "Configures the directory that Google Chrome will use for downloading files",
            "property_order": 39,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "DownloadRestrictions": {
            "title": "Download Restrictions",
            "description": "Configures the type of downloads that Google Chrome will completely block, without letting users override the security decision. 0 = No special restrictions 1 = Block dangerous downloads 2 = Block potentially dangerous downloads 3 = Block all downloads 4 = Block malicious downloads",
            "property_order": 10,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2,
                        3,
                        4
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2,
                        3,
                        4
                    ],
                    "default": 0
                }
            ]
        },
        "EditBookmarksEnabled": {
            "title": "Enable or disable bookmark editing",
            "description": "If you enable this setting, bookmarks can be added, removed or modified. This is the default also when this policy is not set",
            "property_order": 41,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableDeprecatedWebPlatformFeatures": {
            "title": "Enable deprecated web platform features for a limited time",
            "description": "Specify a list of deprecated web platform features to re-enable temporarily. The general format of the string tag will be [DeprecatedFeatureName]_EffectiveUntil[yyyymmdd]. As reference, you can find the intent behind the Web Platform feature changes at https://bit.ly/blinkintents",
            "property_order": 42,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "EnableOnlineRevocationChecks": {
            "title": "Enable online OCSP/CRL checks",
            "description": "In light of the fact that soft-fail, online revocation checks provide no effective security benefit, they are disabled by default in Google Chrome version 19 and later. By setting this policy to true, the previous behavior is restored and online OCSP/CRL checks will be performed",
            "property_order": 43,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnterpriseHardwarePlatformAPIEnabled": {
            "title": "Enables managed extensions to use the Enterprise Hardware Platform API",
            "description": "When this policy is set to enabled, extensions installed by enterprise policy are allowed to use the Enterprise Hardware Platform API",
            "property_order": 44,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ExternalProtocolDialogShowAlwaysOpenCheckbox": {
            "title": "Show an Always open checkbox in external protocol dialog",
            "description": "This policy controls whether or not the Always open checkbox is shown on external protocol launch confirmation prompts. If this policy is set to True, when an external protocol confirmation is shown, the user may choose to Always open the protocol without future confirmation prompts",
            "property_order": 45,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ForceEphemeralProfiles": {
            "title": "Ephemeral profile",
            "description": "If set to enabled this policy forces the profile to be switched to ephemeral mode. If this policy is specified as an OS policy (e.g. GPO on Windows) it will apply to every profile on the system; if the policy is set as a Cloud policy it will apply only to a profile signed in with a managed account",
            "property_order": 46,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ForceGoogleSafeSearch": {
            "title": "Force Google SafeSearch",
            "description": "Forces queries in Google Web Search to be done with SafeSearch set to active and prevents users from changing this setting",
            "property_order": 47,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ForceYouTubeRestrict": {
            "title": "Force minimum YouTube Restricted Mode",
            "description": "Enforces a minimum Restricted Mode on YouTube and prevents users from picking a less restricted mode. If this setting is set to Strict, Strict Restricted Mode on YouTube is always active. If this setting is set to Moderate, the user may only pick Moderate Restricted Mode and Strict Restricted Mode on YouTube, but cannot disable Restricted Mode. If this setting is set to Off or no value is set, Restricted Mode on YouTube is not enforced by Google Chrome. External policies such as YouTube policies might still enforce Restricted Mode, though. 0 = Do not enforce Restricted Mode on YouTube 1 = Enforce at least Moderate Restricted Mode on YouTube 2 = Enforce Strict Restricted Mode for YouTube",
            "property_order": 48,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2
                    ],
                    "default": 1
                }
            ]
        },
        "GloballyScopeHTTPAuthCacheEnabled": {
            "title": "Enable globally scoped HTTP auth cache",
            "description": "This policy configures a single global per profile cache with HTTP server authentication credentials. If this policy is unset or disabled, the browser will use the default behavior of cross-site auth, which as of version 80, will be to scope HTTP server authentication credentials by top-level site, so if two sites use resources from the same authenticating domain, credentials will need to be provided independently in the context of both sites. Cached proxy credentials will be reused across sites. If the policy is enabled, HTTP auth credentials entered in the context of one site will automatically be used in the context of another. Enabling this policy leaves sites open to some types of cross-site attacks, and allows users to be tracked across sites even without cookies by adding entries to the HTTP auth cache using credentials embedded in URLs. This policy is intended to give enterprises depending on the legacy behavior a chance to update their login procedures, and will be removed in the future",
            "property_order": 49,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "HSTSPolicyBypassList": {
            "title": "List of names that will bypass the HSTS policy check",
            "description": "Hostnames specified in this list will be exempt from the HSTS policy check that could potentially upgrade requests from http to https. Only single-label hostnames are allowed in this policy",
            "property_order": 50,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "HardwareAccelerationModeEnabled": {
            "title": "Use hardware acceleration when available",
            "description": "If this policy is set to true or left unset, hardware acceleration will be enabled unless a certain GPU feature is blacklisted",
            "property_order": 51,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "HideWebStoreIcon": {
            "title": "Hide the web store from the New Tab Page and app launcher",
            "description": "Hide the Chrome Web Store app and footer link from the New Tab Page and Google Chrome OS app launcher",
            "property_order": 52,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ImportAutofillFormData": {
            "title": "Import autofill form data from default browser on first run",
            "description": "This policy forces the autofill form data to be imported from the previous default browser if enabled. If enabled, this policy also affects the import dialog",
            "property_order": 53,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ImportBookmarks": {
            "title": "Import bookmarks from default browser on first run",
            "description": "This policy forces bookmarks to be imported from the current default browser if enabled. If enabled, this policy also affects the import dialog",
            "property_order": 54,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ImportHistory": {
            "title": "Import browsing history from default browser on first run",
            "description": "This policy forces the browsing history to be imported from the current default browser if enabled. If enabled, this policy also affects the import dialog",
            "property_order": 55,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ImportHomepage": {
            "title": "Import of homepage from default browser on first run",
            "description": "This policy forces the home page to be imported from the current default browser if enabled",
            "property_order": 56,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ImportSavedPasswords": {
            "title": "Import saved passwords from default browser on first run",
            "description": "This policy forces the saved passwords to be imported from the previous default browser if enabled. If enabled, this policy also affects the import dialog",
            "property_order": 57,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ImportSearchEngine": {
            "title": "Import search engines from default browser on first run",
            "description": "This policy forces search engines to be imported from the current default browser if enabled. If enabled, this policy also affects the import dialog",
            "property_order": 58,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "IncognitoModeAvailability": {
            "title": "Incognito mode availability",
            "description": "Specifies whether the user may open pages in Incognito mode in Google Chrome. 0 = Incognito mode available 1 = Incognito mode disabled 2 = Incognito mode forced",
            "property_order": 59,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2
                    ],
                    "default": 1
                }
            ]
        },
        "IsolateOrigins": {
            "title": "Enable Site Isolation for specified origins",
            "description": "If the policy is enabled, each of the named origins in a comma-separated list will run in its own process. This will also isolate origins named by subdomains; e.g. specifying https://example.com/ will also cause https://foo.example.com/ to be isolated as part of the https://example.com/ site. If the policy is not configured or disabled, the user will be able to change this setting",
            "property_order": 60,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "MaxConnectionsPerProxy": {
            "title": "Maximal number of concurrent connections to the proxy server",
            "description": "Specifies the maximal number of simultaneous connections to the proxy server. Some proxy servers can not handle high number of concurrent connections per client and this can be solved by setting this policy to a lower value. The value of this policy should be lower than 100 and higher than 6 and the default value is 32",
            "property_order": 61,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "default": 32
                }
            ]
        },
        "MaxInvalidationFetchDelay": {
            "title": "Maximum fetch delay after a policy invalidation",
            "description": "Specifies the maximum delay in milliseconds between receiving a policy invalidation and fetching the new policy from the device management service. Setting this policy overrides the default value of 10000 milliseconds. Valid values for this policy are in the range from 1000 (1 second) to 300000 (5 minutes). Any values not in this range will be clamped to the respective boundary",
            "property_order": 62,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "MediaRouterCastAllowAllIPs": {
            "title": "Allow Google Cast to connect to Cast devices on all IP addresses",
            "description": "If this policy is set to true, Google Cast will connect to Cast devices on all IP addresses, not just RFC1918/RFC4193 private addresses. If this policy is set to false, Google Cast will connect to Cast devices on RFC1918/RFC4193 private addresses only",
            "property_order": 63,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "MetricsReportingEnabled": {
            "title": "Enable reporting of usage and crash-related data",
            "description": "Enables anonymous reporting of usage and crash-related data about Google Chrome to Google and prevents users from changing this setting",
            "property_order": 64,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "NTPCustomBackgroundEnabled": {
            "title": "Allow users to customize the background on the New Tab page",
            "description": "If the policy is set to false, the New Tab page won't allow users to customize the background. Any existing custom background will be permanently removed even if the policy is set to true later",
            "property_order": 65,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "NetworkPredictionOptions": {
            "title": "Enable network prediction",
            "description": "Enables network prediction in Google Chrome and prevents users from changing this setting. 0 = Predict network actions on any network connection 1 = Predict network actions on any network that is not cellular. (Deprecated in 50, removed in 52. After 52, if value 1 is set, it will be treated as 0 - predict network actions on any network connection.) 2 = Do not predict network actions on any network connection",
            "property_order": 66,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1,
                        2
                    ],
                    "enum_titles": [
                        0,
                        1,
                        2
                    ],
                    "default": 0
                }
            ]
        },
        "OverrideSecurityRestrictionsOnInsecureOrigin": {
            "title": "Origins or hostname patterns for which restrictions on insecure origins should not apply",
            "description": "The policy specifies a list of origins (URLs) or hostname patterns (such as *.example.com) for which security restrictions on insecure origins will not apply",
            "property_order": 67,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "PaymentMethodQueryEnabled": {
            "title": "Allow websites to query for available payment methods",
            "description": "Allows you to set whether websites are allowed to check if the user has payment methods saved",
            "property_order": 68,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PolicyAtomicGroupsEnabled": {
            "title": "Enables the concept of policy atomic groups",
            "description": "f this policy is enabled, policies coming from the an atomic group that do not share the source with the highest priority from that group will be ignored",
            "property_order": 69,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PolicyDictionaryMultipleSourceMergeList": {
            "title": "Allow merging dictionary policies from different sources. ",
            "description": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PolicyDictionaryMultipleSourceMergeList",
            "property_order": 70,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "PolicyListMultipleSourceMergeList": {
            "title": "Allow merging list policies from different sources",
            "description": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=PolicyListMultipleSourceMergeList",
            "property_order": 71,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "PolicyRefreshRate": {
            "title": "Refresh rate for user policy",
            "description": "Specifies the period in milliseconds at which the device management service is queried for user policy information. Setting this policy overrides the default value of 3 hours. Valid values for this policy are in the range from 1800000 (30 minutes) to 86400000 (1 day)",
            "property_order": 72,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "PromotionalTabsEnabled": {
            "title": "Enable showing full-tab promotional content",
            "description": "Allows you to control the presentation of full-tab promotional and/or educational content in Google Chrome",
            "property_order": 73,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PromptForDownloadLocation": {
            "title": "Ask where to save each file before downloading",
            "description": "If the policy is enabled, the user will be asked where to save each file before downloading",
            "property_order": 74,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ProxySettings": {
            "type": "object",
            "title": "Proxy settings",
            "properties": {
                "ProxyMode": {
                    "title": "Proxy Mode",
                    "description": "Sets the proxy mode",
                    "type": "string"
                },
                "ProxyPacUrl": {
                    "title": "Proxy PAC Url",
                    "description": "Sets the proxy PAC URL",
                    "type": "string"
                },
                "ProxyServer": {
                    "title": "Proxy Server",
                    "description": "Sets the proxy server",
                    "type": "string"
                },
                "ProxyServerMode": {
                    "title": "Proxy server mode",
                    "description": "Sets the proxy server mode",
                    "type": "integer"
                },
                "ProxyBypassList": {
                    "title": "Proxy bypass list",
                    "description": "Sets the proxy bypass list",
                    "type": "string"
                }
            }
        },
        "RelaunchNotification": {
            "title": "Notify a user that a browser relaunch or device restart is recommended or required",
            "description": "Notify users that Google Chrome must be relaunched or Google Chrome OS must be restarted to apply a pending update. 1 = Show a recurring prompt to the user indicating that a relaunch is recommended 2 = Show a recurring prompt to the user indicating that a relaunch is required",
            "property_order": 10,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        1,
                        2
                    ],
                    "enum_titles": [
                        1,
                        2
                    ],
                    "default": 1
                }
            ]
        },
        "QuicAllowed": {
            "title": "Allow QUIC protocol",
            "description": "If this policy is set to true or not set usage of QUIC protocol in Google Chrome is allowed",
            "property_order": 75,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "RelaunchNotificationPeriod": {
            "title": "Set the time period for update notifications",
            "description": "Allows you to set the time period, in milliseconds, over which users are notified that Google Chrome must be relaunched or that a Google Chrome OS device must be restarted to apply a pending update",
            "property_order": 76,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "RestrictSigninToPattern": {
            "title": "Restrict which Google accounts are allowed to be set as browser primary accounts in Google Chrome",
            "description": "Contains a regular expression which is used to determine which Google accounts can be set as browser primary accounts in Google Chrome (i.e. the account that is chosen during the Sync opt-in flow)",
            "property_order": 77,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "RunAllFlashInAllowMode": {
            "title": "Extend Flash content setting to all content",
            "description": "If you enable this setting, all Flash content embedded on websites that have been set to allow Flash in content settings -- either by the user or by enterprise policy -- will be run, including content from other origins or small content",
            "property_order": 78,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SSLErrorOverrideAllowed": {
            "title": "Allow proceeding from the SSL warning page",
            "description": "Chrome shows a warning page when users navigate to sites that have SSL errors. By default or when this policy is set to true, users are allowed to click through these warning pages",
            "property_order": 79,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SSLVersionMin": {
            "title": "Minimum SSL version enabled",
            "description": "If this policy is not configured then Google Chrome uses a default minimum version which is TLS 1.0. Otherwise it may be set to one of the following values: tls1, tls1.1 or tls1.2",
            "property_order": 80,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "SafeSitesFilterBehavior": {
            "title": "Control SafeSites adult content filtering",
            "description": "his policy controls the application of the SafeSites URL filter. This filter uses the Google Safe Search API to classify URLs as pornographic or not. 0 = Do not filter sites for adult content 1 = Filter top level sites (but not embedded iframes) for adult content",
            "property_order": 81,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "enum": [
                        0,
                        1
                    ],
                    "enum_titles": [
                        0,
                        1
                    ],
                    "default": 0
                }
            ]
        },
        "SavingBrowserHistoryDisabled": {
            "title": "Disable saving browser history",
            "description": "Disables saving browser history in Google Chrome and prevents users from changing this setting",
            "property_order": 82,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SearchSuggestEnabled": {
            "title": "Enable search suggestions",
            "description": "Enables search suggestions in Google Chrome's omnibox and prevents users from changing this setting",
            "property_order": 83,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SecurityKeyPermitAttestation": {
            "title": "URLs/domains automatically permitted direct Security Key attestation",
            "description": "https://cloud.google.com/docs/chrome-enterprise/policies/?policy=SecurityKeyPermitAttestation",
            "property_order": 84,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "SharedClipboardEnabled": {
            "title": "Enable the Shared Clipboard Feature",
            "description": "Enable the Shared Clipboard feature which allows users to send text between Chrome Desktops and an Android device when Sync is enabled and the user is Signed-in",
            "property_order": 85,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ShowAppsShortcutInBookmarkBar": {
            "title": "Show the apps shortcut in the bookmark bar",
            "description": "Enables or disables the apps shortcut in the bookmark bar",
            "property_order": 86,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SignedHTTPExchangeEnabled": {
            "title": "Enable Signed HTTP Exchange (SXG) support",
            "description": "Enable support for Signed HTTP Exchange (SXG)",
            "property_order": 87,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SitePerProcess": {
            "title": "Enable Site Isolation for every site",
            "description": "This setting, SitePerProcess, may be used to disallow users from opting out of the default behavior of isolating all sites. Note that the IsolateOrigins policy may also be useful for isolating additional, finer-grained origins",
            "property_order": 88,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SpellCheckServiceEnabled": {
            "title": "Enable or disable spell checking web service",
            "description": "Google Chrome can use a Google web service to help resolve spelling errors. If this setting is enabled, then this service is always used. If this setting is disabled, then this service is never used",
            "property_order": 89,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SpellcheckEnabled": {
            "title": "Enable spellcheck",
            "description": "If this policy is not set, the user can enable or disable spellcheck in the language settings",
            "property_order": 90,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "StricterMixedContentTreatmentEnabled": {
            "title": "Enable stricter treatment for mixed content",
            "description": "This policy controls the treatment for mixed content (HTTP content in HTTPS sites) in the browser. If the policy is set to true or unset, audio and video mixed content will be autoupgraded to HTTPS (i.e. the URL will be rewritten as HTTPS, without a fallback if the resource is not available over HTTPS) and a 'Not Secure' warning will be shown in the URL bar for image mixed content",
            "property_order": 91,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SuppressUnsupportedOSWarning": {
            "title": "Suppress the unsupported OS warning",
            "description": "Suppresses the warning that appears when Google Chrome is running on a computer or operating system that is no longer supported",
            "property_order": 92,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SyncDisabled": {
            "title": "Disable synchronization of data with Google",
            "description": "Disables data synchronization in Google Chrome using Google-hosted synchronization services and prevents users from changing this setting",
            "property_order": 93,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SyncTypesListDisabled": {
            "title": "List of types that should be excluded from synchronization",
            "description": "If this policy is set all specified data types will be excluded from synchronization both for Google Sync as well as for roaming profile synchronization. This can be beneficial to reduce the size of the roaming profile or limit the type of data uploaded to the Google Sync Servers. The current data types for this policy are: bookmarks, preferences, passwords, autofill, themes, typedUrls, extensions, apps, tabs, wifiConfiguration",
            "property_order": 94,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "TLS13HardeningForLocalAnchorsEnabled": {
            "title": "Enable a TLS 1.3 security feature for local trust anchors",
            "description": "This policy controls a security feature in TLS 1.3 which protects connections against downgrade attacks. It is backwards-compatible and will not affect connections to compliant TLS 1.2 servers or proxies. However, older versions of some TLS-intercepting proxies have an implementation flaw which causes them to be incompatible",
            "property_order": 95,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "TabFreezingEnabled": {
            "title": "Allow background tabs freeze",
            "description": "Controls whether Google Chrome can freeze tabs that have been in the background for at least 5 minutes",
            "property_order": 96,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "TaskManagerEndProcessEnabled": {
            "title": "Enable ending processes in Task Manager",
            "description": "If set to false, the 'End process' button is disabled in the Task Manager",
            "property_order": 97,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "TotalMemoryLimitMb": {
            "title": "Set limit on megabytes of memory a single Chrome instance can use",
            "description": "Configures the amount of memory that a single Google Chrome instance can use before tabs start being discarded (I.E. the memory used by the tab will be freed and the tab will have to be reloaded when switched to) to save memory",
            "property_order": 98,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "TranslateEnabled": {
            "title": "Enable Translate",
            "description": "Enables the integrated Google Translate service on Google Chrome",
            "property_order": 99,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "URLBlacklist": {
            "title": "Block access to a list of URLs",
            "description": "This policy prevents the user from loading web pages from blacklisted URLs. The blacklist provides a list of URL patterns that specify which URLs will be blacklisted. A URL pattern has to be formatted according to https://www.chromium.org/administrators/url-blacklist-filter-format",
            "property_order": 100,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "URLWhitelist": {
            "title": "Allow access to a list of URLs",
            "description": "Allows access to the listed URLs, as exceptions to the URL blacklist. See the description of the URL blacklist policy for the format of entries of this list",
            "property_order": 101,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "UrlKeyedAnonymizedDataCollectionEnabled": {
            "title": "Enable URL-keyed anonymized data collection",
            "description": "Enable URL-keyed anonymized data collection in Google Chrome and prevents users from changing this setting",
            "property_order": 102,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "UserDataDir": {
            "title": "Set user data directory",
            "description": "Configures the directory that Google Chrome will use for storing user data. If you set this policy, Google Chrome will use the provided directory regardless whether the user has specified the '--user-data-dir' flag or not. To avoid data loss or other unexpected errors this policy should not be set to a volume's root directory or to a directory used for other purposes, because Google Chrome manages its contents. See https://www.chromium.org/administrators/policy-list-3/user-data-directory-variables for a list of variables that can be used",
            "property_order": 103,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "UserFeedbackAllowed": {
            "title": "Allow user feedback",
            "description": "Allow user feedback. If the policy is set to false, users can not send feedback to Google",
            "property_order": 104,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "VideoCaptureAllowed": {
            "title": "Allow or deny video capture",
            "description": "If enabled or not configured (default), the user will be prompted for video capture access except for URLs configured in the VideoCaptureAllowedUrls list which will be granted access without prompting",
            "property_order": 105,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "VideoCaptureAllowedUrls": {
            "title": "URLs that will be granted access to video capture devices without prompt",
            "description": "Patterns in this list will be matched against the security origin of the requesting URL. If a match is found, access to video capture devices will be granted without prompt",
            "property_order": 106,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "WPADQuickCheckEnabled": {
            "title": "Enable WPAD optimization",
            "description": "Allows to turn off WPAD (Web Proxy Auto-Discovery) optimization in Google Chrome",
            "property_order": 107,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "WebAppInstallForceList": {
            "type": "object",
            "title": "Configure list of force-installed Web Apps",
            "properties": {
                "url": {
                    "title": "URL",
                    "description": "URL",
                    "type": "string"
                },
                "create_desktop_shortcut": {
                    "title": "Create Desktop Shortcut",
                    "description": "Create Desktop Shortcut",
                    "type": "boolean"
                },
                "default_launch_container": {
                    "title": "Default launch container",
                    "description": "Default launch container",
                    "type": "string"
                }
            }
        },
        "WebComponentsV0Enabled": {
            "title": "Re-enable Web Components v0 API until M84",
            "description": "The Web Components v0 APIs (Shadow DOM v0, Custom Elements v0, and HTML Imports) were deprecated in 2018, and have been disabled by default starting in M80. This policy allows these features to be selectively re-enabled until M84",
            "property_order": 108,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "WebRtcEventLogCollectionAllowed": {
            "title": "Allow collection of WebRTC event logs from Google services",
            "description": "Setting the policy to True allows Google Chrome to collect WebRTC event logs from Google services such as Hangouts Meet and upload them to Google. These logs have diagnostic information for debugging issues with audio or video meetings in Google Chrome, such as the time and size of RTP packets, feedback about congestion on the network, and metadata about time and quality of audio and video frames",
            "property_order": 109,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "WebRtcLocalIpsAllowedUrls": {
            "title": "URLs for which local IPs are exposed in WebRTC ICE candidates",
            "description": "Patterns in this list will be matched against the security origin of the requesting URL. If a match is found or chrome://flags/#enable-webrtc-hide-local-ips-with-mdns is Disabled, the local IP addresses are shown in WebRTC ICE candidates. Otherwise, local IP addresses are concealed with mDNS hostnames. Please note that this policy weakens the protection of local IPs if needed by administrators",
            "property_order": 110,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "WebRtcUdpPortRange": {
            "title": "Restrict the range of local UDP ports used by WebRTC",
            "description": "If the policy is set, the UDP port range used by WebRTC is restricted to the specified port interval (endpoints included)",
            "property_order": 111,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        }
    }
}
