{
    "title": "NoMAD Password Preferences",
    "description": "NoMAD Password Preferences",
    "__preferencedomain": "com.trusourcelabs.NoMAD",
    "properties": {
        "ChangePasswordCommand": {
            "title": "ChangePasswordCommand",
            "description": "Script or other binary to run when a password is sucessfully changed.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "Key: ChangePasswordCommand"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "ChangePasswordOptions": {
            "title": "ChangePasswordOptions",
            "description": "Task, URL or App path for ChangePasswordType (&lt;&lt;serial&gt;&gt;, &lt;&lt;fullname&gt;&gt;, &lt;&lt;shortname&gt;&gt; and &lt;&lt;domain&gt;&gt; are currently supported as substitutions).",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "enum": [
                "Kerberos",
                "Task",
                "URL",
                "App",
                "None"
            ],
            "default": "Kerberos",
            "options": {
                "infoText": "Key: ChangePasswordOptions"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "ChangePasswordType": {
            "title": "ChangePasswordType",
            "description": "Determines type of ChangePassword function (Kerberos, Task, URL, App, and None are currently supported).",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "Key: ChangePasswordType"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "HicFix": {
            "title": "HicFix",
            "description": "Enables a secondary password change with AD to fix an issue with macOS 10.13.0 with AD-bound mobile accounts.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "Key: HicFix"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "LocalPasswordSync": {
            "title": "LocalPasswordSync",
            "description": "Determines if we keep the local password in sync with the network password or not.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "default": false,
            "options": {
                "infoText": "Key: LocalPasswordSync"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "LocalPasswordSyncDontSyncLocalUsers": {
            "title": "LocalPasswordSyncDontSyncLocalUsers",
            "description": "An array of user names that if they match the current local user, NoMAD won\u2019t synchronize the password regardless of what user logs into AD.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Username"
                    }
                }
            ],
            "options": {
                "infoText": "Key: LocalPasswordSyncDontSyncLocalUsers"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "LocalPasswordSyncDontSyncNetworkUsers": {
            "title": "LocalPasswordSyncDontSyncNetworkUsers",
            "description": "An array of user names that if they match the AD user signing in, NoMAD won\u2019t synchronize the password regardless of what user logs into AD.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Username"
                    }
                }
            ],
            "options": {
                "infoText": "Key: LocalPasswordSyncDontSyncNetworkUsers"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "LocalPasswordSyncOnMatchOnly": {
            "title": "LocalPasswordSyncOnMatchOnly",
            "description": "Determines if the domain password will be synced to the local account only when the account names match.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "Key: LocalPasswordSyncOnMatchOnly"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "MessagePasswordChangePolicy": {
            "title": "MessagePasswordChangePolicy",
            "description": "Message text to display in the password change dialog to help the user understand how complext they need to be.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "Key: MessagePasswordChangePolicy"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "MessageUPCAlert": {
            "title": "MessageUPCAlert",
            "description": "Message to be shown in an UPCAlert notification.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "Key: MessageUPCAlert"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "PasswordExpireAlertTime": {
            "title": "PasswordExpireAlertTime",
            "description": "The threshold, in seconds, for when to start notifying the user about their expiring password \u2013 set to 0 to never be bothered, and defaults to 15 days or 1,296,000 seconds.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ],
            "default": 1296000,
            "options": {
                "infoText": "Key: PasswordExpireAlertTime"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "PasswordExpireCustomAlert": {
            "title": "PasswordExpireCustomAlert",
            "description": "Custom alert to show in the menu bar instead of days to go.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "Key: PasswordExpireCustomAlert"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "PasswordExpireCustomWarnTime": {
            "title": "PasswordExpireCustomWarnTime",
            "description": "Will cause the custom alert to be only shown at a specific threshold, and in yellow.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ],
            "options": {
                "infoText": "Key: PasswordExpireCustomWarnTime"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "PasswordExpireCustomAlertTime": {
            "title": "PasswordExpireCustomAlertTime",
            "description": "Will cause the custom alert to be only shown at a specific threshold, and in red.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ],
            "options": {
                "infoText": "Key: PasswordExpireCustomAlertTime"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "PasswordPolicy": {
            "title": "PasswordPolicy",
            "description": "Will show visual indicators to the user when changing his or her password that it does not meet policy. Note: the values need to be set as Strings in your dictionary.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "object",
                    "properties": {
                        "minLength": {
                            "type": "integer"
                        },
                        "minLowerCase": {
                            "type": "integer"
                        },
                        "minNumber": {
                            "type": "integer"
                        },
                        "minSymbol": {
                            "type": "integer"
                        },
                        "minUpperCase": {
                            "type": "integer"
                        },
                        "minMatches": {
                            "type": "integer"
                        }
                    }
                }
            ],
            "options": {
                "infoText": "Key: PasswordPolicy"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "UPCAlert": {
            "title": "UPCAlert",
            "description": "Determines if NoMAD will alert the user to Unannounced Password Changes, typically when the password was changed in AD and not from the user\u2019s system.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "Key: UPCAlert"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        },
        "UPCAlertAction": {
            "title": "UPCAlertAction",
            "description": "Path to a script or other binary to execute when a UPC Alert occurs.",
            "propertyOrder": 10,
            "anyOf": [
                {
                    "title": "Not Configured",
                    "type": "null"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "Key: UPCAlertAction"
            },
            "links": [
                {
                    "rel": "More information",
                    "href": "https://nomad.menu/help/preferences-and-what-they-do/"
                }
            ]
        }
    }
}
