{
    "title": "Safari Tabs Preferences",
    "description": "Additional preferences managed under the Safari Tabs preference category",
    "__preferencedomain": "com.apple.Safari",
    "properties": {
        "TabCreationPolicy": {
            "title": "Open Pages in Tabs Instead of Windows",
            "description": "Sets how Safari opens new pages",
            "options": {
                "enum_titles": [
                    "Never",
                    "Automatically",
                    "Always"
                ]
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "pattern": "[0-2]",
                    "enum": [
                        0,
                        1,
                        2
                    ],
                    "default": 1
                }
            ]
        },
        "DebugDisableTabHoverPreview": {
            "title": "Disable Preview when Hovering over Tabs",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DebugDisablePerTabWebProcesses": {
          "title": "Disable Per Tab Web Processes",
          "description": "(DebugDisablePerTabWebProcesses)-Disables isolating tabs to their own process",
          "anyOf": [
            {"type": "null", "title": "Not Configured"},
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "Command1Through9SwitchesTabs": {
            "title": "Use Cmd-1 Throgh Cmd-9 to Switch Tabs",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "CommandClickMakesTabs": {
            "title": "Cmd-click Open Link in a New Tab",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "OpenNewTabsInFront": {
            "title": "Make New Tab or Window Frontmost Window",
            "description": "Sets whether to make a newly created tab or window the active one",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ShowIconsInTabs": {
            "title": "Show Icons in Tabs",
            "description": "Sets whether to show website favicons in tabs",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        }
    }
}
