{
    "title": "com.apple.Safari.SafeBrosing",
    "description": "Safari Safe Browsing Preferences",
    "__preferencedomain": "com.apple.Safari.SafeBrowsing",
    "properties": {
        "SafeBrowsingEnabled": {
            "title": "Enable Safari Safebrowsing",
            "description": "Sets whether Safari safebrowsing is enabled",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        }
    }
}
