{
    "title": "Jamf Connect Verify Password Preferences",
    "__preferencedomain": "com.jamf.connect.verify",
    "properties": {
        "TimerLocalCheck": {
            "title": "Local Password Verification Interval",
            "description": "Specifies an interval, in minutes, between local password verifications",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "pattern": "[1-60]",
                    "default": 15
                }
            ]
        },
        "TimerNetworkCheck": {
            "title": "Network Password Verification Interval",
            "description": "Specifies an interval, in minutes, between network password verifications",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "pattern": "[1-60]",
                    "default": 15
                }
            ]
        },
        "NetworkCheckAutomatically": {
            "title": "Automatically Verify Network Password",
            "description": "Determines if the network password is verified automatically",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "LocalPasswordIgnore": {
            "title": "Disable Local Password Verification (Debugging)",
            "description": "Specifies if local password verification should be ignored. This key should only be used for testing purposes",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        }
    }
}
