{
    "title": "Password Policy Settings",
    "description": "Used to configure network password checks, expiration notifications, and password policies",
    "__preferencedomain": "com.jamf.connect",
    "properties": {
        "PasswordPolicies": {
            "type": "object",
            "title": "Password Policies",
            "properties": {
                "ExpirationCountdownStartDay": {
                    "title": "Password Expiration Countdown Start Date",
                    "description": "An integer, in days remaining, before the password expiration countdown is displayed in the menu bar. By default, 14 days is used. This setting is disabled when set to 0",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "integer",
                            "default": "14"
                        }
                    ]
                },
                "ExpirationNotificationStartDay": {
                    "title": "Password Expiration Notification Start Date",
                    "description": "An integer, in days remaining, before the user begins receiving notifications about an upcoming password expiration. By default, 7 days is used. This setting is disabled when set to 0",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "integer",
                            "default": "7"
                        }
                    ]
                },
                "NetworkCheck": {
                    "title": "Network Check-in Frequency",
                    "description": "The check-in frequency that Jamf Connect will use to confirm the network password matches the local password. By default, 15 minutes is used. This setting is disabled when set to 0",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "integer",
                            "default": "15"
                        }
                    ]
                },
                "SyncPasswordsMessage": {
                    "title": "Sync Passwords Message",
                    "description": "A message displayed to users when Jamf Connect detects that their local and network passwords are out of sync and must be reconciled",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "Your local and network passwords do not match. Enter your current local password to sync it with your network password"
                        }
                    },
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string"
                        }
                    ]
                },
                "PolicyRequirements": {
                    "type": "object",
                    "title": "Password Policy Requirements",
                    "properties": {
                        "minLength": {
                            "title": "Minimum Length",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "integer"
                                }
                            ]
                        },
                        "minLowerCase": {
                            "title": "Minimum Number of Lowercase Characters",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "integer"
                                }
                            ]
                        },
                        "minMatches": {
                            "title": "Minimum Number of unique passwords before re-use",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "integer"
                                }
                            ]
                        },
                        "minNumber": {
                            "title": "Minimum Number of digits",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "integer"
                                }
                            ]
                        },
                        "minSymbol": {
                            "title": "Minimum Number of complex characters",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "integer"
                                }
                            ]
                        },
                        "minUpperCase": {
                            "title": "Minimum Number of uppercase characters",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "integer"
                                }
                            ]
                        }
                    }
                },
                "PolicyMessage": {
                    "title": "Password Policy Message",
                    "description": "A message that explains your configured password policy. This message only displays when a users tries to set a password that does not meet your password policy requirements",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "This password does not meet your organization's minimum password complexity requirements"
                        }
                    },
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string"
                        }
                    ]
                }
            }
        }
    }
}
