{
    "title": "1Password Managed Preferences",
    "description": "Managed preferences for 1Password 7.7+",
    "__links": "https://support.1password.com/mobile-device-management/",
    "__version": "1.0",
    "__preferencedomain": "com.agilebits.onepassword7",
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "OPPrefBiometryAllowed": {
            "title": "Allow Biometric Authentication",
            "description": "(OPPrefBiometryAllowed)-If present, enforces whether biometry is allowed (machine must still meet minimum requirements for biometry)",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "OPPrefAppleWatchAllowed": {
            "title": "Allow Apple Watch Authentication",
            "description": "(OPPrefAppleWatchAllowed)-If present, enforces whether apple watch unlock is allowed",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "OPPrefMasterPasswordTimeoutInMinutesKey": {
            "title": "Master Password Timeout in Minutes",
            "description": "(OPPrefMasterPasswordTimeoutInMinutesKey)-If biometry or apple watch unlock is possible based on the prior two settings, then we enforce this master password timeout",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "ConcealPasswords": {
            "title": "Conceal Passwords",
            "description": "(ConcealPasswords)-If present, is factored in when determining if the user can turn off conceal passwords (vault permissions also factor into this)",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "LockOnSleep": {
            "title": "Lock on Sleep",
            "description": "(LockOnSleep)-If present, controls whether lock on sleep is enabled/disabled, enforced disallows user editing",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "LockOnScreenSaver": {
            "title": "Lock on Screen Saver",
            "description": "(LockOnScreenSaver)-If present, controls whether lock on screensaver activation is enabled/disabled, enforced disallows user editing",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "LockOnMainAppExit": {
            "title": "Lock on App Exit",
            "description": "(LockOnMainAppExit)-If present, controls whether lock on close main window is enabled/disabled, enforced disallows user editing",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "LockOnUserSwitch": {
            "title": "Lock on Fast User Switch",
            "description": "(LockOnUserSwitch)-If present, controls whether lock on Fast User Switch is enabled/disabled, enforced disallows user editing",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "LockOnIdle": {
            "title": "Lock on Idle",
            "description": "(LockOnIdle)-If present, controls whether lock on idle is enabled/disabled, enforced disallows user editing",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "LockTimeout": {
            "title": "Lock Timeout in Minutes",
            "description": "(LockTimeout)-If present, enforces an autolock timeout in minutes, should be used in conjunction with `LockOnIdle`",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "settingClearPasteboardAfterTimeout": {
            "title": "Clear Pasteboard after Timeout",
            "description": "(settingClearPasteboardAfterTimeout)-If present, enforces enabled/disabled clearing of the pasteboard after `PasteboardClearTimeout`",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PasteboardClearTimeout": {
            "title": "Clear Pasteboard after N Seconds",
            "description": "(PasteboardClearTimeout)-If present, enforces clearing the pasteboard after the specified number of seconds, as long as the application is still running",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "OPPreferencesNotifyCompromisedWebsites": {
            "title": "Notify User of Compromised Websites",
            "description": "(OPPreferencesNotifyCompromisedWebsites)-If present, it enforces whether compromised website notifications are delivered to the user",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "OPPreferencesNotifyVaultAddedRemoved": {
            "title": "Notify User of Vault Add/Remove Action",
            "description": "(OPPreferencesNotifyVaultAddedRemoved)-If present, it enforces whether value added/removed notifications are delivered to the user",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "OPPreferencesNotifyOfTOTPCopy": {
            "title": "Notify User of TOTP code copy",
            "description": "(OPPreferencesNotifyOfTOTPCopy)-If present, it enforces whether the TOTP code copied notification is delivered to the user",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "CheckForSoftwareUpdatesEnabled": {
            "title": "Check for Software Updates",
            "description": "(CheckForSoftwareUpdatesEnabled)-If present, it enforces whether check for updates is enabled",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "OPPreferencesWhatsNewDialogDisabled": {
            "title": "Hide Release Notes",
            "description": "(OPPreferencesWhatsNewDialogDisabled)-Disables release notes for new versions on first launch",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        }
    }
}
