{
    "title": "Slack Standalone Preferences",
    "description": "Preferences for Managing pkg based installs of Slack",
    "__version": "1.0",
    "__preferencedomain": "com.tinyspeck.slackmacgap",
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "SlackNoAutoUpdates": {
            "title": "Disable Auto Updates",
            "description": "(SlackNoAutoUpdates)-Disables Auto Updates",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
                },
        "SlackDefaultSignInWorkspace": {
            "title": "Slack Default Workspace",
            "description": "(SlackDefaultSignInWorkspace)-Set the default workspace",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        }
    }
}
