{
    "title": "Zoom Chat Settings",
    "__version": "1.0",
    "__preferencedomain": "us.zoom.config",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://support.zoom.us/hc/en-us/articles/115001799006"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "zdisablechat": {
            "title": "Disable Group Chat",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableLinkPreviewInChat": {
            "title": "Disable Link Preview in Chat",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "zdisableft": {
            "title": "Disable File Transfer",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ShowVoiceMessageButton": {
            "title": "Disable Sending Voice Messages",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        }
    }
}
