{
    "title": "Zoom Meeting Settings",
    "__version": "1.0",
    "__preferencedomain": "us.zoom.config",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://support.zoom.us/hc/en-us/articles/115001799006"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "usepmi": {
            "title": "Always use PMI for Instant Meetings",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZDisableVideo": {
            "title": "Disable Camera by Default",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "zdisablesendvideo": {
            "title": "Disable Sending Video",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "zdisablerecvvideo": {
            "title": "Disable Receiving Video",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "disablecomputeraudio": {
            "title": "Disable Computer Audio",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "enableoriginalsound": {
            "title": "Enable Original Sound for Audio",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZAutoJoinVoip": {
            "title": "Automatically Join VoIP",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "audioautoadjust": {
            "title": "Automatically Adjust Microphone Levels",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableEchoCancellation": {
            "title": "Enable Echo Cancellation for Microphone Audio",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "setusesystemdefaultspeakerforvoip": {
            "title": "Use System Default Speaker when Using Computer Audio",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "setusesystemdefaultmicforvoip": {
            "title": "Use System Default Speaker when Using Microphone Audio",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZDualMonitorOn": {
            "title": "Automatically Enable Dual Monitor",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZAutoFullScreenWhenViewShare": {
            "title": "Automatically Enter Full Screen when Sharing Content",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZAutoFitWhenViewShare": {
            "title": "Auto Fit to Window when Sharing Content",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "zdisableannotation": {
            "title": "Disable Annotation When Screen Sharing or Viewing a Screen Share",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableDoNotDisturbInSharing": {
            "title": "Enable Do Not Disturb when Sharing",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "disablewhiteboard": {
            "title": "Disable White Board",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "enablesharevideo": {
            "title": "Allow Sharing of Video Clips",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "enableshareaudio": {
            "title": "Allow Sharing of Audio Only when Screen Sharing",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "FullScreenWhenJoin": {
            "title": "Default to Full Screen when Starting or Joining a Meeting",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AutoHideToolbar": {
            "title": "Always Show Meeting Controls",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZUse720PByDefault": {
            "title": "Enable HD Video by Default",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZRemoteControllAllApp": {
            "title": "Remote Control all Applications",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ZHideNoVideoUser": {
            "title": "Hide non Video Participants by Default",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "MuteVoipWhenJoin": {
            "title": "Always Mute Microphone when Joining a Meeting",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ShowConnectedTime": {
            "title": "Show Time Connected in Meeting",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ConfirmWhenLeave": {
            "title": "Confirm Before Leaving Meeting",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableScreenShare": {
            "title": "Disable Screen Sharing when Starting or Joining a Meeting",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "disableremotecontrol": {
            "title": "Disable Remote Control When Screen Sharing",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "disableremotesupport": {
            "title": "Disable 1-1 Remote Support when Screen Sharing",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableMirrorEffect": {
            "title": "Enable Mirroring of Shared Video",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "enablesplitscreen": {
            "title": "Enable Side by Side Mode by Default",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "zdisablelocalrecord": {
            "title": "Disable Local Recording",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "zdisablecmr": {
            "title": "Disable Cloud Recording",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "disablevirtualbkgnd": {
            "title": "Disable Virtual Backgrounds",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "DisableVideoFilters": {
            "title": "Disable Video Filters",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableIndependentDataPort": {
            "title": "Split Traffic Across Different Ports",
            "description": "(EnableIndependentDataPort)-If enabled, Video will use port 8801, Screensharing 8802, and Audio 8803",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableSSLVerification": {
            "title": "Enable SSL Verification",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableRemindMeetingTime": {
            "title": "Enable Upcoming Meeting Reminders",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "Enable49Video": {
            "title": "Enable Gallery View",
            "description": "(Enable49Video)-Enables up to 49 Participants per screen",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableSpotlightSelf": {
            "title": "Enable Spotlight for Video when Participant Speaks",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "bandwidthlimitup": {
            "title": "Limit Maximum Upstream Bandwidth",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "5000"
                        }
                    }
                }
            ]
        },
        "bandwidthlimitdown": {
            "title": "Limit Maximum Downstream Bandwidth",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "5000"
                        }
                    }
                }
            ]
        },
        "recordpath": {
            "title": "Local Path to Meeting Recordings",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "/Users/Shared/"
                        }
                    }
                }
            ]
        },
        "proxybypass": {
            "title": "Set Proxy Bypass Rule",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": ""
                        }
                    }
                }
            ]
        },
        "proxy": {
            "title": "Proxy Server",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": ""
                        }
                    }
                }
            ]
        },
        "proxypac": {
            "title": "Proxy Server PAC URL",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": ""
                        }
                    }
                }
            ]
        },
        "SetSuppressBackgroundNoiseLevel": {
            "title": "Set Noise Suppression Level",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "enum_titles": [
                            "Auto",
                            "Low",
                            "Medium",
                            "High"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2,
                        3
                    ]
                }
            ]
        }
    }
}
