{
    "title": "Software Update Deferral Preferences",
    "description": "Managed Software Update Deferral Preferences",
    "__preferencedomain": "com.apple.applicationaccess",
    "properties": {
        "enforcedSoftwareUpdateDelay": {
            "title": "Number of Day to Defer Apple Software Updates",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "pattern": "[1-90]",
                    "default": 14
                }
            ]
        },
        "forceDelayedSoftwareUpdates": {
            "title": "Respect Deferred Software Update Settings",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "forceDelayedAppSoftwareUpdates": {
            "title": "Respect Deferred Software Settings for Non OS Updates (Safari etc...)",
            "description": "(forceDelayedAppSoftwareUpdates)-If true, delays user visibility of non-OS Software Updates. Requires a supervised device",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        }
    }
}
