{
    "title": "Menu Item Display Settings",
    "description": " An array of strings used to hide Jamf Connect menu items from users",
    "__preferencedomain": "com.jamf.connect",
    "properties": {
        "Appearance": {
            "type": "object",
            "title": "Appearance Settings",
            "properties": {
                "ShowWelcomeWindow": {
                    "title": "Show Welcome Window on Launch",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "boolean"
                        }
                    ]
                },
                "MenubarIcon": {
                    "title": "Menu Bar Icon (Light Mode)",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string",
                            "options": {
                                "inputAttributes": {
                                    "placeholder": "/usr/local/icon.png"
                                }
                            }
                        }
                    ]
                },
                "MenubarIconDark": {
                    "title": "Menu Bar Icon (Dark Mode)",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string",
                            "options": {
                                "inputAttributes": {
                                    "placeholder": "/usr/local/icondark.png"
                                }
                            }
                        }
                    ]
                }
            }
        }
    }
}
