{
    "title": "Menu Item Display Settings",
    "description": " An array of strings used to hide Jamf Connect menu items from users",
    "__preferencedomain": "com.jamf.connect",
    "properties": {
        "HiddenMenuItems": {
            "title": "Hidden Menu Items",
            "description": "Items that can be hidden: About, Actions, ChangePassword, GetHelp, GetSoftware, HomeDirectory, KerberosTickets, LastUser, PasswordExpiration, Preferences, ResetPassword, Shares, Connect, Quit",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Hidden Item"
                    }
                }
            ]
        }
    }
}
