{
    "title": "Menu Bar Script Settings",
    "description": "Used to run custom scripts that are triggered by Jamf Connect authentication events",
    "__preferencedomain": "com.jamf.connect",
    "properties": {
        "Scripting": {
            "type": "object",
            "title": "Menu Bar Script Settings",
            "properties": {
                "OnPasswordChange": {
                    "title": "Password Change Script",
                    "description": "The file path to a script or other binary to run after successful password change",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "/usr/local/bin/PasswordChange.sh"
                        }
                    },
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string"
                        }
                    ]
                },
                "OnAuthSuccess": {
                    "title": "Successful Sign-in Script",
                    "description": "The file path to a script or other binary to run after a successful Jamf Connect authentication",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "/usr/local/bin/JamfConnectAuth.sh"
                        }
                    },
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string"
                        }
                    ]
                },
                "OnAuthFailure": {
                    "title": "Failed Sign-in Script",
                    "description": "The file path to a script or other binary to run after an unsuccessful Jamf Connect authentication attempt",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "/usr/local/bin/JamfConnectAuthFailure.sh"
                        }
                    },
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string"
                        }
                    ]
                },
                "OnNetworkChange": {
                    "title": "Network Change Script",
                    "description": "The file path to a script or other binary to execute after a network change is detected",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "/usr/local/bin/JamfConnectAuthFailure.sh"
                        }
                    },
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string"
                        }
                    ]
                }
            }
        }
    }
}
