{
    "title": "Menu Bar Script Settings",
    "description": "Jamf Connect 2.x Menu Bar Script Settings",
    "__version": "1.0",
    "__preferencedomain": "com.jamf.connect",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://docs.jamf.com/jamf-connect/2.2.1/administrator-guide/Menu_Bar_App_Preferences.html"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "Scripting": {
            "type": "object",
            "title": "Menu Bar Script Settings",
            "properties": {
                "OnPasswordChange": {
                    "title": "Password Change Script",
                    "description": "(OnPasswordChange)-The file path to a script or other binary to run after successful password change",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string",
                            "options": {
                                "inputAttributes": {
                                    "placeholder": "/usr/local/bin/PasswordChange.sh"
                                }
                            }
                        }
                    ]
                },
                "OnAuthSuccess": {
                    "title": "Successful Sign-in Script",
                    "description": "(OnAuthSuccess)-The file path to a script or other binary to run after a successful Jamf Connect authentication",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string",
                            "options": {
                                "inputAttributes": {
                                    "placeholder": "/usr/local/bin/JamfConnectAuth.sh"
                                }
                            }
                        }
                    ]
                },
                "OnAuthFailure": {
                    "title": "Failed Sign-in Script",
                    "description": "(OnAuthFailure)-The file path to a script or other binary to run after an unsuccessful Jamf Connect authentication attempt",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string",
                            "options": {
                                "inputAttributes": {
                                    "placeholder": "/usr/local/bin/JamfConnectAuthFailure.sh"
                                }
                            }
                        }
                    ]
                },
                "OnNetworkChange": {
                    "title": "Network Change Script",
                    "description": "(OnNetworkChange)-The file path to a script or other binary to execute after a network change is detected",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string",
                            "options": {
                                "inputAttributes": {
                                    "placeholder": "/usr/local/bin/JamfConnectAuthFailure.sh"
                                }
                            }
                        }
                    ]
                }
            }
        }
    }
}
