{
    "title": "cmdReporter File Event Preferences",
    "__version": "1.0",
    "__preferencedomain": "com.cmdsec.cmdReporter",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://wiki.cmdreporter.com/support/solutions/articles/12000060393-full-example-plist"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "FileEventUseFuzzyMatch": {
            "title": "Use Fuzzy Matching",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "FileEventInclusionPaths": {
            "title": "File Event Inclusion Paths",
            "description": "(FileEventInclusionPaths)-Regex based paths to include in file events",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "File Event Path"
                    }
                }
            ]
        },
        "FileEventExclusionPaths": {
            "title": "File Event Exclusion Paths",
            "description": "(FileEventExclusionPaths)-Regex based paths to exclude in file events",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "File Event Path"
                    }
                }
            ]
        }
    }
}
