{
    "title": "cmdReporter AWS Kinesis Streaming Preferences",
    "__version": "1.0",
    "__preferencedomain": "com.cmdsec.cmdReporter",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://wiki.cmdreporter.com/support/solutions/articles/12000065536-aws-kinesis-streaming"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "LogRemoteEndpointEnabled": {
            "title": "Enable Remote Endpoint Logging",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "LogRemoteEndpointType": {
            "title": "Log Remote Enpoint Type",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "AWSKinesis"
                        }
                    }
                }
            ]
        },
        "LogRemoteEndpointAWSKinesis": {
            "type": "object",
            "title": "AWS Kinesis Endpoint Settings",
            "properties": {
                "AccessKeyId": {
                    "title": "Access Key ID",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string",
                            "options": {
                                "inputAttributes": {
                                    "placeholder": "Access Key"
                                }
                            }
                        }
                    ]
                },
                "SecretKey": {
                    "title": "Secret Key",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string",
                            "options": {
                                "inputAttributes": {
                                    "placeholder": "Secret Key"
                                }
                            }
                        }
                    ]
                },
                "StreamName": {
                    "title": "Stream Name",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string",
                            "options": {
                                "inputAttributes": {
                                    "placeholder": "cmdReporter"
                                }
                            }
                        }
                    ]
                },
                "Region": {
                    "title": "Region",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string",
                            "options": {
                                "inputAttributes": {
                                    "placeholder": "us-east-1"
                                }
                            }
                        }
                    ]
                }
            }
        }
    }
}
