{
    "title": "com.google.chrome.httpauthentication",
    "description": "Google Chrome HTTP Authentication Preferences",
    "__preferencedomain": "com.google.Chrome",
    "properties": {
        "AllowCrossOriginAuthPrompt": {
            "title": "Cross-origin HTTP Basic Auth prompts",
            "description": "Controls whether third-party sub-content on a page is allowed to pop-up an HTTP Basic Auth dialog box. Typically this is disabled as a phishing defense. If this policy is not set, this is disabled and third-party sub-content will not be allowed to pop up a HTTP Basic Auth dialog box",
            "property_order": 1,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AuthNegotiateDelegateByKdcPolicy": {
            "title": "Use KDC policy to delegate credentials",
            "description": "Controls whether approval by KDC policy is respected to decide whether to delegate Kerberos tickets",
            "property_order": 2,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "AuthNegotiateDelegateWhitelist": {
            "title": "Kerberos delegation server whitelist",
            "description": "Servers that Google Chrome may delegate to. Separate multiple server names with commas. Wildcards (*) are allowed",
            "property_order": 3,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "AuthSchemes": {
            "title": "Supported authentication schemes",
            "description": "Specifies which HTTP authentication schemes are supported by Google Chrome. Example: basic,digest,ntlm,negotiate",
            "property_order": 4,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "AuthServerWhitelist": {
            "title": "Authentication server whitelist",
            "description": "Specifies which servers should be whitelisted for integrated authentication. Integrated authentication is only enabled when Google Chrome receives an authentication challenge from a proxy or from a server which is in this permitted list. Separate multiple server names with commas. Wildcards (*) are allowed",
            "property_order": 5,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "DisableAuthNegotiateCnameLookup": {
            "title": "Disable CNAME lookup when negotiating Kerberos authentication",
            "description": "Specifies whether the generated Kerberos SPN is based on the canonical DNS name or the original name entered.If you enable this setting, CNAME lookup will be skipped and the server name will be used as entered",
            "property_order": 6,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "EnableAuthNegotiatePort": {
            "title": "Include non-standard port in Kerberos SPN",
            "description": "Specifies whether the generated Kerberos SPN should include a non-standard port. If you enable this setting, and a non-standard port (i.e., a port other than 80 or 443) is entered, it will be included in the generated Kerberos SPN",
            "property_order": 7,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "NtlmV2Enabled": {
            "title": "Enable NTLMv2 authentication",
            "description": "Controls whether NTLMv2 is enabled. All recent versions of Samba and Windows servers support NTLMv2. This should only be disabled for backwards compatibility and reduces the security of authentication",
            "property_order": 8,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        }
    }
}
