{
    "title": "com.google.chrome.cast",
    "description": "Google Chrome Casting Preferences",
    "__preferencedomain": "com.google.Chrome",
    "properties": {
        "EnableMediaRouter": {
            "title": "Enable Google Cast",
            "description": "If this policy is set to true or is not set, Google Cast will be enabled, and users will be able to launch it from the app menu, page context menus, media controls on Cast-enabled websites, and (if shown) the Cast toolbar icon",
            "property_order": 1,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ShowCastIconInToolbar": {
            "title": "Show the Google Cast toolbar icon",
            "description": "If this policy is set to true, the Cast toolbar icon will always be shown on the toolbar or the overflow menu, and users will not be able to remove it",
            "property_order": 2,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        }
    }
}
