{
    "title": "com.google.chrome.extensions",
    "description": "Google Chrome Extensions Preferences",
    "__preferencedomain": "com.google.Chrome",
    "properties": {
        "BlockExternalExtensions": {
            "title": "Blocks external extensions from being installed",
            "description": "Controls external extensions installation",
            "property_order": 1,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ExtensionAllowedTypes": {
            "title": "Configure allowed app/extension types",
            "description": " The value is a list of strings, each of which should be one of the following: extension, theme, user_script, hosted_app, legacy_packaged_app, platform_app. See the Google Chrome extensions documentation for more information on these types",
            "property_order": 2,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "ExtensionInstallBlacklist": {
            "title": "Configure extension installation blacklist",
            "description": "Allows you to specify which extensions the users can NOT install. Extensions already installed will be disabled if blacklisted, without a way for the user to enable them. Once an extension disabled due to the blacklist is removed from it, it will automatically get re-enabled. A blacklist value of '*' means all extensions are blacklisted unless they are explicitly listed in the whitelis",
            "property_order": 3,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "ExtensionInstallForcelist": {
            "title": "Configure the list of force-installed apps and extensions",
            "description": "Specifies a list of apps and extensions that are installed silently, without user interaction, and which cannot be uninstalled nor disabled by the user",
            "property_order": 4,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "ExtensionInstallSources": {
            "title": "Configure extension, app, and user script install sources",
            "description": "Each item in this list is an extension-style match pattern (see https://developer.chrome.com/extensions/match_patterns). Users will be able to easily install items from any URL that matches an item in this list. Both the location of the *.crx file and the page where the download is started from (i.e. the referrer) must be allowed by these patterns",
            "property_order": 5,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        },
        "ExtensionInstallWhitelist": {
            "title": "Configure extension installation whitelist",
            "description": "Allows you to specify which extensions are not subject to the blacklist",
            "property_order": 6,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string"
                    }
                }
            ]
        }
    }
}
