{
    "title": "Microsoft Edge Additional Settings",
    "__version": "Microsoft Edge 92 or later",
    "__preferencedomain": "com.microsoft.Edge",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#additional"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "AADWebSiteSSOUsingThisProfileEnabled": {
            "title": "Single sign-on for work or school sites using this profile enabled",
            "description": "(AADWebSiteSSOUsingThisProfileEnabled)-'Allow single sign-on for work or school sites using this profile' option allows non-AAD profiles to be able to use single sign-on for work or school sites using work or school credentials present on the machine. This option shows up for end-users as a toggle in Settings -> Profiles -> Profile Preferences for non-AAD profiles only",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#aadwebsitessousingthisprofileenabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "AccessibilityImageLabelsEnabled": {
            "title": "Let screen readers get image descriptions from Microsoft",
            "description": "(AccessibilityImageLabelsEnabled)-Lets screen reader users get descriptions of unlabeled images on the web. If you enable or don't configure this policy, users have the option of using an anonymous Microsoft service. This service provides automatic descriptions for unlabeled images users encounter on the web when they're using a screen reader",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#accessibilityimagelabelsenabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "AddressBarMicrosoftSearchInBingProviderEnabled": {
            "title": "AddressBarMicrosoftSearchInBingProviderEnabled - Enable Microsoft Search in Bing suggestions in the address bar",
            "description": "Enables the display of relevant Microsoft Search in Bing suggestions in the address bar's suggestion list when the user types a search string in the address bar. If you enable or don't configure this policy, users can see internal results powered by Microsoft Search in Bing in the Microsoft Edge address bar suggestion list. To see the Microsoft Search in Bing results, the user must be signed into Microsoft Edge with their Azure AD account for that organization.\nIf you disable this policy, users can't see internal results in the Microsoft Edge address bar suggestion list.\nIf you have enabled the set of policies which forces a default search provider (\"DefaultSearchProviderEnabled\", \"DefaultSearchProviderName\" and \"DefaultSearchProviderSearchURL\"), and the search provider specified is not Bing, then this policy is not applicable and there will be no Microsoft Search in Bing suggestions in the address bar's suggestion list.",
            "property_order": 10,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "AddressBarMicrosoftSearchInBingProviderEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#addressbarmicrosoftsearchinbingproviderenabled"
                }
            ]
        },
        "AdsSettingForIntrusiveAdsSites": {
            "title": "AdsSettingForIntrusiveAdsSites - Ads setting for sites with intrusive ads",
            "description": "Controls whether ads are blocked on sites with intrusive ads.\n\nPolicy options mapping:\n\n* AllowAds (1) = Allow ads on all sites\n\n* BlockAds (2) = Block ads on sites with intrusive ads. (Default value)\n\nUse the preceding information when configuring this policy.",
            "property_order": 15,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "AllowAds - Allow ads on all sites",
                            "BlockAds - Block ads on sites with intrusive ads. (Default value)"
                        ]
                    },
                    "enum": [
                        1,
                        2
                    ]
                }
            ],
            "options": {
                "infoText": "AdsSettingForIntrusiveAdsSites"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#adssettingforintrusiveadssites"
                }
            ]
        },
        "AllowDeletingBrowserHistory": {
            "title": "AllowDeletingBrowserHistory - Enable deleting browser and download history",
            "description": "Enables deleting browser history and download history and prevents users from changing this setting.\n\nNote that even with this policy is disabled, the browsing and download history aren't guaranteed to be retained: users can edit or delete the history database files directly, and the browser itself may remove (based on expiration period) or archive any or all history items at any time.\n\nIf you enable this policy or don't configure it, users can delete the browsing and download history.\n\nIf you disable this policy, users can't delete browsing and download history, and history sync will be disabled.\n\nIf you enable this policy, don't enable the \"ClearBrowsingDataOnExit\" policy, because they both deal with deleting data. If you enable both, the \"ClearBrowsingDataOnExit\" policy takes precedence and deletes all data when Microsoft Edge closes, regardless of how this policy is configured.",
            "property_order": 25,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "AllowDeletingBrowserHistory"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#allowdeletingbrowserhistory"
                }
            ]
        },
        "AllowFileSelectionDialogs": {
            "title": "AllowFileSelectionDialogs - Allow file selection dialogs",
            "description": "Allow access to local files by letting Microsoft Edge display file selection dialogs.\n\nIf you enable or don't configure this policy, users can open file selection dialogs as normal.\n\nIf you disable this policy, whenever the user performs an action that triggers a file selection dialog (like importing favorites, uploading files, or saving links), a message is displayed instead, and the user is assumed to have clicked Cancel on the file selection dialog.",
            "property_order": 30,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "AllowFileSelectionDialogs"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#allowfileselectiondialogs"
                }
            ]
        },
        "AllowSurfGame": {
            "title": "AllowSurfGame - Allow surf game",
            "description": "If you disable this policy, users won't be able to play the surf game when the device is offline or if the user navigates to edge://surf.\n\nIf you enable or don't configure this policy, users can play the surf game.",
            "property_order": 35,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "AllowSurfGame"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#allowsurfgame"
                }
            ]
        },
        "AllowSyncXHRInPageDismissal": {
            "title": "AllowSyncXHRInPageDismissal - Allow pages to send synchronous XHR requests during page dismissal",
            "description": "This policy is deprecated because it's only intended to be a short-term mechanism to give enterprises more time to update their web content if and when it's found to be incompatible with the change to disallow synchronous XHR requests during page dismissal. It won't work in Microsoft Edge version 88.\n\nThis policy lets you specify that a page can send synchronous XHR requests during page dismissal.\n\nIf you enable this policy, pages can send synchronous XHR requests during page dismissal.\n\nIf you disable this policy or don't configure this policy, pages aren't allowed to send synchronous XHR requests during page dismissal.",
            "property_order": 40,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "AllowSyncXHRInPageDismissal"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#allowsyncxhrinpagedismissal"
                }
            ]
        },
        "AllowTrackingForUrls": {
            "title": "AllowTrackingForUrls - Configure tracking prevention exceptions for specific sites",
            "description": "Configure the list of URL patterns that are excluded from tracking prevention.\n\nIf you configure this policy, the list of configured URL patterns is excluded from tracking prevention.\n\nIf you don't configure this policy, the global default value from the \"Block tracking of users' web-browsing activity\" policy (if set) or the user's personal configuration is used for all sites.",
            "property_order": 45,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "AllowTrackingForUrls"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#allowtrackingforurls"
                }
            ]
        },
        "AlternateErrorPagesEnabled": {
            "title": "AlternateErrorPagesEnabled - Suggest similar pages when a webpage can't be found",
            "description": "Allow Microsoft Edge to issue a connection to a web service to generate URL and search suggestions for connectivity issues such as DNS errors.\n\nIf you enable this policy, a web service is used to generate url and search suggestions for network errors.\n\nIf you disable this policy, no calls to the web service are made and a standard error page is shown.\n\nIf you don't configure this policy, Microsoft Edge respects the user preference that's set under Services at edge://settings/privacy.\nSpecifically, there's a **Suggest similar pages when a webpage can't be found** toggle, which the user can switch on or off. Note that if you have enable this policy (AlternateErrorPagesEnabled), the Suggest similar pages when a webpage can't be found setting is turned on, but the user can't change the setting by using the toggle. If you disable this policy, the Suggest similar pages when a webpage can't be found setting is turned off, and the user can't change the setting by using the toggle.",
            "property_order": 50,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "AlternateErrorPagesEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#alternateerrorpagesenabled"
                }
            ]
        },
        "AlwaysOpenPdfExternally": {
            "title": "AlwaysOpenPdfExternally - Always open PDF files externally",
            "description": "Disables the internal PDF viewer in Microsoft Edge.\n\nIf you enable this policy Microsoft Edge treats PDF files as downloads and lets users open them with the default application.\n\nIf you don't configure this policy or disable it, Microsoft Edge will open PDF files (unless the user disables it).",
            "property_order": 55,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "AlwaysOpenPdfExternally"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#alwaysopenpdfexternally"
                }
            ]
        },
        "AmbientAuthenticationInPrivateModesEnabled": {
            "title": "AmbientAuthenticationInPrivateModesEnabled - Enable Ambient Authentication for InPrivate and Guest profiles",
            "description": "Configure this policy to allow/disallow ambient authentication for InPrivate and Guest profiles in Microsoft Edge.\n\nAmbient Authentication is http authentication with default credentials when explicit credentials aren't provided via NTLM/Kerberos/Negotiate challenge/response schemes.\n\nIf you set the policy to 'RegularOnly', it allows ambient authentication for Regular sessions only. InPrivate and Guest sessions won't be allowed to ambiently authenticate.\n\nIf you set the policy to 'InPrivateAndRegular', it allows ambient authentication for InPrivate and Regular sessions. Guest sessions won't be allowed to ambiently authenticate.\n\nIf you set the policy to 'GuestAndRegular', it allows ambient authentication for Guest and Regular sessions. InPrivate sessions won't be allowed to ambiently authenticate\n\nIf you set the policy to 'All', it allows ambient authentication for all sessions.\n\nNote that ambient authentication is always allowed on regular profiles.\n\nIn Microsoft Edge version 81 and later, if the policy is left not set, ambient authentication will be enabled in regular sessions only.\n\nPolicy options mapping:\n\n* RegularOnly (0) = Enable ambient authentication in regular sessions only\n\n* InPrivateAndRegular (1) = Enable ambient authentication in InPrivate and regular sessions\n\n* GuestAndRegular (2) = Enable ambient authentication in guest and regular sessions\n\n* All (3) = Enable ambient authentication in regular, InPrivate and guest sessions\n\nUse the preceding information when configuring this policy.",
            "property_order": 60,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "RegularOnly - Enable ambient authentication in regular sessions only",
                            "InPrivateAndRegular - Enable ambient authentication in InPrivate and regular sessions",
                            "GuestAndRegular - Enable ambient authentication in guest and regular sessions",
                            "All - Enable ambient authentication in regular, InPrivate and guest sessions"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2,
                        3
                    ]
                }
            ],
            "options": {
                "infoText": "AmbientAuthenticationInPrivateModesEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#ambientauthenticationinprivatemodesenabled"
                }
            ]
        },
        "AppCacheForceEnabled": {
            "title": "AppCacheForceEnabled - Allows the AppCache feature to be re-enabled, even if it's turned off by default",
            "description": "If you set this policy to true, the AppCache is enabled, even when AppCache in Microsoft Edge is not available by default.\n\nIf you set this policy to false, or don't set it, AppCache will follow Microsoft Edge's defaults.",
            "property_order": 65,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "AppCacheForceEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#appcacheforceenabled"
                }
            ]
        },
        "AudioCaptureAllowed": {
            "title": "AudioCaptureAllowed - Allow or block audio capture",
            "description": "Allows you to set whether a user is prompted to grant a website access to their audio capture device. This policy applies to all URLs except for those configured in the \"AudioCaptureAllowedUrls\" list.\n\nIf you enable this policy or don't configure it (the default setting), the user is prompted for audio capture access except from the URLs in the \"AudioCaptureAllowedUrls\" list. These listed URLs are granted access without prompting.\n\nIf you disable this policy, the user is not prompted, and audio capture is accessible only to the URLs configured in \"AudioCaptureAllowedUrls\".\n\nThis policy affects all types of audio inputs, not only the built-in microphone.",
            "property_order": 70,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "AudioCaptureAllowed"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#audiocaptureallowed"
                }
            ]
        },
        "AudioCaptureAllowedUrls": {
            "title": "AudioCaptureAllowedUrls - Sites that can access audio capture devices without requesting permission",
            "description": "Specify websites, based on URL patterns, that can use audio capture devices without asking the user for permission. Patterns in this list are matched against the security origin of the requesting URL. If they match, the site is automatically granted access to audio capture devices.",
            "property_order": 75,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "AudioCaptureAllowedUrls"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#audiocaptureallowedurls"
                }
            ]
        },
        "AudioSandboxEnabled": {
            "title": "AudioSandboxEnabled - Allow the audio sandbox to run",
            "description": "This policy controls the audio process sandbox.\n\nIf you enable this policy, the audio process will run sandboxed.\n\nIf you disable this policy, the audio process will run unsandboxed and the WebRTC audio-processing module will run in the renderer process.\nThis leaves users open to security risks related to running the audio subsystem unsandboxed.\n\nIf you don't configure this policy, the default configuration for the audio sandbox will be used, which might differ based on the platform.\n\nThis policy is intended to give enterprises flexibility to disable the audio sandbox if they use security software setups that interfere with the sandbox.",
            "property_order": 80,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "AudioSandboxEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#audiosandboxenabled"
                }
            ]
        },
        "AutoImportAtFirstRun": {
            "title": "AutoImportAtFirstRun - Automatically import another browser's data and settings at first run",
            "description": "If you enable this policy, all supported datatypes and settings from the specified browser will be silently and automatically imported at first run. During the First Run Experience, the import section will also be skipped.\n\nThe browser data from Microsoft Edge Legacy will always be silently migrated at the first run, irrespective of the value of this policy.\n\nIf this policy is set to 'FromDefaultBrowser', then the datatypes corresponding to the default browser on the managed device will be imported.\n\nIf the browser specified as the value of this policy is not present in the managed device, Microsoft Edge will simply skip the import without any notification to the user.\n\nIf you set this policy to 'DisabledAutoImport', the import section of the first-run experience is skipped entirely and Microsoft Edge doesn't import browser data and settings automatically.\n\nIf this policy is set to the value of 'FromInternetExplorer', the following datatypes will be imported from Internet Explorer:\n1. Favorites or bookmarks\n2. Saved passwords\n3. Search engines\n4. Browsing history\n5. Home page\n\nIf this policy is set to the value of 'FromGoogleChrome', the following datatypes will be imported from Google Chrome:\n1. Favorites\n2. Saved passwords\n3. Addresses and more\n4. Payment info\n5. Browsing history\n6. Settings\n7. Pinned and Open tabs\n8. Extensions\n9. Cookies\n\nNote: For more details on what is imported from Google Chrome, please see https://go.microsoft.com/fwlink/?linkid=2120835\n\nIf this policy is set to the value of 'FromSafari', user data is no longer imported into Microsoft Edge. This is due to the way Full Disk Access works on Mac.\nOn macOS Mojave and above, it's no longer possible to have automated and unattended import of Safari data into Microsoft Edge.\n\nStarting with Microsoft Edge version 83, if this policy is set to the value of 'FromMozillaFirefox', the following datatypes will be imported from Mozilla Firefox:\n1. Favorites or bookmarks\n2. Saved passwords\n3. Addresses and more\n4. Browsing History\n\nIf you want to restrict specific datatypes from getting imported on the managed devices, you can use this policy with other policies such as \"ImportAutofillFormData\", \"ImportBrowserSettings\", \"ImportFavorites\", and etc.\n\nPolicy options mapping:\n\n* FromDefaultBrowser (0) = Automatically imports all supported datatypes and settings from the default browser\n\n* FromInternetExplorer (1) = Automatically imports all supported datatypes and settings from Internet Explorer\n\n* FromGoogleChrome (2) = Automatically imports all supported datatypes and settings from Google Chrome\n\n* FromSafari (3) = Automatically imports all supported datatypes and settings from Safari\n\n* DisabledAutoImport (4) = Disables automatic import, and the import section of the first-run experience is skipped\n\n* FromMozillaFirefox (5) = Automatically imports all supported datatypes and settings from Mozilla Firefox\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "FromDefaultBrowser - Automatically imports all supported datatypes and settings from the default browser",
                            "FromInternetExplorer - Automatically imports all supported datatypes and settings from Internet Explorer",
                            "FromGoogleChrome - Automatically imports all supported datatypes and settings from Google Chrome",
                            "FromSafari - Automatically imports all supported datatypes and settings from Safari",
                            "DisabledAutoImport - Disables automatic import, and the import section of the first-run experience is skipped",
                            "FromMozillaFirefox - Automatically imports all supported datatypes and settings from Mozilla Firefox"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2,
                        3,
                        4,
                        5
                    ]
                }
            ],
            "options": {
                "infoText": "AutoImportAtFirstRun"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#autoimportatfirstrun"
                }
            ]
        },
        "AutoLaunchProtocolsComponentEnabled": {
            "title": "AutoLaunchProtocolsComponentEnabled",
            "description": "(AutoLaunchProtocolsComponentEnabled)-Specifies whether the AutoLaunch Protocols component should be enabled. This component allows Microsoft to provide a list similar to that of the AutoLaunchProtocolsFromOrigins policy, allowing certain external protocols to launch without prompt or blocking certain protocols (on specified origins). By default, this component is enabled",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#autolaunchprotocolscomponentenabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "AutoLaunchProtocolsFromOrigins": {
            "title": "AutoLaunchProtocolsFromOrigins - not configurable in UI, please craft plist",
            "description": "Allows you to set a list of protocols, and for each protocol an associated list of allowed origin patterns, that can launch an external application without prompting the user. The trailing separator should not be included when listing the protocol. For example, list \"skype\" instead of \"skype:\" or \"skype://\".\n\nIf you configure this policy, a protocol will only be permitted to launch an external application without prompting by policy if:\n\n- the protocol is listed\n\n- the origin of the site trying to launch the protocol matches one of the origin patterns in that protocol's allowed_origins list.\n\nIf either condition is false, the external protocol launch prompt will not be omitted by policy.\n\nIf you don't configure this policy, no protocols can launch without a prompt. Users can opt out of prompts on a per-protocol/per-site basis unless the \"ExternalProtocolDialogShowAlwaysOpenCheckbox\" policy is set to Disabled. This policy has no impact on per-protocol/per-site prompt exemptions set by users.\n\nThe origin matching patterns use a similar format to those for the \"URLBlocklist\" policy, which are documented at https://go.microsoft.com/fwlink/?linkid=2095322.\n\nHowever, origin matching patterns for this policy cannot contain \"/path\" or \"@query\" elements. Any pattern that does contain a \"/path\" or \"@query\" element will be ignored.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                }
            ],
            "options": {
                "infoText": "AutoLaunchProtocolsFromOrigins"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#autolaunchprotocolsfromorigins"
                }
            ]
        },
        "AutoOpenAllowedForURLs": {
            "title": "AutoOpenAllowedForURLs - URLs where AutoOpenFileTypes can apply",
            "description": "A list of URLs to which \"AutoOpenFileTypes\" will apply to. This policy has no impact on automatically open values set by users via the download shelf ... > \"Always open files of this type\" menu entry.\n\nIf you set URLs in this policy, files will only automatically open by policy if the URL is part of this set and the file type is listed in \"AutoOpenFileTypes\". If either condition is false, the download won't automatically open by policy.\n\nIf you don't set this policy, all downloads where the file type is in \"AutoOpenFileTypes\" will automatically open.\n\nA URL pattern has to be formatted according to https://go.microsoft.com/fwlink/?linkid=2095322.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "AutoOpenAllowedForURLs"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#autoopenallowedforurls"
                }
            ]
        },
        "AutoOpenFileTypes": {
            "title": "AutoOpenFileTypes - List of file types that should be automatically opened on download",
            "description": "This policy sets a list of file types that should be automatically opened on download. Note: The leading separator should not be included when listing the file type, so list \"txt\" instead of \".txt\".\n\nBy default, these file types will be automatically opened on all URLs. You can use the \"AutoOpenAllowedForURLs\" policy to restrict the URLs for which these file types will be automatically opened on.\n\nFiles with types that should be automatically opened will still be subject to the enabled Microsoft Defender SmartScreen checks and won't be opened if they fail those checks.\n\nFile types that a user has already specified to automatically be opened will continue to do so when downloaded. The user will continue to be able to specify other file types to be automatically opened.\n\nIf you don't set this policy, only file types that a user has already specified to automatically be opened will do so when downloaded.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "AutoOpenFileTypes"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#autoopenfiletypes"
                }
            ]
        },
        "AutofillAddressEnabled": {
            "title": "AutofillAddressEnabled - Enable AutoFill for addresses",
            "description": "Enables the AutoFill feature and allows users to auto-complete address information in web forms using previously stored information.\n\nIf you disable this policy, AutoFill never suggests or fills in address information, nor does it save additional address information that the user might submit while browsing the web.\n\nIf you enable this policy or don't configure it, users can control AutoFill for addresses in the user interface.\n\nNote that if you disable this policy you also stop all activity for all web forms, except payment and password forms. No further entries are saved, and Microsoft Edge won't suggest or AutoFill any previous entries.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "AutofillAddressEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#autofilladdressenabled"
                }
            ]
        },
        "AutofillCreditCardEnabled": {
            "title": "AutofillCreditCardEnabled - Enable AutoFill for credit cards",
            "description": "Enables Microsoft Edge's AutoFill feature and lets users auto complete credit card information in web forms using previously stored information.\n\nIf you disable this policy, AutoFill never suggests or fills credit card information, nor will it save additional credit card information that users might submit while browsing the web.\n\nIf you enable this policy or don't configure it, users can control AutoFill for credit cards.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "AutofillCreditCardEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#autofillcreditcardenabled"
                }
            ]
        },
        "AutomaticHttpsDefault": {
            "title": "Configure Automatic HTTPS",
            "description": "(AutomaticHttpsDefault)-This policy lets you manage settings for AutomaticHttpsDefault, which switches connections from HTTP to HTTPS. This feature helps protect against man-in-the-middle attacks by enforcing more secure connections, but users might experience more connection errors",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#automatichttpsdefault"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "Automatic HTTPS functionality is disabled",
                            "Navigations delivered over HTTP are switched to HTTPS, only on domains likely to support HTTPS",
                            "All navigations delivered over HTTP are switched to HTTPS"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2
                    ]
                }
            ]
        },
        "AutoplayAllowed": {
            "title": "AutoplayAllowed - Allow media autoplay for websites",
            "description": "This policy sets the media autoplay policy for websites.\n\nThe default setting, \"Not configured\" respects the current media autoplay settings and lets users configure their autoplay settings.\n\nSetting to \"Enabled\" sets media autoplay to \"Allow\".  All websites are allowed to autoplay media. Users can't override this policy.\n\nSetting to \"Disabled\" sets media autoplay to \"Block\".  No websites are allowed to autoplay media. Users can't override this policy.\n\nA tab will need to be closed and re-opened for this policy to take effect.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "AutoplayAllowed"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#autoplayallowed"
                }
            ]
        },
        "AutoplayAllowlist": {
            "title": "Allow media autoplay on specific sites",
            "description": "(AutoplayAllowlist)-Define a list of sites, based on URL patterns, that are allowed to autoplay media",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#autoplayallowlist"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "URL Pattern"
                    }
                }
            ]
        },
        "BackgroundTemplateListUpdatesEnabled": {
            "title": "BackgroundTemplateListUpdatesEnabled - Enables background updates to the list of available templates for Collections and other features that use templates",
            "description": "Lets you enable or disable background updates to the list of available templates for Collections and other features that use templates.  Templates are used to extract rich metadata from a webpage when the page is saved to a collection.\n\nIf you enable this setting or the setting is unconfigured, the list of available templates will be downloaded in the background from a Microsoft service every 24 hours.\n\nIf you disable this setting the list of available templates will be downloaded on demand. This type of download might result in small performance penalties for Collections and other features.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "BackgroundTemplateListUpdatesEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#backgroundtemplatelistupdatesenabled"
                }
            ]
        },
        "BingAdsSuppression": {
            "title": "BingAdsSuppression - Block all ads on Bing search results",
            "description": "Enables an ad-free search experience on Bing.com\n\nIf you enable this policy, then a user can search on bing.com and have an ad-free search experience. At the same time, the SafeSearch setting will be set to 'Strict' and can't be changed by the user.\n\nIf you don't configure this policy, then the default experience will have ads in the search results on bing.com. SafeSearch will be set to 'Moderate' by default and can be changed by the user.\n\nThis policy is only available for K-12 SKUs that are identified as EDU tenants by Microsoft.\n\nPlease refer to https://go.microsoft.com/fwlink/?linkid=2119711 to learn more about this policy or if the following scenarios apply to you:\n\n* You have an EDU tenant, but the policy doesn't work.\n\n* You had your IP whitelisted for having an ad free search experience.\n\n* You were experiencing an ad-free search experience on Microsoft Edge Legacy and want to upgrade to the new version of Microsoft Edge.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "BingAdsSuppression"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#bingadssuppression"
                }
            ]
        },
        "BlockThirdPartyCookies": {
            "title": "BlockThirdPartyCookies - Block third party cookies",
            "description": "Block web page elements that aren't from the domain that's in the address bar from setting cookies.\n\nIf you enable this policy, web page elements that are not from the domain that is in the address bar can't set cookies\n\nIf you disable this policy, web page elements from domains other than in the address bar can set cookies.\n\nIf you don't configure this policy, third-party cookies are enabled but users can change this setting.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "BlockThirdPartyCookies"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#blockthirdpartycookies"
                }
            ]
        },
        "BrowserAddProfileEnabled": {
            "title": "BrowserAddProfileEnabled - Enable profile creation from the Identity flyout menu or the Settings page",
            "description": "Allows users to create new profiles, using the **Add profile** option.\nIf you enable this policy or don't configure it, Microsoft Edge allows users to use **Add profile** on the Identity flyout menu or the Settings page to create new profiles.\n\nIf you disable this policy, users cannot add new profiles from the Identity flyout menu or the Settings page.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "BrowserAddProfileEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#browseraddprofileenabled"
                }
            ]
        },
        "BrowserGuestModeEnabled": {
            "title": "BrowserGuestModeEnabled - Enable guest mode",
            "description": "Enable the option to allow the use of guest profiles in Microsoft Edge. In a guest profile, the browser doesn't import browsing data from existing profiles, and it deletes browsing data when all guest profiles are closed.\n\nIf you enable this policy or don't configure it, Microsoft Edge lets users browse in guest profiles.\n\nIf you disable this policy, Microsoft Edge doesn't let users browse in guest profiles.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "BrowserGuestModeEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#browserguestmodeenabled"
                }
            ]
        },
        "BrowserNetworkTimeQueriesEnabled": {
            "title": "BrowserNetworkTimeQueriesEnabled - Allow queries to a Browser Network Time service",
            "description": "Prevents Microsoft Edge from occasionally sending queries to a browser network time service to retrieve an accurate timestamp.\n\nIf you disable this policy, Microsoft Edge will stop sending queries to a browser network time service.\n\nIf you enable this policy or don't configure it, Microsoft Edge will occasionally send queries to a browser network time service.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "BrowserNetworkTimeQueriesEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#browsernetworktimequeriesenabled"
                }
            ]
        },
        "BrowserSignin": {
            "title": "BrowserSignin - Browser sign-in settings",
            "description": "Specify whether a user can sign into Microsoft Edge with their account and use account-related services like sync and single sign on. To control the availability of sync, use the \"SyncDisabled\" policy instead.\n\nIf you set this policy to 'Disable', make sure that you also set the \"NonRemovableProfileEnabled\" policy to disabled because \"NonRemovableProfileEnabled\" disables the creation of an automatically signed in browser profile. If both policies are set, Microsoft Edge will use the 'Disable browser sign-in' policy and behave as if \"NonRemovableProfileEnabled\" is set to disabled.\n\nIf you set this policy to 'Enable', users can sign into the browser. Signing into the browser doesn't mean that sync is turned on by default; the user must separately opt-in to use this feature.\n\nIf you set this policy to 'Force', users must sign into a profile to use the browser. By default, this will allow the user to choose whether they want to sync to their account, unless sync is disabled by the domain admin or with the \"SyncDisabled\" policy. The default value of \"BrowserGuestModeEnabled\" policy is set to false.\n\nIf you don't configure this policy users can decide if they want to enable the browser sign-in option and use it as they see fit.\n\nPolicy options mapping:\n\n* Disable (0) = Disable browser sign-in\n\n* Enable (1) = Enable browser sign-in\n\n* Force (2) = Force users to sign-in to use the browser\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "Disable - Disable browser sign-in",
                            "Enable - Enable browser sign-in",
                            "Force - Force users to sign-in to use the browser"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2
                    ]
                }
            ],
            "options": {
                "infoText": "BrowserSignin"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#browsersignin"
                }
            ]
        },
        "BuiltInDnsClientEnabled": {
            "title": "BuiltInDnsClientEnabled - Use built-in DNS client",
            "description": "Controls whether to use the built-in DNS client.\n\nThis does not affect which DNS servers are used; just the software stack which is used to communicate with them. For example if the operating system is configured to use an enterprise DNS server, that same server would be used by the built-in DNS client. It is however possible that the built-in DNS client will address servers in different ways by using more modern DNS-related protocols such as DNS-over-TLS.\n\nIf you enable this policy, the built-in DNS client is used, if it's available.\n\nIf you disable this policy, the client is never used.\n\nIf you don't configure this policy, the built-in DNS client is enabled by default on MacOS, and users can change whether to use the built-in DNS client by editing edge://flags or by specifying a command-line flag.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "BuiltInDnsClientEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#builtindnsclientenabled"
                }
            ]
        },
        "BuiltinCertificateVerifierEnabled": {
            "title": "BuiltinCertificateVerifierEnabled - Determines whether the built-in certificate verifier will be used to verify server certificates",
            "description": "This policy is deprecated because it's intended to serve only as a short-term mechanism to give enterprises more time to update their environments and report issues if they are found to be incompatible with the built-in certificate verifier.\n\nIt won't work in Microsoft Edge version 87, when support for the legacy certificate verifier on Mac OS X is planned to be removed.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "BuiltinCertificateVerifierEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#builtincertificateverifierenabled"
                }
            ]
        },
        "CertificateTransparencyEnforcementDisabledForCas": {
            "title": "CertificateTransparencyEnforcementDisabledForCas - Disable Certificate Transparency enforcement for a list of subjectPublicKeyInfo hashes",
            "description": "Disables enforcement of Certificate Transparency requirements for a list of subjectPublicKeyInfo hashes.\n\nThis policy lets you disable Certificate Transparency disclosure requirements for certificate chains that contain certificates with one of the specified subjectPublicKeyInfo hashes. This allows certificates that would otherwise be untrusted because they were not properly publicly disclosed to still be used for Enterprise hosts.\n\nTo disable Certificate Transparency enforcement when this policy is set, one of the following sets of conditions must be met:\n1. The hash is of the server certificate's subjectPublicKeyInfo.\n2. The hash is of a subjectPublicKeyInfo that appears in a CA certificate in the certificate chain, that CA certificate is constrained via the X.509v3 nameConstraints extension, one or more directoryName nameConstraints are present in the permittedSubtrees, and the directoryName contains an organizationName attribute.\n3. The hash is of a subjectPublicKeyInfo that appears in a CA certificate in the certificate chain, the CA certificate has one or more organizationName attributes in the certificate Subject, and the server's certificate contains the same number of organizationName attributes, in the same order, and with byte-for-byte identical values.\n\nA subjectPublicKeyInfo hash is specified by concatenating the hash algorithm name, the \"/\" character, and the Base64 encoding of that hash algorithm applied to the DER-encoded subjectPublicKeyInfo of the specified certificate. This Base64 encoding is the same format as an SPKI Fingerprint, as defined in RFC 7469, Section 2.4. Unrecognized hash algorithms are ignored. The only supported hash algorithm at this time is \"sha256\".\n\nIf you disable this policy or don't configure it, any certificate that's required to be disclosed via Certificate Transparency will be treated as untrusted if it's not disclosed according to the Certificate Transparency policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "CertificateTransparencyEnforcementDisabledForCas"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#certificatetransparencyenforcementdisabledforcas"
                }
            ]
        },
        "CertificateTransparencyEnforcementDisabledForLegacyCas": {
            "title": "CertificateTransparencyEnforcementDisabledForLegacyCas - Disable Certificate Transparency enforcement for a list of legacy certificate authorities",
            "description": "Disables enforcing Certificate Transparency requirements for a list of legacy certificate authorities (Cas).\n\nThis policy lets you disable Certificate Transparency disclosure requirements for certificate chains that contain certificates with one of the specified subjectPublicKeyInfo hashes. This allows certificates that would otherwise be untrusted because they were not properly publicly disclosed, continue to be used for enterprise hosts.\n\nIn order for Certificate Transparency enforcement to be disabled, you must set the hash to a subjectPublicKeyInfo appearing in a CA certificate that is recognized as a legacy certificate authority (CA). A legacy CA is a CA that has been publicly trusted by default by one or more operating systems supported by Microsoft Edge.\n\nYou specify a subjectPublicKeyInfo hash by concatenating the hash algorithm name, the \"/\" character, and the Base64 encoding of that hash algorithm applied to the DER-encoded subjectPublicKeyInfo of the specified certificate. This Base64 encoding is the same format as an SPKI Fingerprint, as defined in RFC 7469, Section 2.4. Unrecognized hash algorithms are ignored. The only supported hash algorithm at this time is \"sha256\".\n\nIf you don't configure this policy, any certificate that's required to be disclosed via Certificate Transparency will be treated as untrusted if it isn't disclosed according to the Certificate Transparency policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "CertificateTransparencyEnforcementDisabledForLegacyCas"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#certificatetransparencyenforcementdisabledforlegacycas"
                }
            ]
        },
        "CertificateTransparencyEnforcementDisabledForUrls": {
            "title": "CertificateTransparencyEnforcementDisabledForUrls - Disable Certificate Transparency enforcement for specific URLs",
            "description": "Disables enforcing Certificate Transparency requirements for the listed URLs.\n\nThis policy lets you not disclose certificates for the hostnames in the specified URLs via Certificate Transparency. This lets you use certificates that would otherwise be untrusted, because they weren't properly publicly disclosed, but it makes it harder to detect mis-issued certificates for those hosts.\n\nForm your URL pattern according to https://go.microsoft.com/fwlink/?linkid=2095322. Because certificates are valid for a given hostname, independent of the scheme, port, or path, only the hostname part of the URL is considered. Wildcard hosts are not supported.\n\nIf you don't configure this policy, any certificate that should be disclosed via Certificate Transparency is treated as untrusted if it's not disclosed.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "CertificateTransparencyEnforcementDisabledForUrls"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#certificatetransparencyenforcementdisabledforurls"
                }
            ]
        },
        "ClearBrowsingDataOnExit": {
            "title": "ClearBrowsingDataOnExit - Clear browsing data when Microsoft Edge closes",
            "description": "Microsoft Edge doesn't clear the browsing data by default when it closes. Browsing data includes information entered in forms, passwords, and even the websites visited.\n\nIf you enable this policy, all browsing data is deleted each time Microsoft Edge closes. Note that if you enable this policy, it takes precedence over how you configured \"DefaultCookiesSetting\"\n\nIf you disable or don't configure this policy, users can configure the Clear browsing data option in Settings.\n\nIf you enable this policy, don't configure the \"AllowDeletingBrowserHistory\" or the \"ClearCachedImagesAndFilesOnExit\" policy, because they all deal with deleting browsing data. If you configure the preceding policies and this policy, all browsing data is deleted when Microsoft Edge closes, regardless of how you configured \"AllowDeletingBrowserHistory\" or \"ClearCachedImagesAndFilesOnExit\".\n\nTo exclude cookies from being deleted on exit, configure the \"SaveCookiesOnExit\" policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ClearBrowsingDataOnExit"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#clearbrowsingdataonexit"
                }
            ]
        },
        "ClearCachedImagesAndFilesOnExit": {
            "title": "ClearCachedImagesAndFilesOnExit - Clear cached images and files when Microsoft Edge closes",
            "description": "Microsoft Edge doesn't clear cached images and files by default when it closes.\n\nIf you enable this policy, cached images and files will be deleted each time Microsoft Edge closes.\n\nIf you disable this policy, users cannot configure the cached images and files option in edge://settings/clearBrowsingDataOnClose.\n\nIf you don't configure this policy, users can choose whether cached images and files are cleared on exit.\n\nIf you disable this policy, don't enable the \"ClearBrowsingDataOnExit\" policy, because they both deal with deleting data. If you configure both, the \"ClearBrowsingDataOnExit\" policy takes precedence and deletes all data when Microsoft Edge closes, regardless of how you configured \"ClearCachedImagesAndFilesOnExit\".",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ClearCachedImagesAndFilesOnExit"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#clearcachedimagesandfilesonexit"
                }
            ]
        },
        "CollectionsServicesAndExportsBlockList": {
            "title": "CollectionsServicesAndExportsBlockList - Block access to a specified list of services and export targets in Collections",
            "description": "List specific services and export targets that users can't access in the Collections feature in Microsoft Edge. This includes displaying additional data from Bing and exporting collections to Microsoft products or external partners.\n\nIf you enable this policy, services and export targets that match the given list are blocked.\n\nIf you don't configure this policy, no restrictions on the acceptable services and export targets are enforced.\n\nPolicy options mapping:\n\n* pinterest_suggestions (pinterest_suggestions) = Pinterest suggestions\n\n* collections_share (collections_share) = Sharing of Collections\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "CollectionsServicesAndExportsBlockList"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#collectionsservicesandexportsblocklist"
                }
            ]
        },
        "CommandLineFlagSecurityWarningsEnabled": {
            "title": "CommandLineFlagSecurityWarningsEnabled - Enable security warnings for command-line flags",
            "description": "If disabled, this policy prevents security warnings from appearing when Microsoft Edge is launched with potentially dangerous command-line flags.\n\nIf enabled or unset, security warnings are displayed when these command-line flags are used to launch Microsoft Edge.\n\nFor example, the --disable-gpu-sandbox flag generates this warning:  You're using an unsupported command-line flag: --disable-gpu-sandbox. This poses stability and security risks.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "CommandLineFlagSecurityWarningsEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#commandlineflagsecuritywarningsenabled"
                }
            ]
        },
        "ComponentUpdatesEnabled": {
            "title": "ComponentUpdatesEnabled - Enable component updates in Microsoft Edge",
            "description": "If you enable or don't configure this policy, component updates are enabled in Microsoft Edge.\n\nIf you disable this policy or set it to false, component updates are disabled for all components in Microsoft Edge.\n\nHowever, some components are exempt from this policy. This includes any component that doesn't contain executable code, that doesn't significantly alter the behavior of the browser, or that's critical for security. That is, updates that are deemed \"critical for security\" are still applied even if you disable this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ComponentUpdatesEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#componentupdatesenabled"
                }
            ]
        },
        "ConfigureDoNotTrack": {
            "title": "ConfigureDoNotTrack - Configure Do Not Track",
            "description": "Specify whether to send Do Not Track requests to websites that ask for tracking info. Do Not Track requests let the websites you visit know that you don't want your browsing activity to be tracked. By default, Microsoft Edge doesn't send Do Not Track requests, but users can turn on this feature to send them.\n\nIf you enable this policy, Do Not Track requests are always sent to websites asking for tracking info.\n\nIf you disable this policy, requests are never sent.\n\nIf you don't configure this policy, users can choose whether to send these requests.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ConfigureDoNotTrack"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#configuredonottrack"
                }
            ]
        },
        "ConfigureFriendlyURLFormat": {
            "title": "ConfigureFriendlyURLFormat - Configure the default paste format of URLs copied from Microsoft Edge, and determine if additional formats will be available to users",
            "description": "If FriendlyURLs are enabled, Microsoft Edge will compute additional representations of the URL and place them on the clipboard.\n\nThis policy configures what format will be pasted when the user pastes in external applications, or inside Microsoft Edge without the 'Paste as' context menu item.\n\nIf configured, this policy makes a choice on behalf of the user. The options in edge://settings/shareCopyPaste will be grayed out, and the options in the 'Paste As' context menu will not be available.\n\n* Not configured = The user will be able to choose their preferred paste format. By default, this is set to the friendly URL format. The 'Paste As' menu will be available in Microsoft Edge.\n\n* 1 = No additional formats will be stored on the clipboard. There will be no 'Paste as' context menu item in Microsoft Edge and the only format available to paste will be the plain text URL format. Effectively, the friendly URL feature will be disabled.\n\n* 3 = The user will get a friendly URL whenever they paste into surfaces that accept rich text. The plain URL will still be available for non-rich surfaces. There will be no 'Paste As' menu in Microsoft Edge.\n\n* 4 = (Not currently used)\n\nThe richer formats may not be well-supported in some paste destinations and/or websites. As such, if this policy is to be configured, then the plain URL option is recommended.\n\nPolicy options mapping:\n\n* PlainText (1) = The plain URL without any extra information, such as the page's title. This is the recommended option when this policy is configured. For more information, see the description.\n\n* TitledHyperlink (3) = Titled Hyperlink: A hyperlink that points to the copied URL, but whose visible text is the title of the destination page. This is the Friendly URL format.\n\n* WebPreview (4) = Coming soon. If set, behaves the same as 'Plain URL'.\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "PlainText - The plain URL without any extra information, such as the page's title. This is the recommended option when this policy is configured. For more information, see the description.",
                            "TitledHyperlink - Titled Hyperlink: A hyperlink that points to the copied URL, but whose visible text is the title of the destination page. This is the Friendly URL format.",
                            "WebPreview - Coming soon. If set, behaves the same as 'Plain URL'."
                        ]
                    },
                    "enum": [
                        1,
                        3,
                        4
                    ]
                }
            ],
            "options": {
                "infoText": "ConfigureFriendlyURLFormat"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#configurefriendlyurlformat"
                }
            ]
        },
        "ConfigureOnlineTextToSpeech": {
            "title": "ConfigureOnlineTextToSpeech - Configure Online Text To Speech",
            "description": "Set whether the browser can leverage Online Text to Speech voice fonts, part of Azure Cognitive Services. These voice fonts are higher quality than the pre-installed system voice fonts.\n\nIf you enable or don't configure this policy, web-based applications that use the SpeechSynthesis API can use Online Text to Speech voice fonts.\n\nIf you disable this policy, the voice fonts aren't available.\n\nRead more about this feature here:\nSpeechSynthesis API: https://go.microsoft.com/fwlink/?linkid=2110038\nCognitive Services: https://go.microsoft.com/fwlink/?linkid=2110141",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ConfigureOnlineTextToSpeech"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#configureonlinetexttospeech"
                }
            ]
        },
        "ConfigureShare": {
            "title": "Configure the Share experience",
            "description": "(ConfigureShare)-If you set this policy to 'ShareAllowed' (the default), users will be able to access the Share experience from the Settings and More Menu in Microsoft Edge to share with other apps on the system",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#configureshare"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "Allow Share Experience",
                            "Disallow Share Experience"
                        ]
                    },
                    "enum": [
                        0,
                        1
                    ]
                }
            ]
        },
        "CrossOriginWebAssemblyModuleSharingEnabled": {
            "title": "Allow cross-origin Web Assembly Modules",
            "description": "(CrossOriginWebAssemblyModuleSharingEnabled)-Specifies whether WebAssembly modules can be sent to another window or worker cross-origin",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#crossoriginwebassemblymodulesharingenabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "CustomHelpLink": {
            "title": "CustomHelpLink - Specify custom help link",
            "description": "Specify a link for the Help menu or the F1 key.\n\nIf you enable this policy, an admin can specify a link for the Help menu or the F1 key.\n\nIf you disable or don't configure this policy, the default link for the Help menu or the F1 key is used.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "CustomHelpLink"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#customhelplink"
                }
            ]
        },
        "DNSInterceptionChecksEnabled": {
            "title": "DNSInterceptionChecksEnabled - DNS interception checks enabled",
            "description": "This policy configures a local switch that can be used to disable DNS interception checks. These checks attempt to discover whether the browser is behind a proxy that redirects unknown host names.\n\nThis detection might not be necessary in an enterprise environment where the network configuration is known. It can be disabled to avoid additional DNS and HTTP traffic on start-up and each DNS configuration change.\n\nIf you enable or don't set this policy, the DNS interception checks are performed.\n\nIf you disable this policy, DNS interception checks aren't performed.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "DNSInterceptionChecksEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#dnsinterceptionchecksenabled"
                }
            ]
        },
        "DefaultBrowserSettingEnabled": {
            "title": "DefaultBrowserSettingEnabled - Set Microsoft Edge as default browser",
            "description": "If you set this policy to True, Microsoft Edge always checks whether it's the default browser on startup and, if possible, automatically registers itself.\n\nIf you set this policy to False, Microsoft Edge is stopped from ever checking if it's the default and turns user controls off for this option.\n\nIf you don't set this policy, Microsoft Edge lets users control whether it's the default and, if not, whether user notifications should appear.\n\nNote for Windows administrators: This policy only works for PCs running Windows 7. For later versions of Windows, you have to deploy a \"default application associations\" file that makes Microsoft Edge the handler for the https and http protocols (and, optionally, the ftp protocol and file formats such as .html, .htm, .pdf, .svg, .webp). See https://go.microsoft.com/fwlink/?linkid=2094932 for more information.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "DefaultBrowserSettingEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultbrowsersettingenabled"
                }
            ]
        },
        "DefaultSearchProviderContextMenuAccessAllowed": {
            "title": "DefaultSearchProviderContextMenuAccessAllowed - Allow default search provider context menu search access",
            "description": "Enables the use of a default search provider on the context menu.\n\nIf you set this policy to disabled the search context menu item that relies on your default search provider and sidebar search will not be available.\n\nIf this policy is set to enabled or not set, the context menu item for your default search provider and sidebar search will be available.\n\nThe policy value is only appled when the \"DefaultSearchProviderEnabled\" policy is enabled, and is not applicable otherwise.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "DefaultSearchProviderContextMenuAccessAllowed"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultsearchprovidercontextmenuaccessallowed"
                }
            ]
        },
        "DefaultSensorsSetting": {
            "title": "DefaultSensorsSetting - Default sensors setting",
            "description": "Set whether websites can access and use sensors such as motion and light sensors. You can completely block or allow websites to get access to sensors.\n\nSetting the policy to 1 lets websites access and use sensors. Setting the policy to 2 denies acess to sensors.\n\nYou can override this policy for specific URL patterns by using the \"SensorsAllowedForUrls\" and \"SensorsBlockedForUrls\" policies.\n\nIf you don't configure this policy, websites can access and use sensors, and users can change this setting. This is the global default for \"SensorsAllowedForUrls\" and \"SensorsBlockedForUrls\".\n\nPolicy options mapping:\n\n* AllowSensors (1) = Allow sites to access sensors\n\n* BlockSensors (2) = Do not allow any site to access sensors\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "AllowSensors - Allow sites to access sensors",
                            "BlockSensors - Do not allow any site to access sensors"
                        ]
                    },
                    "enum": [
                        1,
                        2
                    ]
                }
            ],
            "options": {
                "infoText": "DefaultSensorsSetting"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultsensorssetting"
                }
            ]
        },
        "DefaultSerialGuardSetting": {
            "title": "DefaultSerialGuardSetting - Control use of the Serial API",
            "description": "Set whether websites can access serial ports. You can completely block access or ask the user each time a website wants to get access to a serial port.\n\nSetting the policy to 3 lets websites ask for access to serial ports. Setting the policy to 2 denies access to serial ports.\n\nYou can override this policy for specific URL patterns by using the \"SerialAskForUrls\" and \"SerialBlockedForUrls\" policies.\n\nIf you don't configure this policy, by default, websites can ask users whether they can access a serial port, and users can change this setting.\n\nPolicy options mapping:\n\n* BlockSerial (2) = Do not allow any site to request access to serial ports via the Serial API\n\n* AskSerial (3) = Allow sites to ask for user permission to access a serial port\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "BlockSerial - Do not allow any site to request access to serial ports via the Serial API",
                            "AskSerial - Allow sites to ask for user permission to access a serial port"
                        ]
                    },
                    "enum": [
                        2,
                        3
                    ]
                }
            ],
            "options": {
                "infoText": "DefaultSerialGuardSetting"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultserialguardsetting"
                }
            ]
        },
        "DefinePreferredLanguages": {
            "title": "Ordered List of Preferred Languages",
            "description": "(DefinePreferredLanguages)-Configures the language variants that Microsoft Edge sends to websites as part of the Accept-Language request HTTP header and prevents users from adding, removing, or changing the order of preferred languages in Microsoft Edge settings",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#definepreferredlanguages"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "en-US,fr,es"
                        }
                    }
                }
            ]
        },
        "DeveloperToolsAvailability": {
            "title": "DeveloperToolsAvailability - Control where developer tools can be used",
            "description": "Control where developer tools can be used.\n\nIf you set this policy to 'DeveloperToolsDisallowedForForceInstalledExtensions' (the default), users can access the developer tools and the JavaScript console in general, but not in the context of extensions installed by enterprise policy.\n\nIf you set this policy to 'DeveloperToolsAllowed', users can access the developer tools and the JavaScript console in all contexts, including extensions installed by enterprise policy.\n\nIf you set this policy to 'DeveloperToolsDisallowed', users can't access the developer tools or inspect website elements. Keyboard shortcuts and menu or context menu entries that open the developer tools or the JavaScript Console are disabled.\n\nPolicy options mapping:\n\n* DeveloperToolsDisallowedForForceInstalledExtensions (0) = Block the developer tools on extensions installed by enterprise policy, allow in other contexts\n\n* DeveloperToolsAllowed (1) = Allow using the developer tools\n\n* DeveloperToolsDisallowed (2) = Don't allow using the developer tools\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "DeveloperToolsDisallowedForForceInstalledExtensions - Block the developer tools on extensions installed by enterprise policy, allow in other contexts",
                            "DeveloperToolsAllowed - Allow using the developer tools",
                            "DeveloperToolsDisallowed - Don't allow using the developer tools"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2
                    ]
                }
            ],
            "options": {
                "infoText": "DeveloperToolsAvailability"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#developertoolsavailability"
                }
            ]
        },
        "DiagnosticData": {
            "title": "DiagnosticData - Send required and optional diagnostic data about browser usage",
            "description": "This policy controls sending required and optional diagnostic data about browser usage to Microsoft.\n\nRequired diagnostic data is collected keep Microsoft Edge secure, up to date and performing as expected.\n\nOptional diagnostic data includes data about how you use the browser, websites you visit and crash reports to Microsoft for product and service improvement.\n\nThis policy is not supported on Windows 10 devices. To control this data collection on Windows 10, IT admins must use the Windows diagnostic data group policy. This policy will either be 'Allow Telemetry' or 'Allow Diagnostic Data', depending on the version of Windows. Learn more about Windows 10 diagnostic data collection: https://go.microsoft.com/fwlink/?linkid=2099569\n\nUse one of the following settings to configure this policy:\n\n'Off' turns off required and optional diagnostic data collection. This option is not recommended.\n\n'RequiredData' sends required diagnostic data but turns off optional diagnostic data collection. Microsoft Edge will send required diagnostic data to keep Microsoft Edge secure, up to date and performing as expected.\n\n'OptionalData' sends optional diagnostic data includes data about browser usage, websites that are visited, crash reports sent to Microsoft for product and service improvement.\n\nOn Windows 7/macOS, this policy controls sending required and optional data to Microsoft.\n\nIf you don't configure this policy or disable it, Microsoft Edge will default to the user's preference.\n\nPolicy options mapping:\n\n* Off (0) = Off (Not recommended)\n\n* RequiredData (1) = Required data\n\n* OptionalData (2) = Optional data\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "Off - Off (Not recommended)",
                            "RequiredData - Required data",
                            "OptionalData - Optional data"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2
                    ]
                }
            ],
            "options": {
                "infoText": "DiagnosticData"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#diagnosticdata"
                }
            ]
        },
        "Disable3DAPIs": {
            "title": "Disable3DAPIs - Disable support for 3D graphics APIs",
            "description": "Prevent web pages from accessing the graphics processing unit (GPU). Specifically, web pages can't access the WebGL API and plug-ins can't use the Pepper 3D API.\n\nIf you don't configure or disable this policy, it potentially allows web pages to use the WebGL API and plug-ins to use the Pepper 3D API. Microsoft Edge might, by default, still require command line arguments to be passed in order to use these APIs.\n\nIf \"HardwareAccelerationModeEnabled\" policy is set to false, the setting for 'Disable3DAPIs' policy is ignored - it's the equivalent of setting 'Disable3DAPIs' policy to true.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "Disable3DAPIs"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#disable3dapis"
                }
            ]
        },
        "DisableScreenshots": {
            "title": "DisableScreenshots - Disable taking screenshots",
            "description": "Controls if users can take screenshots of the browser page.\n\nIf enabled, user can't take screenshots by using keyboard shortcuts or extension APIs.\n\nIf disabled or don't configure this policy, users can take screenshots.\n\nPlease note this policy controls screenshots taken from within the browser itself. Even if you enable this policy, users might still be able to take screenshots using some method outside of the browser (like using an operating system feature or another application).",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "DisableScreenshots"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#disablescreenshots"
                }
            ]
        },
        "DiskCacheDir": {
            "title": "DiskCacheDir - Set disk cache directory",
            "description": "Configures the directory to use to store cached files.\n\nIf you enable this policy, Microsoft Edge uses the provided directory regardless of whether the user has specified the '--disk-cache-dir' flag. To avoid data loss or other unexpected errors, don't configure this policy to a volume's root directory or to a directory used for other purposes, because Microsoft Edge manages its contents.\n\nSee https://go.microsoft.com/fwlink/?linkid=2095041 for a list of variables you can use when specifying directories and paths.\n\nIf you don't configure this policy, the default cache directory is used, and users can override that default with the '--disk-cache-dir' command line flag.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "DiskCacheDir"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#diskcachedir"
                }
            ]
        },
        "DiskCacheSize": {
            "title": "DiskCacheSize - Set disk cache size, in bytes",
            "description": "Configures the size of the cache, in bytes, used to store files on the disk.\n\nIf you enable this policy, Microsoft Edge uses the provided cache size regardless of whether the user has specified the '--disk-cache-size' flag. The value specified in this policy isn't a hard boundary but rather a suggestion to the caching system; any value below a few megabytes is too small and will be rounded up to a reasonable minimum.\n\nIf you set the value of this policy to 0, the default cache size is used, and users can't change it.\n\nIf you don't configure this policy, the default size is used, but users can override it with the '--disk-cache-size' flag.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ],
            "options": {
                "infoText": "DiskCacheSize"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#diskcachesize"
                }
            ]
        },
        "DisplayCapturePermissionsPolicyEnabled": {
            "title": "Specifies whether the display-capture permissions-policy is checked or skipped",
            "description": "(DisplayCapturePermissionsPolicyEnabled)-The display-capture permissions-policy gates access to getDisplayMedia(), as per this spec: https://www.w3.org/TR/screen-capture/#feature-policy-integration However, if this policy is Disabled, this requirement is not enforced, and getDisplayMedia() is allowed from contexts that would otherwise be forbidden",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#displaycapturepermissionspolicyenabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "DnsOverHttpsMode": {
            "title": "DnsOverHttpsMode - Control the mode of DNS-over-HTTPS",
            "description": "Control the mode of the DNS-over-HTTPS resolver. Note that this policy will only set the default mode for each query. The mode can be overridden for special types of queries such as requests to resolve a DNS-over-HTTPS server hostname.\n\nThe \"off\" mode will disable DNS-over-HTTPS.\n\nThe \"automatic\" mode will send DNS-over-HTTPS queries first if a DNS-over-HTTPS server is available and may fallback to sending insecure queries on error.\n\nThe \"secure\" mode will only send DNS-over-HTTPS queries and will fail to resolve on error.\n\nIf you don't configure this policy, the browser might send DNS-over-HTTPS requests to a resolver associated with the user's configured system resolver.\n\nPolicy options mapping:\n\n* off (off) = Disable DNS-over-HTTPS\n\n* automatic (automatic) = Enable DNS-over-HTTPS with insecure fallback\n\n* secure (secure) = Enable DNS-over-HTTPS without insecure fallback\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "enum_titles": [
                            "automatic - Enable DNS-over-HTTPS with insecure fallback",
                            "off - Disable DNS-over-HTTPS",
                            "secure - Enable DNS-over-HTTPS without insecure fallback"
                        ]
                    },
                    "enum": [
                        "automatic",
                        "off",
                        "secure"
                    ]
                }
            ],
            "options": {
                "infoText": "DnsOverHttpsMode"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#dnsoverhttpsmode"
                }
            ]
        },
        "DnsOverHttpsTemplates": {
            "title": "DnsOverHttpsTemplates - Specify URI template of desired DNS-over-HTTPS resolver",
            "description": "The URI template of the desired DNS-over-HTTPS resolver. To specify multiple DNS-over-HTTPS resolvers, separate the corresponding URI templates with spaces.\n\nIf you set \"DnsOverHttpsMode\" to \"secure\" then this policy must be set and cannot be empty.\n\nIf you set \"DnsOverHttpsMode\" to \"automatic\" and this policy is set then the URI templates specified will be used. If you don't set this policy, then hardcoded mappings will be used to attempt to upgrade the user's current DNS resolver to a DoH resolver operated by the same provider.\n\nIf the URI template contains a dns variable, requests to the resolver will use GET; otherwise requests will use POST.\n\nIncorrectly formatted templates will be ignored.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "DnsOverHttpsTemplates"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#dnsoverhttpstemplates"
                }
            ]
        },
        "DownloadDirectory": {
            "title": "DownloadDirectory - Set download directory",
            "description": "Configures the directory to use when downloading files.\n\nIf you enable this policy, Microsoft Edge uses the provided directory regardless of whether the user has specified one or chosen to be prompted for download location every time. See https://go.microsoft.com/fwlink/?linkid=2095041 for a list of variables that can be used.\n\nIf you disable or don't configure this policy, the default download directory is used, and the user can change it.\n\nIf you set an invalid path, Microsoft Edge will default to the user's default download directory.\n\nIf the folder specified by the path doesn't exist, the download will trigger a prompt that asks the user where they want to save their download.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "DownloadDirectory"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#downloaddirectory"
                }
            ]
        },
        "DownloadRestrictions": {
            "title": "DownloadRestrictions - Allow download restrictions",
            "description": "Configures the type of downloads that Microsoft Edge completely blocks, without letting users override the security decision.\n\nSet 'BlockDangerousDownloads' to allow all downloads except for those that carry Microsoft Defender SmartScreen warnings.\n\nSet 'BlockPotentiallyDangerousDownloads' to allow all downloads except for those that carry Microsoft Defender SmartScreen warnings of potentially dangerous or unwanted downloads.\n\nSet 'BlockAllDownloads' to block all downloads.\n\nIf you don't configure this policy or set the 'DefaultDownloadSecurity' option, the downloads go through the usual security restrictions based on Microsoft Defender SmartScreen analysis results.\n\nNote that these restrictions apply to downloads from web page content, as well as the 'download link...' context menu option. These restrictions don't apply to saving or downloading the currently displayed page, nor do they apply to the Save as PDF option from the printing options.\n\nSee https://go.microsoft.com/fwlink/?linkid=2094934 for more info on Microsoft Defender SmartScreen.\n\nPolicy options mapping:\n\n* DefaultDownloadSecurity (0) = No special restrictions\n\n* BlockDangerousDownloads (1) = Block dangerous downloads\n\n* BlockPotentiallyDangerousDownloads (2) = Block potentially dangerous or unwanted downloads\n\n* BlockAllDownloads (3) = Block all downloads\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "DefaultDownloadSecurity - No special restrictions",
                            "BlockDangerousDownloads - Block dangerous downloads",
                            "BlockPotentiallyDangerousDownloads - Block potentially dangerous or unwanted downloads",
                            "BlockAllDownloads - Block all downloads"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2,
                        3
                    ]
                }
            ],
            "options": {
                "infoText": "DownloadRestrictions"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#downloadrestrictions"
                }
            ]
        },
        "EdgeCollectionsEnabled": {
            "title": "EdgeCollectionsEnabled - Enable the Collections feature",
            "description": "Lets you allow users to access the Collections feature, where they can collect, organize, share, and export content more efficiently and with Office integration.\n\nIf you enable or don't configure this policy, users can access and use the Collections feature in Microsoft Edge.\n\nIf you disable this policy, users can't access and use Collections in Microsoft Edge.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "EdgeCollectionsEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#edgecollectionsenabled"
                }
            ]
        },
        "EdgeDiscoverEnabled": {
            "title": "Discover feature In Microsoft Edge",
            "description": "(EdgeDiscoverEnabled)-This policy lets you configure the Discover feature in Microsoft Edge",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#edgediscoverenabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "EdgeEnhanceImagesEnabled": {
            "title": "Enable Enhance Images",
            "description": "(EdgeEnhanceImagesEnabled)-Set whether Microsoft Edge can automatically enhance images to show you sharper images with better color, lighting, and contrast",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#edgeenhanceimagesenabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "EdgeFollowEnabled": {
            "title": "Enable Follow service in Microsoft Edge",
            "description": "(EdgeFollowEnabled)-Allows the Microsoft Edge browser to enable Follow service and apply it to users",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#edgefollowenabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "EdgeShoppingAssistantEnabled": {
            "title": "EdgeShoppingAssistantEnabled - Shopping in Microsoft Edge Enabled",
            "description": "This policy lets users compare the prices of a product they are looking at, get coupons from the website they're on, or auto-apply coupons during checkout.\n\nIf you enable or don't configure this policy, shopping features such as price comparison and coupons will be automatically applied for retail domains. Coupons for the current retailer and prices from other retailers will be fetched from a server.\n\nIf you disable this policy shopping features such as price comparison and coupons will not be automatically found for retail domains.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "EdgeShoppingAssistantEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#edgeshoppingassistantenabled"
                }
            ]
        },
        "EditFavoritesEnabled": {
            "title": "EditFavoritesEnabled - Allows users to edit favorites",
            "description": "Enable this policy to let users add, remove, and modify favorites. This is the default behavior if you don't configure the policy.\n\nDisable this policy to stop users from adding, removing, or modifying favorites. They can still use existing favorites.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "EditFavoritesEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#editfavoritesenabled"
                }
            ]
        },
        "EnableOnlineRevocationChecks": {
            "title": "EnableOnlineRevocationChecks - Enable online OCSP/CRL checks",
            "description": "Online revocation checks don't provide a significant security benefit and are disabled by default.\n\nIf you enable this policy, Microsoft Edge will perform soft-fail, online OCSP/CRL checks. \"Soft fail\" means that if the revocation server can't be reached, the certificate will be considered valid.\n\nIf you disable the policy or don't configure it, Microsoft Edge won't perform online revocation checks.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "EnableOnlineRevocationChecks"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#enableonlinerevocationchecks"
                }
            ]
        },
        "EnableSha1ForLocalAnchors": {
            "title": "EnableSha1ForLocalAnchors - Allow certificates signed using SHA-1 when issued by local trust anchors",
            "description": "When this setting is enabled, Microsoft Edge allows connections secured by SHA-1 signed certificates so long as the the certificate chains to a locally-installed root certificate and is otherwise valid.\n\nNote that this policy depends on the operating system (OS) certificate verification stack allowing SHA-1 signatures. If an OS update changes the OS handling of SHA-1 certificates, this policy might no longer have effect.  Further, this policy is intended as a temporary workaround to give enterprises more time to move away from SHA-1. This policy will be removed in Microsoft Edge 92 releasing in mid 2021.\n\nIf you don't set this policy or set it to false, or the SHA-1 certificate chains to a publicly trusted certificate root, then Microsoft Edge won't allow certificates signed by SHA-1.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "EnableSha1ForLocalAnchors"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#enablesha1forlocalanchors"
                }
            ]
        },
        "EnterpriseHardwarePlatformAPIEnabled": {
            "title": "EnterpriseHardwarePlatformAPIEnabled - Allow managed extensions to use the Enterprise Hardware Platform API",
            "description": "When this policy is set to enabled, extensions installed by enterprise policy are allowed to use the Enterprise Hardware Platform API.\nWhen this policy is set to disabled or isn't set, no extensions are allowed to use the Enterprise Hardware Platform API.\nThis policy also applies to component extensions.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "EnterpriseHardwarePlatformAPIEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#enterprisehardwareplatformapienabled"
                }
            ]
        },
        "ExemptDomainFileTypePairsFromFileTypeDownloadWarnings": {
            "title": "ExemptDomainFileTypePairsFromFileTypeDownloadWarnings - Disable download file type extension-based warnings for specified file types on domains",
            "description": "You can enable this policy to create a dictionary of file type extensions with a corresponding list of domains that will be exempted from file type extension-based download warnings. This lets enterprise administrators block file type extension-based download warnings for files that are associated with a listed domain. For example, if  the \"jnlp\" extension is associated with \"website1.com\", users would not see a warning when downloading \"jnlp\" files from \"website1.com\", but see a download warning when downloading \"jnlp\" files from \"website2.com\".\n\nFiles with file type extensions specified for domains identified by this policy will still be subject to non-file type extension-based security warnings such as mixed-content download warnings and Microsoft Defender SmartScreen warnings.\n\nIf you disable this policy or don't configure it, file types that trigger extension-based download warnings will show warnings to the user.\n\nIf you enable this policy:\n\n* The URL pattern should be formatted according to https://go.microsoft.com/fwlink/?linkid=2095322.\n* The file type extension entered must be in lower-cased ASCII. The leading separator should not be included when listing the file type extension, so list \"jnlp\" should be used instead of \".jnlp\".\n\nExample:\n\nThe following example value would prevent file type extension-based download warnings on swf, exe, and jnlp extensions for *.contoso.com domains. It will show the user a file type extension-based download warning on any other domain for exe and jnlp files, but not for swf files.\n\n[\n  { \"file_extension\": \"jnlp\", \"domains\": [\"contoso.com\"] },\n  { \"file_extension\": \"exe\", \"domains\": [\"contoso.com\"] },\n  { \"file_extension\": \"swf\", \"domains\": [\"*\"] }\n]\n\nNote that while the preceding example shows the suppression of file type extension-based download warnings for \"swf\" files for all domains, applying suppression of such warnings for all domains for any dangerous file type extension is not recommended due to security concerns. It is shown in the example merely to demonstrate the ability to do so.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "ExemptDomainFileTypePairsFromFileTypeDownloadWarnings"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#exemptdomainfiletypepairsfromfiletypedownloadwarnings"
                }
            ]
        },
        "ExperimentationAndConfigurationServiceControl": {
            "title": "ExperimentationAndConfigurationServiceControl - Control communication with the Experimentation and Configuration Service",
            "description": "In Microsoft Edge, the Experimentation and Configuration Service is used to deploy Experimentation and Configuration payload.\n\nExperimentation payload consists of a list of early in development features that Microsoft is enabling for testing and feedback.\n\nConfiguration payload consists of a list of settings that Microsoft wants to deploy to Microsoft Edge to optimize user experience. For example, configuration payload may specify how often Microsoft Edge sends requests to the Experimentation and Configuration Service to retrieve the newest payload.\n\nAdditionaly, configuration payload may also contain a list of actions to take on certain domains for compatibility reasons. For example, the browser may override the User Agent string on a website if that website is broken due to the new User Agent string on Microsoft Edge. Each of these actions is intended to be temporary while Microsoft tries to resolve the issue with the site owner.\n\nIf you set this policy to 'FullMode', the full payload is downloaded from the Experimentation and Configuration Service. This includes both the experimentation and configuration payloads.\n\nIf you set this policy to 'ConfigurationsOnlyMode', only the configuration payload is delivered.\n\nIf you set this policy to 'RestrictedMode', the communication with the Experimentation and Configuration Service is stopped completely.\n\nIf you don't configure this policy, on a managed device on Stable and Beta channels the behavior is the same as the 'ConfigurationsOnlyMode'.\n\nIf you don't configure this policy, on an unmanaged device the behavior is the same as the 'FullMode'.\n\nPolicy options mapping:\n\n* FullMode (2) = Retrieve configurations and experiments\n\n* ConfigurationsOnlyMode (1) = Retrieve configurations only\n\n* RestrictedMode (0) = Disable communication with the Experimentation and Configuration Service\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "RestrictedMode - Disable communication with the Experimentation and Configuration Service",
                            "ConfigurationsOnlyMode - Retrieve configurations only",
                            "FullMode - Retrieve configurations and experiments"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2
                    ]
                }
            ],
            "options": {
                "infoText": "ExperimentationAndConfigurationServiceControl"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#experimentationandconfigurationservicecontrol"
                }
            ]
        },
        "ExplicitlyAllowedNetworkPorts": {
            "title": "Explicitly allowed network ports",
            "description": "(ExplicitlyAllowedNetworkPorts)-This policy allows bypassing the restricted port list built into Microsoft Edge. The set of ports is defined as a comma-separated list that outgoing connections should be permitted on",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#explicitlyallowednetworkports"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Port"
                    }
                }
            ]
        },
        "ExternalProtocolDialogShowAlwaysOpenCheckbox": {
            "title": "ExternalProtocolDialogShowAlwaysOpenCheckbox - Show an \"Always open\" checkbox in external protocol dialog",
            "description": "This policy controls whether the \"Always allow this site to open links of this type\" checkbox is shown on external protocol launch confirmation prompts. This policy only applies to https:// links.\n\nIf you enable this policy, when an external protocol confirmation prompt is shown, the user can select \"Always allow\" to skip all future confirmation prompts for the protocol on this site.\n\nIf you disable this policy, the \"Always allow\" checkbox isn't displayed. The user will be prompted for confirmation every time an external protocol is invoked.\n\nPrior to Microsoft Edge 83, if you don't configure this policy, the \"Always allow\" checkbox isn't displayed. The user will be prompted for confirmation every time an external protocol is invoked.\n\nOn Microsoft Edge 83, if you don't configure this policy, the checkbox visibility is controlled by the \"Enable remembering protocol launch prompting preferences\" flag in edge://flags\n\nAs of Microsoft Edge 84, if you don't configure this policy, when an external protocol confirmation prompt is shown, the user can select \"Always allow\" to skip all future confirmation prompts for the protocol on this site.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ExternalProtocolDialogShowAlwaysOpenCheckbox"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#externalprotocoldialogshowalwaysopencheckbox"
                }
            ]
        },
        "FamilySafetySettingsEnabled": {
            "title": "FamilySafetySettingsEnabled - Allow users to configure Family safety",
            "description": "This policy disables and completely hides the Family safety page in Settings. Navigation to edge://settings/familysafety will also be blocked. The Family safety page describes what features are available for family groups and how to join a family group. Learn more about family safety here: (https://go.microsoft.com/fwlink/?linkid=2098432).\n\nIf you enable this policy or don't configure it, the Family safety page will be shown.\n\nIf you disable this policy, the Family safety page will not be shown.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "FamilySafetySettingsEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#familysafetysettingsenabled"
                }
            ]
        },
        "FetchKeepaliveDurationSecondsOnShutdown": {
            "title": "Fetch keepalive duration on shutdown",
            "description": "(FetchKeepaliveDurationSecondsOnShutdown)-Controls the duration (in seconds) that keepalive requests are allowed to prevent the browser from completing its shutdown",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#fetchkeepalivedurationsecondsonshutdown"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ]
        },
        "ForceBingSafeSearch": {
            "title": "ForceBingSafeSearch - Enforce Bing SafeSearch",
            "description": "Ensure that queries in Bing web search are done with SafeSearch set to the value specified. Users can't change this setting.\n\nIf you configure this policy to 'BingSafeSearchNoRestrictionsMode', SafeSearch in Bing search falls back to the bing.com value.\n\nIf you configure this policy to 'BingSafeSearchModerateMode', the moderate setting is used in SafeSearch. The moderate setting filters adult videos and images but not text from search results.\n\nIf you configure this policy to 'BingSafeSearchStrictMode', the strict setting in SafeSearch is used. The strict setting filters adult text, images, and videos.\n\nIf you disable this policy or don't configure it, SafeSearch in Bing search isn't enforced, and users can set the value they want on bing.com.\n\nPolicy options mapping:\n\n* BingSafeSearchNoRestrictionsMode (0) = Don't configure search restrictions in Bing\n\n* BingSafeSearchModerateMode (1) = Configure moderate search restrictions in Bing\n\n* BingSafeSearchStrictMode (2) = Configure strict search restrictions in Bing\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "BingSafeSearchNoRestrictionsMode - Don't configure search restrictions in Bing",
                            "BingSafeSearchModerateMode - Configure moderate search restrictions in Bing",
                            "BingSafeSearchStrictMode - Configure strict search restrictions in Bing"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2
                    ]
                }
            ],
            "options": {
                "infoText": "ForceBingSafeSearch"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#forcebingsafesearch"
                }
            ]
        },
        "ForceCertificatePromptsOnMultipleMatches": {
            "title": "ForceCertificatePromptsOnMultipleMatches - Configure whether Microsoft Edge should automatically select a certificate when there are multiple certificate matches for a site configured with \"AutoSelectCertificateForUrls\"",
            "description": "Toggles whether users are prompted to select a certificate if there are multiple certificates available and a site is configured with \"AutoSelectCertificateForUrls\". If you don't configure \"AutoSelectCertificateForUrls\" for a site, the user will always be prompted to select a certificate.\n\nIf you set this policy to True, Microsoft Edge will prompt a user to select a certificate for sites on the list defined in \"AutoSelectCertificateForUrls\" if and only if there is more than one certificate.\n\nIf you set this policy to False or don't configure it, Microsoft Edge will automatically select a certificate even if there are multiple matches for a certificate. The user will not be prompted to select a certificate for sites on the list defined in \"AutoSelectCertificateForUrls\".",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ForceCertificatePromptsOnMultipleMatches"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#forcecertificatepromptsonmultiplematches"
                }
            ]
        },
        "ForceEphemeralProfiles": {
            "title": "ForceEphemeralProfiles - Enable use of ephemeral profiles",
            "description": "Controls whether user profiles are switched to ephemeral mode. An ephemeral profile is created when a session begins, is deleted when the session ends, and is associated with the user's original profile.\n\nIf you enable this policy, profiles run in ephemeral mode. This lets users work from their own devices without saving browsing data to those devices. If you enable this policy as an OS policy (by using GPO on Windows, for example), it applies to every profile on the system.\n\nIf you disable this policy or don't configure it, users get their regular profiles when they sign in to the browser.\n\nIn ephemeral mode, profile data is saved on disk only for the length of the user session. Features like browser history, extensions and their data, web data like cookies, and web databases aren't saved after the browser is closed. This doesn't prevent a user from manually downloading any data to disk, or from saving pages or printing them. If the user has enabled sync, all data is preserved in their sync accounts just like with regular profiles. Users can also use InPrivate browsing in ephemeral mode unless you explicitly disable this.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ForceEphemeralProfiles"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#forceephemeralprofiles"
                }
            ]
        },
        "ForceGoogleSafeSearch": {
            "title": "ForceGoogleSafeSearch - Enforce Google SafeSearch",
            "description": "Forces queries in Google Web Search to be performed with SafeSearch set to active, and prevents users from changing this setting.\n\nIf you enable this policy, SafeSearch in Google Search is always active.\n\nIf you disable this policy or don't configure it, SafeSearch in Google Search isn't enforced.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ForceGoogleSafeSearch"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#forcegooglesafesearch"
                }
            ]
        },
        "ForceLegacyDefaultReferrerPolicy": {
            "title": "ForceLegacyDefaultReferrerPolicy - Use a default referrer policy of no-referrer-when-downgrade",
            "description": "This policy is deprecated because it's only intended to be a short-term mechanism to give enterprises more time to update their web content if and when it's found to be incompatible with the current default referrer policy. It won't work in Microsoft Edge version 88.\n\nMicrosoft Edge's default referrer policy is being strengthened from its current value of no-referrer-when-downgrade to the more secure strict-origin-when-cross-origin through a gradual rollout.\n\nBefore the rollout, this enterprise policy will have no effect. After the rollout, when this enterprise policy is enabled, Microsoft Edge's default referrer policy will be set to its old value of no-referrer-when-downgrade.\n\nThis enterprise policy is disabled by default.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ForceLegacyDefaultReferrerPolicy"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#forcelegacydefaultreferrerpolicy"
                }
            ]
        },
        "ForceSync": {
            "title": "ForceSync - Force synchronization of browser data and do not show the sync consent prompt",
            "description": "Forces data synchronization in Microsoft Edge. This policy also prevents the user from turning sync off.\n\nIf you don't configure this policy, users will be able to turn sync on or off. If you enable this policy, users will not be able to turn sync off.\n\nFor this policy to work as intended,\n\"BrowserSignin\" policy must not be configured, or must be set to enabled. If \"BrowserSignin\" is set to disabled, then \"ForceSync\" will not take affect.\n\n\"SyncDisabled\" must not be configured or must be set to False. If this is set to True, \"ForceSync\" will not take affect.\n\n0 = Do not automatically start sync and show the sync consent (default)\n1 = Force sync to be turned on for Azure AD/Azure AD-Degraded user profile and do not show the sync consent prompt",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ForceSync"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#forcesync"
                }
            ]
        },
        "ForceSyncTypes": {
            "title": "Configure the list of types that are included for synchronization",
            "description": "(ForceSyncTypes)-If you enable this policy all the specified data types will be included for synchronization for Azure AD/Azure AD-Degraded user profiles",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#forcesynctypes"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "options": {
                            "enum_titles": [
                                "Favorites",
                                "Settings",
                                "Passwords",
                                "Addresses & More",
                                "Extensions",
                                "History",
                                "Open Tabs",
                                "Collections"
                            ]
                        },
                        "enum": [
                            "favorites",
                            "settings",
                            "passwords",
                            "addressesAndMore",
                            "extensions",
                            "history",
                            "openTabs",
                            "collections"
                        ]
                    }
                }
            ]
        },
        "ForceYouTubeRestrict": {
            "title": "ForceYouTubeRestrict - Force minimum YouTube Restricted Mode",
            "description": "Enforces a minimum Restricted Mode on YouTube and prevents users from picking a less restricted mode.\n\nSet to 'Strict' to enforce Strict Restricted Mode on YouTube.\n\nSet to 'Moderate' to enforce the user to only use Moderate Restricted Mode and Strict Restricted Mode on YouTube. They can't disable Restricted Mode.\n\nSet to 'Off' or don't configure this policy to not enforce Restricted Mode on YouTube. External policies such as YouTube policies might still enforce Restricted Mode.\n\nPolicy options mapping:\n\n* Off (0) = Do not enforce Restricted Mode on YouTube\n\n* Moderate (1) = Enforce at least Moderate Restricted Mode on YouTube\n\n* Strict (2) = Enforce Strict Restricted Mode for YouTube\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "Off - Do not enforce Restricted Mode on YouTube",
                            "Moderate - Enforce at least Moderate Restricted Mode on YouTube",
                            "Strict - Enforce Strict Restricted Mode for YouTube"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2
                    ]
                }
            ],
            "options": {
                "infoText": "ForceYouTubeRestrict"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#forceyoutuberestrict"
                }
            ]
        },
        "GloballyScopeHTTPAuthCacheEnabled": {
            "title": "GloballyScopeHTTPAuthCacheEnabled - Enable globally scoped HTTP auth cache",
            "description": "This policy configures a single global per profile cache with HTTP server authentication credentials.\n\nIf you disable or don't set this policy, the browser will use the default behavior of cross-site auth, which as of version 80, will be to scope HTTP server authentication credentials by top-level site. So, if two sites use resources from the same authenticating domain, credentials will need to be provided independently in the context of both sites. Cached proxy credentials will be reused across sites.\n\nIf you enable this policy HTTP auth credentials entered in the context of one site will automatically be used in the context of another site.\n\nEnabling this policy leaves sites open to some types of cross-site attacks, and allows users to be tracked across sites even without cookies by adding entries to the HTTP auth cache using credentials embedded in URLs.\n\nThis policy is intended to give enterprises depending on the legacy behavior a chance to update their login procedures and will be removed in the future.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "GloballyScopeHTTPAuthCacheEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#globallyscopehttpauthcacheenabled"
                }
            ]
        },
        "GoToIntranetSiteForSingleWordEntryInAddressBar": {
            "title": "GoToIntranetSiteForSingleWordEntryInAddressBar - Force direct intranet site navigation instead of searching on single word entries in the Address Bar",
            "description": "If you enable this policy, the top auto-suggest result in the address bar suggestion list will navigate to intranet sites if the text entered in the address bar is a single word without punctuation.\n\nDefault navigation when typing a single word without punctuation will conduct a navigation to an intranet site matching the entered text.\n\nIf you enable this policy, the second auto-suggest result in the address bar suggestion list will conduct a web search exactly as it was entered, provided that this text is a single word without punctuation. The default search provider will be used unless a policy to prevent web search is also enabled.\n\nTwo effects of enabling this policy are:\n\nNavigation to sites in response to single word queries that would typically resolve to a history item will no longer happen. Instead, the browser will attempt navigate to internal sites that may not exist in an organization's intranet. This will result in a 404 error.\n\nPopular, single-word search terms will require manual selection of search suggestions to properly conduct a search.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "GoToIntranetSiteForSingleWordEntryInAddressBar"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#gotointranetsiteforsinglewordentryinaddressbar"
                }
            ]
        },
        "HSTSPolicyBypassList": {
            "title": "HSTSPolicyBypassList - Configure the list of names that will bypass the HSTS policy check",
            "description": "Hostnames specified in this list will be exempt from the HSTS policy check that could potentially upgrade requests from \"http://\" to \"https://\". Only single-label hostnames are allowed in this policy. Hostnames must be canonicalized. Any IDNs must be converted to their A-label format, and all ASCII letters must be lowercase. This policy only applies to the specific hostnames specified; it doesn't apply to subdomains of the names in the list.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "HSTSPolicyBypassList"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#hstspolicybypasslist"
                }
            ]
        },
        "HardwareAccelerationModeEnabled": {
            "title": "HardwareAccelerationModeEnabled - Use hardware acceleration when available",
            "description": "Specify to use hardware acceleration, if it's available. If you enable this policy or don't configure it, hardware acceleration is enabled unless a GPU feature is explicitly blocked.\n\nIf you disable this policy, hardware acceleration is disabled.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "HardwareAccelerationModeEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#hardwareaccelerationmodeenabled"
                }
            ]
        },
        "HeadlessModeEnabled": {
            "title": "Allow Headless Mode",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#headlessmodeenabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "HideFirstRunExperience": {
            "title": "HideFirstRunExperience - Hide the First-run experience and splash screen",
            "description": "If you enable this policy, the First-run experience and the splash screen will not be shown to users when they run Microsoft Edge for the first time.\n\nFor the configuration options shown in the First Run Experience, the browser will default to the following:\n\n-On the New Tab Page, the feed type will be set to MSN News and the layout to Inspirational.\n\n-The user will still be automatically signed into Microsoft Edge if the Windows account is of Azure AD or MSA type.\n\n-Sync will not be enabled by default and users will be prompted to choose whether they'd like to sync on browser startup. You can use the \"ForceSync\" or the \"SyncDisabled\" policy to configure sync and the sync consent prompt.\n\nIf you disable or don't configure this policy, the First-run experience and the Splash screen will be shown.\n\nNote: The specific configuration options shown to the user in the First Run Experience, can also be managed by using other specific policies. You can use the HideFirstRunExperience policy in combination with these policies to configure a specific browser experience on your managed devices. Some of these other policies are:\n\n-\"AutoImportAtFirstRun\"\n\n-\"NewTabPageLocation\"\n\n-\"NewTabPageSetFeedType\"\n\n-\"ForceSync\"\n\n-\"SyncDisabled\"\n\n-\"BrowserSignin\"\n\n-\"NonRemovableProfileEnabled\"",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "HideFirstRunExperience"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#hidefirstrunexperience"
                }
            ]
        },
        "ImportAutofillFormData": {
            "title": "ImportAutofillFormData - Allow importing of autofill form data",
            "description": "Allows users to import autofill form data from another browser into Microsoft Edge.\n\nIf you enable this policy, the option to manually import autofill data is automatically selected.\n\nIf you disable this policy, autofill form data isn't imported at first run, and users can't import it manually.\n\nIf you don't configure this policy, autofill data is imported at first run, and users can choose whether to import this data manually during later browsing sessions.\n\nYou can set this policy as a recommendation. This means that Microsoft Edge will import autofill data on first run, but users can select or clear **autofill data** option during manual import.\n\n**Note**: This policy currently manages importing from Google Chrome (on Windows 7, 8, and 10 and on macOS) and Mozilla Firefox (on Windows 7, 8, and 10 and on macOS) browsers.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ImportAutofillFormData"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#importautofillformdata"
                }
            ]
        },
        "ImportFavorites": {
            "title": "ImportFavorites - Allow importing of favorites",
            "description": "Allows users to import favorites from another browser into Microsoft Edge.\n\nIf you enable this policy, the **Favorites** check box is automatically selected in the **Import browser data** dialog box.\n\nIf you disable this policy, favorites aren't imported at first run, and users can't import them manually.\n\nIf you don't configure this policy, favorites are imported at first run, and users can choose whether to import them manually during later browsing sessions.\n\nYou can also set this policy as a recommendation. This means that Microsoft Edge imports favorites on first run, but users can select or clear the **favorites** option during manual import.\n\n**Note**: This policy currently manages importing from Internet Explorer (on Windows 7, 8, and 10), Google Chrome (on Windows 7, 8, and 10 and on macOS), Mozilla Firefox (on Windows 7, 8, and 10 and on macOS), and Apple Safari (on macOS) browsers.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ImportFavorites"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#importfavorites"
                }
            ]
        },
        "ImportBrowserSettings": {
            "title": "ImportBrowserSettings - Allow importing of browser settings",
            "description": "Allows users to import browser settings from another browser into Microsoft Edge.\n\nIf you enable this policy, the **Browser settings** check box is automatically selected in the **Import browser data** dialog box.\n\nIf you disable this policy, browser settings aren't imported at first run, and users can't import them manually.\n\nIf you don't configure this policy, browser settings are imported at first run, and users can choose whether to import them manually during later browsing sessions.\n\nYou can also set this policy as a recommendation. This means that Microsoft Edge imports the settings on first run, but users can select or clear the **browser settings** option during manual import.\n\n**Note**: This policy currently manages importing Google Chrome (on Windows 7, 8, and 10 and on macOS).",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ImportBrowserSettings"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#importbrowsersettings"
                }
            ]
        },
        "ImportCookies": {
            "title": "ImportCookies - Allow importing of Cookies",
            "description": "Allows users to import Cookies from another browser into Microsoft Edge.\n\nIf you disable this policy, Cookies aren't imported on first run.\n\nIf you don't configure this policy, Cookies are imported on first run.\n\nYou can also set this policy as a recommendation. This means that Microsoft Edge imports Cookies on first run.\n\n**Note**: This policy currently manages importing Google Chrome (on Windows 7, 8, and 10 and on macOS).",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ImportCookies"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#importcookies"
                }
            ]
        },
        "ImportExtensions": {
            "title": "ImportExtensions - Allow importing of extensions",
            "description": "Allows users to import extensions from another browser into Microsoft Edge.\n\nIf you enable this policy, the **Extensions** check box is automatically selected in the **Import browser data** dialog box.\n\nIf you disable this policy, extensions aren't imported at first run, and users can't import them manually.\n\nIf you don't configure this policy, extensions are imported at first run, and users can choose whether to import them manually during later browsing sessions.\n\nYou can also set this policy as a recommendation. This means that Microsoft Edge imports extensions on first run, but users can select or clear the **favorites** option during manual import.\n\n**Note**: This policy currently only supports importing from Google Chrome (on Windows 7, 8, and 10 and on macOS).",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ImportExtensions"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#importextensions"
                }
            ]
        },
        "ImportHistory": {
            "title": "ImportHistory - Allow importing of browsing history",
            "description": "Allows users to import their browsing history from another browser into Microsoft Edge.\n\nIf you enable this policy, the **Browsing history** check box is automatically selected in the **Import browser data** dialog box.\n\nIf you disable this policy, browsing history data isn't imported at first run, and users can't import this data manually.\n\nIf you don't configure this policy, browsing history data is imported at first run, and users can choose whether to import it manually during later browsing sessions.\n\nYou can also set this policy as a recommendation. This means that Microsoft Edge imports browsing history on first run, but users can select or clear the **history** option during manual import.\n\n**Note**: This policy currently manages importing from Internet Explorer (on Windows 7, 8, and 10), Google Chrome (on Windows 7, 8, and 10 and on macOS), Mozilla Firefox (on Windows 7, 8, and 10 and on macOS), and Apple Safari (macOS) browsers.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ImportHistory"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#importhistory"
                }
            ]
        },
        "ImportHomepage": {
            "title": "ImportHomepage - Allow importing of home page settings",
            "description": "Allows users to import their home page setting from another browser into Microsoft Edge.\n\nIf you enable this policy, the option to manually import the home page setting is automatically selected.\n\nIf you disable this policy, the home page setting isn't imported at first run, and users can't import it manually.\n\nIf you don't configure this policy, the home page setting is imported at first run, and users can choose whether to import this data manually during later browsing sessions.\n\nYou can set this policy as a recommendation. This means that Microsoft Edge imports the home page setting on first run, but users can select or clear the **home page** option during manual import.\n\n**Note**: This policy currently manages importing from Internet Explorer (on Windows 7, 8, and 10).",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ImportHomepage"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#importhomepage"
                }
            ]
        },
        "ImportOpenTabs": {
            "title": "ImportOpenTabs - Allow importing of open tabs",
            "description": "Allows users to import open and pinned tabs from another browser into Microsoft Edge.\n\nIf you enable this policy, the **Open tabs** check box is automatically selected in the **Import browser data** dialog box.\n\nIf you disable this policy, open tabs aren't imported at first run, and users can't import them manually.\n\nIf you don't configure this policy, open tabs are imported at first run, and users can choose whether to import them manually during later browsing sessions.\n\nYou can also set this policy as a recommendation. This means that Microsoft Edge imports open tabs on first run, but users can select or clear the **Open tabs** option during manual import.\n\n**Note**: This policy currently only supports importing from Google Chrome (on Windows 7, 8, and 10 and on macOS).",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ImportOpenTabs"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#importopentabs"
                }
            ]
        },
        "ImportPaymentInfo": {
            "title": "ImportPaymentInfo - Allow importing of payment info",
            "description": "Allows users to import payment info from another browser into Microsoft Edge.\n\nIf you enable this policy, the **payment info** check box is automatically selected in the **Import browser data** dialog box.\n\nIf you disable this policy, payment info isn't imported at first run, and users can't import it manually.\n\nIf you don't configure this policy, payment info is imported at first run, and users can choose whether to import it manually during later browsing sessions.\n\nYou can also set this policy as a recommendation. This means that Microsoft Edge imports payment info on first run, but users can select or clear the **payment info** option during manual import.\n\n**Note:** This policy currently manages importing from Google Chrome (on Windows 7, 8, and 10 and on macOS).",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ImportPaymentInfo"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#importpaymentinfo"
                }
            ]
        },
        "ImportSavedPasswords": {
            "title": "ImportSavedPasswords - Allow importing of saved passwords",
            "description": "Allows users to import saved passwords from another browser into Microsoft Edge.\n\nIf you enable this policy, the option to manually import saved passwords is automatically selected.\n\nIf you disable this policy, saved passwords aren't imported on first run, and users can't import them manually.\n\nIf you don't configure this policy, passwords are imported at first run, and users can choose whether to import them manually during later browsing sessions.\n\nYou can set this policy as a recommendation. This means that Microsoft Edge imports passwords on first run, but users can select or clear the **passwords** option during manual import.\n\n**Note**: This policy currently manages importing from Internet Explorer (on Windows 7, 8, and 10), Google Chrome (on Windows 7, 8, and 10 and on macOS), and Mozilla Firefox (on Windows 7, 8, and 10 and on macOS) browsers.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ImportSavedPasswords"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#importsavedpasswords"
                }
            ]
        },
        "ImportSearchEngine": {
            "title": "ImportSearchEngine - Allow importing of search engine settings",
            "description": "Allows users to import search engine settings from another browser into Microsoft Edge.\n\nIf you enable, this policy, the option to import search engine settings is automatically selected.\n\nIf you disable this policy, search engine settings aren't imported at first run, and users can't import them manually.\n\nIf you don't configure this policy, search engine settings are imported at first run, and users can choose whether to import this data manually during later browsing sessions.\n\nYou can set this policy as a recommendation. This means that Microsoft Edge imports search engine settings on first run, but users can select or clear the **search engine** option during manual import.\n\n**Note**: This policy currently manages importing from Internet Explorer (on Windows 7, 8, and 10).",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ImportSearchEngine"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#importsearchengine"
                }
            ]
        },
        "ImportShortcuts": {
            "title": "ImportShortcuts - Allow importing of shortcuts",
            "description": "Allows users to import Shortcuts from another browser into Microsoft Edge.\n\nIf you disable this policy, Shortcuts aren't imported on first run.\n\nIf you don't configure this policy, Shortcuts are imported on first run.\n\nYou can also set this policy as a recommendation. This means that Microsoft Edge imports Shortcuts on first run.\n\n**Note**: This policy currently manages importing from Google Chrome (on Windows 7, 8, and 10 and on macOS).",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ImportShortcuts"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#importshortcuts"
                }
            ]
        },
        "InAppSupportEnabled": {
            "title": "In-app support Enabled",
            "description": "(InAppSupportEnabled)-Microsoft Edge uses the in-app support feature (enabled by default) to allow users to contact our support agents directly from the browser",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#inappsupportenabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "InPrivateModeAvailability": {
            "title": "InPrivateModeAvailability - Configure InPrivate mode availability",
            "description": "Specifies whether the user can open pages in InPrivate mode in Microsoft Edge.\n\nIf you don't configure this policy or set it to 'Enabled', users can open pages in InPrivate mode.\n\nSet this policy to 'Disabled' to stop users from using InPrivate mode.\n\nSet this policy to 'Forced' to always use InPrivate mode.\n\nPolicy options mapping:\n\n* Enabled (0) = InPrivate mode available\n\n* Disabled (1) = InPrivate mode disabled\n\n* Forced (2) = InPrivate mode forced\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "Enabled - InPrivate mode available",
                            "Disabled - InPrivate mode disabled",
                            "Forced - InPrivate mode forced"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2
                    ]
                }
            ],
            "options": {
                "infoText": "InPrivateModeAvailability"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#inprivatemodeavailability"
                }
            ]
        },
        "InsecureFormsWarningsEnabled": {
            "title": "InsecureFormsWarningsEnabled - Enable warnings for insecure forms",
            "description": "This policy controls the handling of insecure forms (forms submitted over HTTP) embedded in secure (HTTPS) sites in the browser.\nIf you enable this policy or don't set it, a full page warning will be shown when an insecure form is submitted. Additionally, a warning bubble will be shown next to the form fields when they are focused, and autofill will be disabled for those forms.\nIf you disable this policy, warnings will not be shown for insecure forms, and autofill will work normally.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "InsecureFormsWarningsEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#insecureformswarningsenabled"
                }
            ]
        },
        "IntensiveWakeUpThrottlingEnabled": {
            "title": "IntensiveWakeUpThrottlingEnabled - Control the IntensiveWakeUpThrottling feature",
            "description": "When enabled the IntensiveWakeUpThrottling feature causes Javascript timers in background tabs to be aggressively throttled and coalesced, running no more than once per minute after a page has been backgrounded for 5 minutes or more.\n\nThis is a web standards compliant feature, but it may break functionality on some websites by causing certain actions to be delayed by up to a minute. However, it results in significant CPU and battery savings when enabled. See https://bit.ly/30b1XR4 for more details.\n\nIf you enable this policy, the feature will be force enabled, and users will not be able to override this setting.\nIf you disable this policy, the feature will be force disabled, and users will not be able to override this setting.\nIf you don't configure this policy, the feature will be controlled by its own internal logic. Users can manually configure this setting.\n\nNote that the policy is applied per renderer process, with the most recent value of the policy setting in force when a renderer process starts. A full restart is required to ensure that all the loaded tabs receive a consistent policy setting. It is harmless for processes to be running with different values of this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "IntensiveWakeUpThrottlingEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#intensivewakeupthrottlingenabled"
                }
            ]
        },
        "IntranetRedirectBehavior": {
            "title": "IntranetRedirectBehavior - Intranet Redirection Behavior",
            "description": "This policy configures behavior for intranet redirection via DNS interception checks. The checks attempt to discover whether the browser is behind a proxy that redirects unknown host names.\n\nIf this policy isn't configured, the browser will use the default behavior of DNS interception checks and intranet redirect suggestions. In M88, they are enabled by default but will be disabled by default in the future release.\n\n\"DNSInterceptionChecksEnabled\" is a related policy that might also disable DNS interception checks. However, this policy is a more flexible version which might separately control intranet redirection infobars and might be expanded in the future.\nIf either \"DNSInterceptionChecksEnabled\" or this policy make a request to disable interception checks, the checks will be disabled.\nIf DNS interception checks are disabled by this policy but \"GoToIntranetSiteForSingleWordEntryInAddressBar\" is enabled, single word queries will still result in intranet navigations.\n\nPolicy options mapping:\n\n* Default (0) = Use default browser behavior.\n\n* DisableInterceptionChecksDisableInfobar (1) = Disable DNS interception checks and did-you-mean \"http://intranetsite/\" infobars.\n\n* DisableInterceptionChecksEnableInfobar (2) = Disable DNS interception checks; allow did-you-mean \"http://intranetsite/\" infobars.\n\n* EnableInterceptionChecksEnableInfobar (3) = Allow DNS interception checks and did-you-mean \"http://intranetsite/\" infobars.\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "Default - Use default browser behavior.",
                            "DisableInterceptionChecksDisableInfobar - Disable DNS interception checks and did-you-mean \"http://intranetsite/\" infobars.",
                            "DisableInterceptionChecksEnableInfobar - Disable DNS interception checks; allow did-you-mean \"http://intranetsite/\" infobars.",
                            "EnableInterceptionChecksEnableInfobar - Allow DNS interception checks and did-you-mean \"http://intranetsite/\" infobars."
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2,
                        3
                    ]
                }
            ],
            "options": {
                "infoText": "IntranetRedirectBehavior"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#intranetredirectbehavior"
                }
            ]
        },
        "IsolateOrigins": {
            "title": "IsolateOrigins - Enable site isolation for specific origins",
            "description": "Specify origins to run in isolation, in their own process.\n\nThis policy also isolates origins named by subdomains - for example, specifying https://contoso.com/ will cause https://foo.contoso.com/ to be isolated as part of the https://contoso.com/ site.\n\nIf the policy is enabled, each of the named origins in a comma-separated list will run in its own process.\n\nIf you disable this policy, then both the 'IsolateOrigins' and 'SitePerProcess' features are disabled. Users can still enable 'IsolateOrigins' policy manually, via command line flags.\n\nIf you don't configure the policy, the user can change this setting.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "IsolateOrigins"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#isolateorigins"
                }
            ]
        },
        "LocalProvidersEnabled": {
            "title": "LocalProvidersEnabled - Allow suggestions from local providers",
            "description": "Allow suggestions from suggestion providers on the device (local providers), for example, Favorites and Browsing History, in Microsoft Edge's Address Bar and Auto-Suggest List.\n\nIf you enable this policy, suggestions from local providers are used.\n\nIf you disable this policy, suggestions from local providers are never used. Local history and local favorites suggestions will not appear.\n\nIf you do not configure this policy, suggestions from local providers are allowed but the user can change that using the settings toggle.\n\nNote that some features may not be available if a policy to disable this feature has been applied. For example, Browsing History suggestions will not be available if you enable the \"SavingBrowserHistoryDisabled\" policy.\n\nThis policy requires a browser restart to finish applying.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "LocalProvidersEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#localprovidersenabled"
                }
            ]
        },
        "MAUEnabled": {
            "title": "Always use Microsoft AutoUpdate as the updater for Microsoft Edge",
            "description": "(MAUEnabled)-This policy lets you configure the updater that Microsoft Edge uses",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#always-use-microsoft-autoupdate-as-the-updater-for-microsoft-edge"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "MSAWebSiteSSOUsingThisProfileAllowed": {
            "title": "Allow single sign-on for Microsoft personal sites using this profile",
            "description": "(MSAWebSiteSSOUsingThisProfileAllowed)-Allows non-MSA profiles to be able to use single sign-on for Microsoft sites using MSA credentials present on the machine",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#msawebsitessousingthisprofileallowed"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "ManagedFavorites": {
            "title": "ManagedFavorites - not configurable in UI, please craft plist",
            "description": "Configures a list of managed favorites.\n\nThe policy creates a list of favorites. Each favorite contains the keys \"name\" and \"url,\" which hold the favorite's name and its target. You can configure a subfolder by defining a favorites without an \"url\" key but with an additional \"children\" key that contains a list of favorites as defined above (some of which may be folders again). Microsoft Edge amends incomplete URLs as if they were submitted via the Address Bar, for example \"microsoft.com\" becomes \"https://microsoft.com/\".\n\nThese favorites are placed in a folder that can't be modified by the user (but the user can choose to hide it from the favorites bar). By default the folder name is \"Managed favorites\" but you can change it by adding to the list of favorites a dictionary containing the key \"toplevel_name\" with the desired folder name as the value.\n\nManaged favorites are not synced to the user account and can't be modified by extensions.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                }
            ],
            "options": {
                "infoText": "ManagedFavorites"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#managedfavorites"
                }
            ]
        },
        "ManagedSearchEngines": {
            "title": "ManagedSearchEngines - not configurable in UI, please craft plist",
            "description": "Lets you configure a list of up to 10 search engines, one of which must be marked as the default search engine.\nYou do not need to specify the encoding. Starting in Microsoft Edge 80, the suggest_url and image_search_url parameters are optional. The optional parameter, image_search_post_params (consists of comma-separated name/value pairs), is available starting in Microsoft Edge 80.\n\nStarting in Microsoft Edge 83, you can enable search engine discovery with the allow_search_engine_discovery optional parameter. This parameter must be the first item in the list. If allow_search_engine_discovery is not specified, search engine discovery will be disabled by default. Starting in Microsoft Edge 84, you can set this policy as a recommended policy to allow search provider discovery. You do not need to add the allow_search_engine_discovery optional parameter.\n\nIf you enable this policy, users can't add, remove, or change any search engine in the list. Users can set their default search engine to any search engine in the list.\n\nIf you disable or don't configure this policy, users can modify the search engines list as desired.\n\nIf the \"DefaultSearchProviderSearchURL\" policy is set, this policy (ManagedSearchEngines) is ignored. The user must restart their browser to finish applying this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                }
            ],
            "options": {
                "infoText": "ManagedSearchEngines"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#managedsearchengines"
                }
            ]
        },
        "MathSolverEnabled": {
            "title": "Let users snip a Math problem and get the solution with a step-by-step explanation in Microsoft Edge",
            "description": "(MathSolverEnabled)-This policy lets you manage whether users can use the Math Solver tool in Microsoft Edge or not",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#mathsolverenabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "MaxConnectionsPerProxy": {
            "title": "MaxConnectionsPerProxy - Maximum number of concurrent connections to the proxy server",
            "description": "Specifies the maximum number of simultaneous connections to the proxy server.\n\nSome proxy servers can't handle a high number of concurrent connections per client - you can solve this by setting this policy to a lower value.\n\nThe value of this policy should be lower than 100 and higher than 6. The default value is 32.\n\nSome web apps are known to consume many connections with hanging GETs - lowering the maximum connections below 32 may lead to browser networking hangs if too many of these kind of web apps are open.\n\nIf you don't configure this policy, the default value (32) is used.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ],
            "options": {
                "infoText": "MaxConnectionsPerProxy"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#maxconnectionsperproxy"
                }
            ]
        },
        "MediaRouterCastAllowAllIPs": {
            "title": "MediaRouterCastAllowAllIPs - Allow Google Cast to connect to Cast devices on all IP addresses",
            "description": "Enable this policy to let Google Cast connect to Cast devices on all IP addresses, not just RFC1918/RFC4193 private addresses.\n\nDisable this policy to restrict Google Cast to Cast devices on RFC1918/RFC4193 private addresses.\n\nIf you don't configure this policy, Google Cast connects to Cast devices on RFC1918/RFC4193 private addresses only, unless you enable the CastAllowAllIPs feature.\n\nIf the \"EnableMediaRouter\" policy is disabled, then this policy has no effect.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "MediaRouterCastAllowAllIPs"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#mediaroutercastallowallips"
                }
            ]
        },
        "MetricsReportingEnabled": {
            "title": "MetricsReportingEnabled - Enable usage and crash-related data reporting",
            "description": "This policy is deprecated. It is currently supported but will become obsolete in Microsoft Edge 89. This policy is replaced by the new policy:  \"DiagnosticData\"for Windows 7, Windows 8, and macOS. This policy is replaced by Allow Telemetry on Win 10 (https://go.microsoft.com/fwlink/?linkid=2099569).\n\nThis policy enables reporting of usage and crash-related data about Microsoft Edge to Microsoft.\n\nEnable this policy to send reporting of usage and crash-related data to Microsoft. Disable this policy to not send the data to Microsoft. In both cases, users can't change or override the setting.\n\nOn Windows 10, if you don't configure this policy, Microsoft Edge will default to the Windows diagnostic data setting. If you enable this policy, Microsoft Edge will only send usage data if the Windows Diagnostic data setting is set to Enhanced or Full. If you disable this policy, Microsoft Edge will not send usage data. Crash-related data is sent based on the Windows Diagnostic data setting. Learn more about Windows Diagnostic data settings at https://go.microsoft.com/fwlink/?linkid=2099569\n\nOn Windows 7, Windows 8, and macOS, this policy controls sending usage and crash-related data. If you don't configure this policy, Microsoft Edge will default to the user's preference.\n\nTo enable this policy,\"SendSiteInfoToImproveServices\" must be set to Enabled. If \"MetricsReportingEnabled\" or \"SendSiteInfoToImproveServices\" is Not Configured or Disabled, this data will not be sent to Microsoft.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "MetricsReportingEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#metricsreportingenabled"
                }
            ]
        },
        "MicrosoftEdgeInsiderPromotionEnabled": {
            "title": "Microsoft Edge Insider Promotion Enabled",
            "description": "(MicrosoftEdgeInsiderPromotionEnabled)-Shows content promoting the Microsoft Edge Insider channels on the About Microsoft Edge settings page",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#microsoftedgeinsiderpromotionenabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "NetworkPredictionOptions": {
            "title": "NetworkPredictionOptions - Enable network prediction",
            "description": "Enables network prediction and prevents users from changing this setting.\n\nThis controls DNS prefetching, TCP and SSL preconnection, and prerendering of web pages.\n\nIf you don't configure this policy, network prediction is enabled but the user can change it.\n\nPolicy options mapping:\n\n* NetworkPredictionAlways (0) = Predict network actions on any network connection\n\n* NetworkPredictionWifiOnly (1) = Not supported, if this value is used it will be treated as if 'Predict network actions on any network connection' (0) was set\n\n* NetworkPredictionNever (2) = Don't predict network actions on any network connection\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "NetworkPredictionAlways - Predict network actions on any network connection",
                            "NetworkPredictionWifiOnly - Not supported, if this value is used it will be treated as if 'Predict network actions on any network connection' (0) was set",
                            "NetworkPredictionNever - Don't predict network actions on any network connection"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2
                    ]
                }
            ],
            "options": {
                "infoText": "NetworkPredictionOptions"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#networkpredictionoptions"
                }
            ]
        },
        "OverrideSecurityRestrictionsOnInsecureOrigin": {
            "title": "OverrideSecurityRestrictionsOnInsecureOrigin - Control where security restrictions on insecure origins apply",
            "description": "Specifies a list of origins (URLs) or hostname patterns (like \"*.contoso.com\") for which security restrictions on insecure origins don't apply.\n\nThis policy lets you specify allowed origins for legacy applications that can't deploy TLS or set up a staging server for internal web development so that developers can test out features requiring secure contexts without having to deploy TLS on the staging server. This policy also prevents the origin from being labeled \"Not Secure\" in the omnibox.\n\nSetting a list of URLs in this policy has the same effect as setting the command-line flag '--unsafely-treat-insecure-origin-as-secure' to a comma-separated list of the same URLs. If you enable this policy, it overrides the command-line flag.\n\nFor more information on secure contexts, see https://www.w3.org/TR/secure-contexts/.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "OverrideSecurityRestrictionsOnInsecureOrigin"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#overridesecurityrestrictionsoninsecureorigin"
                }
            ]
        },
        "PaymentMethodQueryEnabled": {
            "title": "PaymentMethodQueryEnabled - Allow websites to query for available payment methods",
            "description": "Allows you to set whether websites can check if the user has payment methods saved.\n\nIf you disable this policy, websites that use PaymentRequest.canMakePayment or PaymentRequest.hasEnrolledInstrument API will be informed that no payment methods are available.\n\nIf you enable this policy or don't set this policy, websites can check if the user has payment methods saved.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "PaymentMethodQueryEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#paymentmethodqueryenabled"
                }
            ]
        },
        "PersonalizationReportingEnabled": {
            "title": "PersonalizationReportingEnabled - Allow personalization of ads, search and news by sending browsing history to Microsoft",
            "description": "This policy prevents Microsoft from collecting a user's Microsoft Edge browsing history to be used for personalizing advertising, search, news and other Microsoft services.\n\nThis setting is only available for users with a Microsoft account. This setting is not available for child accounts or enterprise accounts.\n\nIf you disable this policy, users can't change or override the setting. If this policy is enabled or not configured, Microsoft Edge will default to the user's preference.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "PersonalizationReportingEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#personalizationreportingenabled"
                }
            ]
        },
        "ProactiveAuthEnabled": {
            "title": "ProactiveAuthEnabled - Enable Proactive Authentication",
            "description": "This policy is deprecated because it does not work independently of browser sign in. It won't work in Microsoft Edge version 91. If you want to configure browser sign in, use the \"BrowserSignin\" policy.\n\nLets you configure whether to turn on Proactive Authentication in Microsoft Edge.\n\nIf you enable this policy, Microsoft Edge tries to seamlessly authenticate to websites and services using the account which is signed-in to the browser.\n\nIf you disable this policy, Microsoft Edge does not try to authenticate with websites or services using single sign-on (SSO). Authenticated experiences like the Enterprise New Tab Page will not work (e.g. recent and recommended Office documents will not be available).\n\nIf you don't configure this policy, Proactive Authentication is turned on.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ProactiveAuthEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#proactiveauthenabled"
                }
            ]
        },
        "PromotionalTabsEnabled": {
            "title": "PromotionalTabsEnabled - Enable full-tab promotional content",
            "description": "Control the presentation of full-tab promotional or educational content. This setting controls the presentation of welcome pages that help users sign into Microsoft Edge, choose their default browser, or learn about product features.\n\nIf you enable this policy (set it true) or don't configure it, Microsoft Edge can show full-tab content to users to provide product information.\n\nIf you disable (set to false) this policy, Microsoft Edge can't show full-tab content to users.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "PromotionalTabsEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#promotionaltabsenabled"
                }
            ]
        },
        "PromptForDownloadLocation": {
            "title": "PromptForDownloadLocation - Ask where to save downloaded files",
            "description": "Set whether to ask where to save a file before downloading it.\n\nIf you enable this policy, the user is asked where to save each file before downloading; if you don't configure it, files are saved automatically to the default location, without asking the user.\n\nIf you don't configure this policy, the user will be able to change this setting.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "PromptForDownloadLocation"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#promptfordownloadlocation"
                }
            ]
        },
        "QuicAllowed": {
            "title": "QuicAllowed - Allow QUIC protocol",
            "description": "Allows use of the QUIC protocol in Microsoft Edge.\n\nIf you enable this policy or don't configure it, the QUIC protocol is allowed.\n\nIf you disable this policy, the QUIC protocol is blocked.\n\nQUIC is a transport layer network protocol that can improve performance of web applications that currently use TCP.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "QuicAllowed"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#quicallowed"
                }
            ]
        },
        "QuickViewOfficeFilesEnabled": {
            "title": "Manage QuickView Office files capability in Microsoft Edge",
            "description": "(QuickViewOfficeFilesEnabled)-Allows you to set whether users can view Office files on the web that aren't on OneDrive or SharePoint",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#quickviewofficefilesenabled"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "RelaunchNotification": {
            "title": "RelaunchNotification - Notify a user that a browser restart is recommended or required for pending updates",
            "description": "Notify users that they need to restart Microsoft Edge to apply a pending update.\n\nIf you don't configure this policy, Microsoft Edge adds a recycle icon at the far right of the top menu bar to prompt users to restart the browser to apply the update.\n\nIf you enable this policy and set it to 'Recommended', a recurring warning prompts users that a restart is recommended. Users can dismiss this warning and defer the restart.\n\nIf you set the policy to 'Required', a recurring warning prompts users that the browser will be restarted automatically as soon as a notification period passes. The default period is seven days. You can configure this period with the \"RelaunchNotificationPeriod\" policy.\n\nThe user's session is restored when the browser restarts.\n\nPolicy options mapping:\n\n* Recommended (1) = Recommended - Show a recurring prompt to the user indicating that a restart is recommended\n\n* Required (2) = Required - Show a recurring prompt to the user indicating that a restart is required\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "Recommended - Recommended - Show a recurring prompt to the user indicating that a restart is recommended",
                            "Required - Required - Show a recurring prompt to the user indicating that a restart is required"
                        ]
                    },
                    "enum": [
                        1,
                        2
                    ]
                }
            ],
            "options": {
                "infoText": "RelaunchNotification"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#relaunchnotification"
                }
            ]
        },
        "RelaunchNotificationPeriod": {
            "title": "RelaunchNotificationPeriod - Set the time period for update notifications",
            "description": "Allows you to set the time period, in milliseconds, over which users are notified that Microsoft Edge must be relaunched to apply a pending update.\n\nOver this time period, the user will be repeatedly informed of the need for an update. In Microsoft Edge the app menu changes to indicate that a relaunch is needed once one third of the notification period passes. This notification changes color once two thirds of the notification period passes, and again once the full notification period has passed. The additional notifications enabled by the \"RelaunchNotification\" policy follow this same schedule.\n\nIf not set, the default period of 604800000 milliseconds (one week) is used.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ],
            "options": {
                "infoText": "RelaunchNotificationPeriod"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#relaunchnotificationperiod"
                }
            ]
        },
        "ResolveNavigationErrorsUseWebService": {
            "title": "ResolveNavigationErrorsUseWebService - Enable resolution of navigation errors using a web service",
            "description": "Allow Microsoft Edge to issue a dataless connection to a web service to probe networks for connectivity in cases like hotel and airport Wi-Fi.\n\nIf you enable this policy, a web service is used for network connectivity tests.\n\nIf you disable this policy, Microsoft Edge uses native APIs to try to resolve network connectivity and navigation issues.\n\n**Note**: Except on Windows 8 and later versions of Windows, Microsoft Edge *always* uses native APIs to resolve connectivity issues.\n\nIf you don't configure this policy, Microsoft Edge respects the user preference that's set under Services at edge://settings/privacy.\nSpecifically, there's a **Use a web service to help resolve navigation errors** toggle, which the user can switch on or off. Be aware that if you have enabled this policy (ResolveNavigationErrorsUseWebService), the **Use a web service to help resolve navigation errors** setting is turned on, but the user can't change the setting by using the toggle. If you have disabled this policy, the **Use a web service to help resolve navigation errors** setting is turned off, and the user can't change the setting by using the toggle.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ResolveNavigationErrorsUseWebService"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#resolvenavigationerrorsusewebservice"
                }
            ]
        },
        "RestrictSigninToPattern": {
            "title": "RestrictSigninToPattern - Restrict which accounts can be used as Microsoft Edge primary accounts",
            "description": "Determines which accounts can be set as browser primary accounts in Microsoft Edge (the account that is chosen during the Sync opt-in flow).\n\nIf a user tries to configure a browser primary account with a username that doesn't match this pattern, they are blocked and will get the appropriate error message. You can configure this policy to match multiple accounts using a Perl style regular expression for the pattern. Note that pattern matches are case sensitive. For more information about the regular expression rules that are used, refer to https://go.microsoft.com/fwlink/p/?linkid=2133903.\n\nIf you don't configure this policy or leave it blank, users can set any account as a browser primary account in Microsoft Edge.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "RestrictSigninToPattern"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#restrictsignintopattern"
                }
            ]
        },
        "SSLErrorOverrideAllowed": {
            "title": "SSLErrorOverrideAllowed - Allow users to proceed from the HTTPS warning page",
            "description": "Microsoft Edge shows a warning page when users visit sites that have SSL errors.\n\nIf you enable or don't configure (default) this policy, users can click through these warning pages.\n\nIf you disable this policy, users are blocked from clicking through any warning page.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "SSLErrorOverrideAllowed"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#sslerroroverrideallowed"
                }
            ]
        },
        "SSLVersionMin": {
            "title": "SSLVersionMin - Minimum TLS version enabled",
            "description": "Sets the minimum supported version of TLS. If you don't configure this policy, Microsoft Edge will show an error for TLS 1.0 and TLS 1.1, but the user will be able to bypass it.\n\nIf you enable this policy, Microsoft Edge won't use any version of SSL/TLS lower than the specified version. Any unrecognized value is ignored.\n\nPolicy options mapping:\n\n* TLSv1 (tls1) = TLS 1.0\n\n* TLSv1.1 (tls1.1) = TLS 1.1\n\n* TLSv1.2 (tls1.2) = TLS 1.2\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "enum_titles": [
                            "TLSv1 - TLS 1.0",
                            "TLSv1.1 - TLS 1.1",
                            "TLSv1.2 - TLS 1.2"
                        ]
                    },
                    "enum": [
                        "tls1",
                        "tls1.1",
                        "tls1.2"
                    ]
                }
            ],
            "options": {
                "infoText": "SSLVersionMin"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#sslversionmin"
                }
            ]
        },
        "SaveCookiesOnExit": {
            "title": "SaveCookiesOnExit - Save cookies when Microsoft Edge closes",
            "description": "When this policy is enabled, the specified set of cookies is exempt from deletion when the browser closes. This policy is only effective when:\n- The 'Cookies and other site data' toggle is configured in Settings/Privacy and services/Clear browsing data on close or\n- The policy \"ClearBrowsingDataOnExit\" is enabled or\n- The policy \"DefaultCookiesSetting\" is set to 'Keep cookies for the duration of the session'.\n\nYou can define a list of sites, based on URL patterns, that will have their cookies preserved across sessions.\n\nNote: Users can still edit the cookie site list to add or remove URLs. However, they can't remove URLs that have been added by an Admin.\n\nIf you enable this policy, the list of cookies won't be cleared when the browser closes.\n\nIf you disable or don't configure this policy, the user's personal configuration is used.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "SaveCookiesOnExit"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#savecookiesonexit"
                }
            ]
        },
        "SavingBrowserHistoryDisabled": {
            "title": "SavingBrowserHistoryDisabled - Disable saving browser history",
            "description": "Disables saving browser history and prevents users from changing this setting.\n\nIf you enable this policy, browsing history isn't saved. This also disables tab syncing.\n\nIf you disable this policy or don't configure it, browsing history is saved.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "SavingBrowserHistoryDisabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#savingbrowserhistorydisabled"
                }
            ]
        },
        "ScreenCaptureAllowed": {
            "title": "ScreenCaptureAllowed - Allow or deny screen capture",
            "description": "If you enable this policy, or don't configure this policy, a web page can use screen-share APIs (for example, getDisplayMedia() or the Desktop Capture extension API) for a screen capture.\nIf you disable this policy, calls to screen-share APIs will fail. For example, if you're using a web-based online meeting, video or screen sharing will not work.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ScreenCaptureAllowed"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#screencaptureallowed"
                }
            ]
        },
        "ScrollToTextFragmentEnabled": {
            "title": "ScrollToTextFragmentEnabled - Enable scrolling to text specified in URL fragments",
            "description": "This feature lets hyperlink and address bar URL navigations target specific text on a web page, which will be scrolled to after the web page finishes loading.\n\nIf you enable or don't configure this policy, web page scrolling to specific text fragments via a URL will be enabled.\n\nIf you disable this policy, web page scrolling to specific text fragments via a URL will be disabled.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ScrollToTextFragmentEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#scrolltotextfragmentenabled"
                }
            ]
        },
        "SearchSuggestEnabled": {
            "title": "SearchSuggestEnabled - Enable search suggestions",
            "description": "Enables web search suggestions in Microsoft Edge's Address Bar and Auto-Suggest List and prevents users from changing this policy.\n\nIf you enable this policy, web search suggestions are used.\n\nIf you disable this policy, web search suggestions are never used, however local history and local favorites suggestions still appear. If you disable this policy, neither the typed characters, nor the URLs visited will be included in telemetry to Microsoft.\n\nIf this policy is left not set, search suggestions are enabled but the user can change that.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "SearchSuggestEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#searchsuggestenabled"
                }
            ]
        },
        "SecurityKeyPermitAttestation": {
            "title": "SecurityKeyPermitAttestation - Websites or domains that don't need permission to use direct Security Key attestation",
            "description": "Specifies websites and domains that don't need explicit user permission when attestation certificates from security keys are requested. Additionally, a signal is sent to the security key indicating that it can use individual attestation. Without this, users are prompted each time a site requests attestation of security keys.\n\nSites (like https://contoso.com/some/path) only match as U2F appIDs. Domains (like contoso.com) only match as webauthn RP IDs. To cover both U2F and webauthn APIs for a given site, you need to list both the appID URL and domain.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "SecurityKeyPermitAttestation"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#securitykeypermitattestation"
                }
            ]
        },
        "SendSiteInfoToImproveServices": {
            "title": "SendSiteInfoToImproveServices - Send site information to improve Microsoft services",
            "description": "This policy is deprecated. It is currently supported but will become obsolete in Microsoft Edge 89. This policy is replaced by the new policy:  \"DiagnosticData\"for Windows 7, Windows 8, and macOS. This policy is replaced by Allow Telemetry on Win 10 (https://go.microsoft.com/fwlink/?linkid=2099569).\n\nThis policy enables sending info about websites visited in Microsoft Edge to Microsoft to improve services like search.\n\nEnable this policy to send info about websites visited in Microsoft Edge to Microsoft. Disable this policy to not send info about websites visited in Microsoft Edge to Microsoft. In both cases, users can't change or override the setting.\n\nOn Windows 10, if you don't configure this policy, Microsoft Edge will default to the Windows diagnostic data setting. If this policy is enabled Microsoft Edge will only send info about websites visited in Microsoft Edge if the Windows Diagnostic data setting is set to Full. If this policy is disabled Microsoft Edge will not send info about websites visited. Learn more about Windows Diagnostic data settings: https://go.microsoft.com/fwlink/?linkid=2099569\n\nOn Windows 7, windows 8, and macOS this policy controls sending info about websites visited. If you don't configure this policy, Microsoft Edge will default to the user's preference.\n\nTo enable this policy, \"MetricsReportingEnabled\" must be set to Enabled. If \"SendSiteInfoToImproveServices\" or \"MetricsReportingEnabled\" is Not Configured or Disabled, this data will not be sent to Microsoft.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "SendSiteInfoToImproveServices"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#sendsiteinfotoimproveservices"
                }
            ]
        },
        "SensorsAllowedForUrls": {
            "title": "SensorsAllowedForUrls - Allow access to sensors on specific sites",
            "description": "Define a list of sites, based on URL patterns, that can access and use sensors such as motion and light sensors.\n\nIf you don't configure this policy, the global default value from the \"DefaultSensorsSetting\" policy (if set) or the user's personal configuration is used for all sites.\n\nFor URL patterns that don't match this policy, the following order of precedence is used: The \"SensorsBlockedForUrls\" policy (if there is a match), the \"DefaultSensorsSetting\" policy (if set), or the user's personal settings.\n\nThe URL patterns defined in this policy can't conflict with those configured in the \"SensorsBlockedForUrls\" policy. You can't allow and block a URL.\n\nFor detailed information about valid URL patterns, please see https://go.microsoft.com/fwlink/?linkid=2095322.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "SensorsAllowedForUrls"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#sensorsallowedforurls"
                }
            ]
        },
        "SensorsBlockedForUrls": {
            "title": "SensorsBlockedForUrls - Block access to sensors on specific sites",
            "description": "Define a list of sites, based on URL patterns, that can't access sensors such as motion and light sensors.\n\nIf you don't configure this policy, the global default value from the \"DefaultSensorsSetting\" policy (if set) or the user's personal configuration is used for all sites.\n\nFor URL patterns that don't match this policy, the following order of precedence is used: The \"SensorsAllowedForUrls\" policy (if there is a match), the \"DefaultSensorsSetting\" policy (if set), or the user's personal settings.\n\nThe URL patterns defined in this policy can't conflict with those configured in the \"SensorsAllowedForUrls\" policy. You can't allow and block a URL.\n\nFor detailed information about valid URL patterns, please see https://go.microsoft.com/fwlink/?linkid=2095322.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "SensorsBlockedForUrls"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#sensorsblockedforurls"
                }
            ]
        },
        "SerialAskForUrls": {
            "title": "SerialAskForUrls - Allow the Serial API on specific sites",
            "description": "Define a list of sites, based on URL patterns, that can ask the user for access to a serial port.\n\nIf you don't configure this policy, the global default value from the \"DefaultSerialGuardSetting\" policy (if set) or the user's personal configuration is used for all sites.\n\nFor URL patterns that don't match this policy, the following order of precedence is used: The \"SerialBlockedForUrls\" policy (if there is a match), the \"DefaultSerialGuardSetting\" policy (if set), or the user's personal settings.\n\nThe URL patterns defined in this policy can't conflict with those configured in the \"SerialBlockedForUrls\" policy. You can't allow and block a URL.\n\nFor detailed information about valid url patterns, please see https://go.microsoft.com/fwlink/?linkid=2095322.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "SerialAskForUrls"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#serialaskforurls"
                }
            ]
        },
        "SerialBlockedForUrls": {
            "title": "SerialBlockedForUrls - Block the Serial API on specific sites",
            "description": "Define a list of sites, based on URL patterns, that can't ask the user to grant them access to a serial port.\n\nIf you don't configure this policy, the global default value from the \"DefaultSerialGuardSetting\" policy (if set) or the user's personal configuration is used for all sites.\n\nFor URL patterns that don't match this policy, the following order of precedence is used: The \"SerialAskForUrls\" policy (if there is a match), the \"DefaultSerialGuardSetting\" policy (if set), or the user's personal settings.\n\nThe URL patterns in this policy can't conflict with those configured in the \"SerialAskForUrls\" policy. You can't allow and block a URL.\n\nFor detailed information about valid URL patterns, see https://go.microsoft.com/fwlink/?linkid=2095322.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "SerialBlockedForUrls"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#serialblockedforurls"
                }
            ]
        },
        "SharedArrayBufferUnrestrictedAccessAllowed": {
            "title": "Allow SharedArrayBuffers in a non cross-origin-isolated context",
            "description": "(SharedArrayBufferUnrestrictedAccessAllowed)-Specifies whether SharedArrayBuffers can be used in a non cross-origin-isolated context. A SharedArrayBuffer is a binary data buffer that can be used to create views on shared memory. SharedArrayBuffers have a memory access vulnerability in several popular CPUs",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "links": [
                        {
                            "rel": "Documentation Link",
                            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#sharedarraybufferunrestrictedaccessallowed"
                        }
                    ],
                    "type": "boolean"
                }
            ]
        },
        "ShowMicrosoftRewards": {
            "title": "ShowMicrosoftRewards - Show Microsoft Rewards experiences",
            "description": "Show Microsoft Rewards experience and notifications.\nIf you enable this policy:\n   - Microsoft account users (excludes Azure AD accounts) in search and earn markets will see the Microsoft Rewards experience in their Microsoft Edge user profile.\n   - The setting to enable Microsoft Rewards in Microsoft Edge settings will be enabled and toggled on.\n   - The setting to enable Give mode will be enabled and respect the user's setting.\n\nIf you disable this policy:\n   - Microsoft account users (excludes Azure AD accounts) in search and earn markets will not see the Microsoft Rewards experience in their Microsoft Edge user profile.\n   - The setting to enable Microsoft Rewards in Microsoft Edge settings will be disabled and toggled off.\n\nIf you don't configure this policy:\n   - Microsoft account users (excludes Azure AD accounts) in search and earn markets will see the Microsoft Rewards experience in their Microsoft Edge user profile.\n   - The setting to enable Microsoft Rewards in Microsoft Edge settings will be enabled and toggled on.\n   - The setting to enable Give mode will be enabled and respect the user's setting.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ShowMicrosoftRewards"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#showmicrosoftrewards"
                }
            ]
        },
        "ShowOfficeShortcutInFavoritesBar": {
            "title": "ShowOfficeShortcutInFavoritesBar - Show Microsoft Office shortcut in favorites bar",
            "description": "This policy didn't work as expected due to changes in operational requirements. Therefore it's deprecated and should not be used.\n\nSpecifies whether to include a shortcut to Office.com in the favorites bar. For users signed into Microsoft Edge the shortcut takes users to their Microsoft Office apps and docs.\n  If you enable or don't configure this policy, users can choose whether to see the shortcut by changing the toggle in the favorites bar context menu.\n  If you disable this policy, the shortcut isn't shown.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "ShowOfficeShortcutInFavoritesBar"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#showofficeshortcutinfavoritesbar"
                }
            ]
        },
        "SignedHTTPExchangeEnabled": {
            "title": "SignedHTTPExchangeEnabled - Enable Signed HTTP Exchange (SXG) support",
            "description": "Enable support for Signed HTTP Exchange (SXG).\n\nIf this policy isn't set or enabled, Microsoft Edge will accept web contents served as Signed HTTP Exchanges.\n\nIf this policy is set to disabled, Signed HTTP Exchanges can't be loaded.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "SignedHTTPExchangeEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#signedhttpexchangeenabled"
                }
            ]
        },
        "SitePerProcess": {
            "title": "SitePerProcess - Enable site isolation for every site",
            "description": "The 'SitePerProcess' policy can be used to prevent users from opting out of the default behavior of isolating all sites. Note that you can also use the \"IsolateOrigins\" policy to isolate additional, finer-grained origins.\n\nIf you enable this policy, users can't opt out of the default behavior where each site runs in its own process.\n\nIf you disable or don't configure this policy, a user can opt out of site isolation.  (For example, by using \"Disable site isolation\" entry in edge://flags.)  Disabling the policy or not configuring the policy doesn't turn off Site Isolation.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "SitePerProcess"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#siteperprocess"
                }
            ]
        },
        "SpeechRecognitionEnabled": {
            "title": "SpeechRecognitionEnabled - Configure Speech Recognition",
            "description": "Set whether websites can use the W3C Web Speech API to recognize speech from the user. The Microsoft Edge implementation of the Web Speech API uses Azure Cognitive Services, so voice data will leave the machine.\n\nIf you enable or don't configure this policy, web-based applications that use the Web Speech API can use Speech Recognition.\n\nIf you disable this policy, Speech Recognition is not available through the Web Speech API.\n\nRead more about this feature here:\nSpeechRecognition API: https://go.microsoft.com/fwlink/?linkid=2143388\nCognitive Services: https://go.microsoft.com/fwlink/?linkid=2143680",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "SpeechRecognitionEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#speechrecognitionenabled"
                }
            ]
        },
        "SpellcheckEnabled": {
            "title": "SpellcheckEnabled - Enable spellcheck",
            "description": "If you enable or don't configure this policy, the user can use spellcheck.\n\nIf you disable this policy, the user can't use spellcheck and the \"SpellcheckLanguage\" and \"SpellcheckLanguageBlocklist\" policies are also disabled.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "SpellcheckEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#spellcheckenabled"
                }
            ]
        },
        "StricterMixedContentTreatmentEnabled": {
            "title": "StricterMixedContentTreatmentEnabled - Enable stricter treatment for mixed content",
            "description": "This policy is deprecated because it's only intended to be a short-term mechanism to give enterprises more time to update their web content if and when it's found to be incompatible with stricter mixed content treatment. It won't work in Microsoft Edge version 85.\n\nThis policy controls the treatment for mixed content (HTTP content in HTTPS sites) in the browser.\n\nIf you set this policy to true or not set, audio and video mixed content will be automatically upgraded to HTTPS (that is, the URL will be rewritten as HTTPS, without a fallback if the resource isn't available over HTTPS) and a 'Not Secure' warning will be shown in the URL bar for image mixed content.\n\nIf you set the policy to false, auto upgrades will be disabled for audio and video, and no warning will be shown for images.\n\nThis policy does not affect other types of mixed content other than audio, video, and images.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "StricterMixedContentTreatmentEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#strictermixedcontenttreatmentenabled"
                }
            ]
        },
        "SuppressUnsupportedOSWarning": {
            "title": "SuppressUnsupportedOSWarning - Suppress the unsupported OS warning",
            "description": "Suppresses the warning that appears when Microsoft Edge is running on a computer or operating system that is no longer supported.\n\nIf this policy is false or unset, the warnings will appear on such unsupported computers or operating systems.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "SuppressUnsupportedOSWarning"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#suppressunsupportedoswarning"
                }
            ]
        },
        "SyncDisabled": {
            "title": "SyncDisabled - Disable synchronization of data using Microsoft sync services",
            "description": "Disables data synchronization in Microsoft Edge. This policy also prevents the sync consent prompt from appearing.\n\nIf you don't set this policy or apply it as recommended, users will be able to turn sync on or off. If you apply this policy as mandatory, users will not be able to turn sync on.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "SyncDisabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#syncdisabled"
                }
            ]
        },
        "SyncTypesListDisabled": {
            "title": "SyncTypesListDisabled - Configure the list of types that are excluded from synchronization",
            "description": "If you enable this policy all the specified data types will be excluded from synchronization. This policy can be used to limit the type of data uploaded to the Microsoft Edge synchronization service.\n\nYou can provide one of the following data types for this policy: \"favorites\", \"settings\", \"passwords\", \"addressesAndMore\", \"extensions\", \"history\", \"openTabs\", and \"collections\". Note that these data type names are case sensitive.\n\nUsers will not be able to override the disabled data types.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "SyncTypesListDisabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#synctypeslistdisabled"
                }
            ]
        },
        "TLSCipherSuiteDenyList": {
            "title": "TLSCipherSuiteDenyList - Specify the TLS cipher suites to disable",
            "description": "Configure the list of cipher suites that are disabled for TLS connections.\n\nIf you configure this policy, the list of configured cipher suites will not be used when establishing TLS connections.\n\nIf you don't configure this policy, the browser will choose which TLS cipher suites to use.\n\nCipher suite values to be disabled are specified as 16-bit hexadecimal values. The values are assigned by the Internet Assigned Numbers Authority (IANA) registry.\n\nThe TLS 1.3 cipher suite TLS_AES_128_GCM_SHA256 (0x1301) is required for TLS 1.3 and can't be disabled by this policy.\n\nThis policy does not affect QUIC-based connections. QUIC can be turned off via the \"QuicAllowed\" policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "TLSCipherSuiteDenyList"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#tlsciphersuitedenylist"
                }
            ]
        },
        "TargetBlankImpliesNoOpener": {
            "title": "TargetBlankImpliesNoOpener - Do not set window.opener for links targeting _blank",
            "description": "If you enable this policy or leave it unset, the window.opener property is set to null unless the anchor specifies rel=\"opener\".\n\nIf you disable this policy, popups that target _blank are permitted to access (via JavaScript) the page that requested to open the popup.\n\nThis policy will be obsoleted in Microsoft Edge version 95.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "TargetBlankImpliesNoOpener"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#targetblankimpliesnoopener"
                }
            ]
        },
        "TaskManagerEndProcessEnabled": {
            "title": "TaskManagerEndProcessEnabled - Enable ending processes in the Browser task manager",
            "description": "If you enable or don't configure this policy, users can end processes in the Browser task manager. If you disable it, users can't end processes, and the End process button is disabled in the Browser task manager.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "TaskManagerEndProcessEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#taskmanagerendprocessenabled"
                }
            ]
        },
        "TotalMemoryLimitMb": {
            "title": "TotalMemoryLimitMb - Set limit on megabytes of memory a single Microsoft Edge instance can use",
            "description": "Configures the amount of memory that a single Microsoft Edge instance can use before tabs start getting discarded to save memory. The memory used by the tab will be freed and the tab will have to be reloaded when switched to.\n\nIf you enable this policy, the browser will start to discard tabs to save memory once the limitation is exceeded. However, there is no guarantee that the browser is always running under the limit. Any value under 1024 will be rounded up to 1024.\n\nIf you don't set this policy, the browser will only attempt to save memory when it has detected that the amount of physical memory on its machine is low.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer"
                }
            ],
            "options": {
                "infoText": "TotalMemoryLimitMb"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#totalmemorylimitmb"
                }
            ]
        },
        "TrackingPrevention": {
            "title": "TrackingPrevention - Block tracking of users' web-browsing activity",
            "description": "Lets you decide whether to block websites from tracking users' web-browsing activity.\n\nIf you disable this policy or don't configure it, users can set their own level of tracking prevention.\n\nPolicy options mapping:\n\n* TrackingPreventionOff (0) = Off (no tracking prevention)\n\n* TrackingPreventionBasic (1) = Basic (blocks harmful trackers, content and ads will be personalized)\n\n* TrackingPreventionBalanced (2) = Balanced (blocks harmful trackers and trackers from sites user has not visited; content and ads will be less personalized)\n\n* TrackingPreventionStrict (3) = Strict (blocks harmful trackers and majority of trackers from all sites; content and ads will have minimal personalization. Some parts of sites might not work)\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "TrackingPreventionOff - Off (no tracking prevention)",
                            "TrackingPreventionBasic - Basic (blocks harmful trackers, content and ads will be personalized)",
                            "TrackingPreventionBalanced - Balanced (blocks harmful trackers and trackers from sites user has not visited; content and ads will be less personalized)",
                            "TrackingPreventionStrict - Strict (blocks harmful trackers and majority of trackers from all sites; content and ads will have minimal personalization. Some parts of sites might not work)"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2,
                        3
                    ]
                }
            ],
            "options": {
                "infoText": "TrackingPrevention"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#trackingprevention"
                }
            ]
        },
        "TranslateEnabled": {
            "title": "TranslateEnabled - Enable Translate",
            "description": "Enables the integrated Microsoft translation service on Microsoft Edge.\n\nIf you enable this policy, Microsoft Edge offers translation functionality to the user by showing an integrated translate flyout when appropriate, and a translate option on the right-click context menu.\n\nDisable this policy to disable all built-in translate features.\n\nIf you don't configure the policy, users can choose whether to use the translation functionality or not.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "TranslateEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#translateenabled"
                }
            ]
        },
        "UpdatePolicyOverride": {
            "title": "Microsoft Edge Auto Update Behavior",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#updatepolicyoverride"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "enum_titles": [
                            "Automatic Silent Updates Only",
                            "Manual Check Only"
                        ]
                    },
                    "enum": [
                        "automatic-silent-only",
                        "manual-only"
                    ]
                }
            ]
        },
        "URLAllowlist": {
            "title": "URLAllowlist - Define a list of allowed URLs",
            "description": "Setting the policy provides access to the listed URLs, as exceptions to \"URLBlocklist\".\n\nFormat the URL pattern according to https://go.microsoft.com/fwlink/?linkid=2095322.\n\nYou can use this policy to open exceptions to restrictive block lists. For example, you can include '*' in the block list to block all requests, and then use this policy to allow access to a limited list of URLs. You can use this policy to open exceptions to certain schemes, subdomains of other domains, ports, or specific paths.\n\nThe most specific filter determines if a URL is blocked or allowed. The allowed list takes precedence over the block list.\n\nThis policy is limited to 1000 entries; subsequent entries are ignored.\n\nThis policy also allows the browser to automatically invoke external applications registered as protocol handlers for protocols like \"tel:\" or \"ssh:\".\n\nIf you don't configure this policy, there are no exceptions to the block list in the \"URLBlocklist\" policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "URLAllowlist"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#urlallowlist"
                }
            ]
        },
        "URLBlocklist": {
            "title": "URLBlocklist - Block access to a list of URLs",
            "description": "Define a list of sites, based on URL patterns, that are blocked (your users can't load them).\n\nFormat the URL pattern according to https://go.microsoft.com/fwlink/?linkid=2095322.\n\nYou can define exceptions in the \"URLAllowlist\" policy. These policies are limited to 1000 entries; subsequent entries are ignored.\n\nNote that blocking internal 'edge://*' URLs isn't recommended - this may lead to unexpected errors.\n\nThis policy doesn't prevent the page from updating dynamically through JavaScript. For example, if you block 'contoso.com/abc', users might still be able to visit 'contoso.com' and click on a link to visit 'contoso.com/abc', as long as the page doesn't refresh.\n\nIf you don't configure this policy, no URLs are blocked.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "URLBlocklist"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#urlblocklist"
                }
            ]
        },
        "UserAgentClientHintsEnabled": {
            "title": "UserAgentClientHintsEnabled - Enable the User-Agent Client Hints feature",
            "description": "This policy is deprecated because it's only intended to be a short-term mechanism to give enterprises more time to update their web content if and when it's found to be incompatible with the User-Agent Client Hints feature. It won't work in Microsoft Edge version 89.\n\nWhen enabled the User-Agent Client Hints feature sends granular request headers that provide information about the user browser (for example, the browser version) and environment (for example, the system architecture).\n\nThis is an additive feature, but the new headers may break some websites that restrict the characters that requests may contain.\n\nIf you enable or don't configure this policy, the User-Agent Client Hints feature is enabled. If you disable this policy, this feature is unavailable.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "UserAgentClientHintsEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#useragentclienthintsenabled"
                }
            ]
        },
        "UserDataDir": {
            "title": "UserDataDir - Set the user data directory",
            "description": "Set the directory to use for storing user data.\n\nIf you enable this policy, Microsoft Edge uses the specified directory regardless of whether the user has set the '--user-data-dir' command-line flag.\n\nIf you don't enable this policy, the default profile path is used, but the user can override it by using the '--user-data-dir' flag. Users can find the directory for the profile at edge://version/ under profile path.\n\nTo avoid data loss or other errors, don't configure this policy to a volume's root directory or to a directory that's used for other purposes, because Microsoft Edge manages its contents.\n\nSee https://go.microsoft.com/fwlink/?linkid=2095041 for a list of variables that can be used.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "UserDataDir"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#userdatadir"
                }
            ]
        },
        "UserFeedbackAllowed": {
            "title": "UserFeedbackAllowed - Allow user feedback",
            "description": "Microsoft Edge uses the Edge Feedback feature (enabled by default) to allow users to send feedback, suggestions or customer surveys and to report any issues with the browser. Also, by default, users can't disable (turn off) the Edge Feedback feature.\n\nIf you enable this policy or don't configure it, users can invoke Edge Feedback.\n\nIf you disable this policy, users can't invoke Edge Feedback.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "UserFeedbackAllowed"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#userfeedbackallowed"
                }
            ]
        },
        "VerticalTabsAllowed": {
            "title": "VerticalTabsAllowed - Configures availability of a vertical layout for tabs on the side of the browser",
            "description": "Configures whether a user can access an alternative layout where tabs are vertically aligned on the side of the browser instead of at the top.\nWhen there are several tabs open, this layout provides better tab viewing and management. There's better visibility of the site titles,\nit's easier to scan aligned icons, and there's more space to manage and close tabs.\n\nIf you disable this policy, then the vertical tab layout will not be available as an option for users.\n\nIf you enable or don't configure this policy, the tab layout will still be at the top, but a user has the option to turn on vertical tabs on the side.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "VerticalTabsAllowed"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#verticaltabsallowed"
                }
            ]
        },
        "VideoCaptureAllowed": {
            "title": "VideoCaptureAllowed - Allow or block video capture",
            "description": "Control whether sites can capture video.\n\nIf enabled or not configured (default), the user will be asked about video capture access for all sites except those with URLs configured in the \"VideoCaptureAllowedUrls\" policy list, which will be granted access without prompting.\n\nIf you disable this policy, the user isn't prompted, and video capture is only available to URLs configured in \"VideoCaptureAllowedUrls\" policy.\n\nThis policy affects all types of video inputs, not only the built-in camera.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "VideoCaptureAllowed"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#videocaptureallowed"
                }
            ]
        },
        "VideoCaptureAllowedUrls": {
            "title": "VideoCaptureAllowedUrls - Sites that can access video capture devices without requesting permission",
            "description": "Specify websites, based on URL patterns, that can use video capture devices without asking the user for permission. Patterns in this list are matched against the security origin of the requesting URL. If they match, the site is automatically granted access to video capture devices.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "VideoCaptureAllowedUrls"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#videocaptureallowedurls"
                }
            ]
        },
        "WPADQuickCheckEnabled": {
            "title": "WPADQuickCheckEnabled - Set WPAD optimization",
            "description": "Allows you to turn off WPAD (Web Proxy Auto-Discovery) optimization in Microsoft Edge.\n\nIf you disable this policy, WPAD optimization is disabled, which makes the browser wait longer for DNS-based WPAD servers.\n\nIf you enable or don't configure the policy, WPAD optimization is enabled.\n\nIndependent of whether or how this policy is enabled, the WPAD optimization setting cannot be changed by users.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "WPADQuickCheckEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#wpadquickcheckenabled"
                }
            ]
        },
        "WebAppInstallForceList": {
            "title": "WebAppInstallForceList - not configurable in UI, please craft plist",
            "description": "Configure this policy to specify a list of web apps that install silently, without user interaction, and which users can't uninstall or turn off.\n\nEach list item of the policy is an object with a mandatory member: url (the URL of the web app to install) and 2 optional members: default_launch_container (specifies the window mode that the web app opens with-a new tab is the default) and create_desktop_shortcut (True if you want to create Linux and Windows desktop shortcuts).",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                }
            ],
            "options": {
                "infoText": "WebAppInstallForceList"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#webappinstallforcelist"
                }
            ]
        },
        "WebCaptureEnabled": {
            "title": "WebCaptureEnabled - Enable web capture feature in Microsoft Edge",
            "description": "Enables the web capture feature in Microsoft Edge that allows users to capture web content and annotate the capture using inking tools.\nIf you enable this policy or don't configure it, the Web capture option shows up in the context menu, Settings and more menu, and by using the keyboard shortcut, CTRL+SHIFT+S.\nIf you disable this policy, users can't access the web capture feature in Microsoft Edge.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "WebCaptureEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#webcaptureenabled"
                }
            ]
        },
        "WebRtcAllowLegacyTLSProtocols": {
            "title": "WebRtcAllowLegacyTLSProtocols - Allow legacy TLS/DTLS downgrade in WebRTC",
            "description": "If you enable this policy, WebRTC peer connections can downgrade to obsolete\nversions of the TLS/DTLS (DTLS 1.0, TLS 1.0 and TLS 1.1) protocols.\nIf you disable or don't set this policy, these TLS/DTLS versions are\ndisabled.\n\nThis policy is temporary and will be removed in a future version\nof Microsoft Edge.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "WebRtcAllowLegacyTLSProtocols"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#webrtcallowlegacytlsprotocols"
                }
            ]
        },
        "WebRtcLocalIpsAllowedUrls": {
            "title": "WebRtcLocalIpsAllowedUrls - Manage exposure of local IP addressess by WebRTC",
            "description": "Specifies a list of origins (URLs) or hostname patterns (like \"*contoso.com*\") for which local IP address should be exposed by WebRTC.\n\nIf you enable this policy and set a list of origins (URLs) or hostname patterns, when edge://flags/#enable-webrtc-hide-local-ips-with-mdns is Enabled, WebRTC will expose the local IP address for cases that match patterns in the list.\n\nIf you disable or don't configure this policy, and edge://flags/#enable-webrtc-hide-local-ips-with-mdns is Enabled, WebRTC will not expose local IP addresses. The local IP address is concealed with an mDNS hostname.\n\nIf you enable, disable, or don't configure this policy, and edge://flags/#enable-webrtc-hide-local-ips-with-mdns is Disabled, WebRTC will expose local IP addresses.\n\nPlease note that this policy weakens the protection of local IP addresses that might be needed by administrators.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "WebRtcLocalIpsAllowedUrls"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#webrtclocalipsallowedurls"
                }
            ]
        },
        "WebRtcLocalhostIpHandling": {
            "title": "WebRtcLocalhostIpHandling - Restrict exposure of local IP address by WebRTC",
            "description": "Allows you to set whether or not WebRTC exposes the user's local IP address.\n\nIf you set this policy to \"AllowAllInterfaces\" or \"AllowPublicAndPrivateInterfaces\", WebRTC exposes the local IP address.\n\nIf you set this policy to \"AllowPublicInterfaceOnly\" or \"DisableNonProxiedUdp\", WebRTC doesn't expose the local IP address.\n\nIf you don't set this policy, or if you disable it, WebRTC exposes the local IP address.\n\nPolicy options mapping:\n\n* AllowAllInterfaces (default) = Allow all interfaces. This exposes the local IP address\n\n* AllowPublicAndPrivateInterfaces (default_public_and_private_interfaces) = Allow public and private interfaces over http default route. This exposes the local IP address\n\n* AllowPublicInterfaceOnly (default_public_interface_only) = Allow public interface over http default route. This doesn't expose the local IP address\n\n* DisableNonProxiedUdp (disable_non_proxied_udp) = Use TCP unless proxy server supports UDP. This doesn't expose the local IP address\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "enum_titles": [
                            "AllowAllInterfaces - Allow all interfaces. This exposes the local IP address",
                            "AllowPublicAndPrivateInterfaces - Allow public and private interfaces over http default route. This exposes the local IP address",
                            "AllowPublicInterfaceOnly - Allow public interface over http default route. This doesn't expose the local IP address",
                            "DisableNonProxiedUdp - Use TCP unless proxy server supports UDP. This doesn't expose the local IP address"
                        ]
                    },
                    "enum": [
                        "default",
                        "default_public_and_private_interfaces",
                        "default_public_interface_only",
                        "disable_non_proxied_udp"
                    ]
                }
            ],
            "options": {
                "infoText": "WebRtcLocalhostIpHandling"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#webrtclocalhostiphandling"
                }
            ]
        },
        "WebRtcUdpPortRange": {
            "title": "WebRtcUdpPortRange - Restrict the range of local UDP ports used by WebRTC",
            "description": "Restricts the UDP port range used by WebRTC to a specified port interval (endpoints included).\n\nBy configuring this policy, you specify the range of local UDP ports that WebRTC can use.\n\nIf you don't configure this policy, or if you set it to an empty string or invalid port range, WebRTC can use any available local UDP port.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "WebRtcUdpPortRange"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#webrtcudpportrange"
                }
            ]
        },
        "WebUsbAllowDevicesForUrls": {
            "title": "WebUsbAllowDevicesForUrls - not configurable in UI, please craft plist",
            "description": "Allows you to set a list of urls that specify which sites will automatically be granted permission to access a USB device with the given vendor and product IDs. Each item in the list must contain both devices and urls in order for the policy to be valid. Each item in devices can contain a vendor ID and product ID field. Any ID that is omitted is treated as a wildcard with one exception, and that exception is that a product ID cannot be specified without a vendor ID also being specified. Otherwise, the policy will not be valid and will be ignored.\n\nThe USB permission model uses the URL of the requesting site (\"requesting URL\") and the URL of the top-level frame site (\"embedding URL\") to grant permission to the requesting URL to access the USB device. The requesting URL may be different than the embedding URL when the requesting site is loaded in an iframe. Therefore, the \"urls\" field can contain up to two URL strings delimited by a comma to specify the requesting and embedding URL respectively. If only one URL is specified, then access to the corresponding USB devices will be granted when the requesting site's URL matches this URL regardless of embedding status. The URLs in \"urls\" must be valid URLs, otherwise the policy will be ignored.\n\nIf this policy is left not set, the global default value will be used for all sites either from the \"DefaultWebUsbGuardSetting\" policy if it is set, or the user's personal configuration otherwise.\n\nURL patterns in this policy should not clash with the ones configured via \"WebUsbBlockedForUrls\". If there is a clash, this policy will take precedence over \"WebUsbBlockedForUrls\" and \"WebUsbAskForUrls\".",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                }
            ],
            "options": {
                "infoText": "WebUsbAllowDevicesForUrls"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#webusballowdevicesforurls"
                }
            ]
        },
        "WebUsbAskForUrls": {
            "title": "WebUsbAskForUrls - Allow WebUSB on specific sites",
            "description": "Define a list of sites, based on URL patterns, that can ask the user for access to a USB device.\n\nIf you don't configure this policy, the global default value from the \"DefaultWebUsbGuardSetting\" policy (if set) or the user's personal configuration is used for all sites.\n\nThe URL patterns defined in this policy can't conflict with those configured in the \"WebUsbBlockedForUrls\" policy - you can't both allow and block a URL. For detailed information on valid url patterns, please see https://go.microsoft.com/fwlink/?linkid=2095322",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "WebUsbAskForUrls"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#webusbaskforurls"
                }
            ]
        },
        "WebUsbBlockedForUrls": {
            "title": "WebUsbBlockedForUrls - Block WebUSB on specific sites",
            "description": "Define a list of sites, based on URL patterns, that can't ask the user to grant them access to a USB device.\n\nIf you don't configure this policy, the global default value from the \"DefaultWebUsbGuardSetting\" policy (if set) or the user's personal configuration is used for all sites.\n\nURL patterns in this policy can't conflict with those configured in the \"WebUsbAskForUrls\" policy. You can't both allow and block a URL.  For detailed information on valid url patterns, see https://go.microsoft.com/fwlink/?linkid=2095322.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "WebUsbBlockedForUrls"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#webusbblockedforurls"
                }
            ]
        }
    }
}
