{
    "title": "Microsoft Edge Password Manager and Protection Settings",
    "__version": "1.0",
    "__preferencedomain": "com.microsoft.Edge",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#password-manager-and-protection-policies"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "PasswordManagerEnabled": {
            "title": "PasswordManagerEnabled - Enable saving passwords to the password manager",
            "description": "Enable Microsoft Edge to save user passwords.\n\nIf you enable this policy, users can save their passwords in Microsoft Edge. The next time they visit the site, Microsoft Edge will enter the password automatically.\n\nIf you disable this policy, users can't save new passwords, but they can still use previously saved passwords.\n\nIf you enable or disable this policy, users can't change or override it in Microsoft Edge. If you don't configure it, users can save passwords, as well as turn this feature off.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "PasswordManagerEnabled"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#passwordmanagerenabled"
                }
            ]
        },
        "PasswordProtectionChangePasswordURL": {
            "title": "PasswordProtectionChangePasswordURL - Configure the change password URL",
            "description": "Configures the change password URL (HTTP and HTTPS schemes only).\n\nPassword protection service will send users to this URL to change their password after seeing a warning in the browser.\n\nIf you enable this policy, then password protection service sends users to this URL to change their password.\n\nIf you disable this policy or don't configure it, then password protection service will not redirect users to a change password URL.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "PasswordProtectionChangePasswordURL"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#passwordprotectionchangepasswordurl"
                }
            ]
        },
        "PasswordProtectionLoginURLs": {
            "title": "PasswordProtectionLoginURLs - Configure the list of enterprise login URLs where the password protection service should capture salted hashes of a password",
            "description": "Configure the list of enterprise login URLs (HTTP and HTTPS schemes only) where Microsoft Edge should capture the salted hashes of passwords and use it for password reuse detection.\n\nIf you enable this policy, the password protection service captures fingerprints of passwords on the defined URLs.\n\nIf you disable this policy or don't configure it, no password fingerprints are captured.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "PasswordProtectionLoginURLs"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#passwordprotectionloginurls"
                }
            ]
        },
        "PasswordProtectionWarningTrigger": {
            "title": "PasswordProtectionWarningTrigger - Configure password protection warning trigger",
            "description": "Allows you to control when to trigger password protection warning. Password protection alerts users when they reuse their protected password on potentially suspicious sites.\n\nYou can use the \"PasswordProtectionLoginURLs\" and \"PasswordProtectionChangePasswordURL\" policies to configure which passwords to protect.\n\nExemptions: Passwords for the sites listed in \"PasswordProtectionLoginURLs\" and \"PasswordProtectionChangePasswordURL\", as well as for the sites listed in \"SmartScreenAllowListDomains\", will not trigger a password-protection warning.\n\nSet to 'PasswordProtectionWarningOff' to not show password protection warningss.\n\nSet to 'PasswordProtectionWarningOnPasswordReuse' to show password protection warnings when the user reuses their protected password on a non-allowlisted site.\n\nIf you disable or don't configure this policy, then the warning trigger is not shown.\n\nPolicy options mapping:\n\n* PasswordProtectionWarningOff (0) = Password protection warning is off\n\n* PasswordProtectionWarningOnPasswordReuse (1) = Password protection warning is triggered by password reuse\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "PasswordProtectionWarningOff - Password protection warning is off",
                            "PasswordProtectionWarningOnPasswordReuse - Password protection warning is triggered by password reuse"
                        ]
                    },
                    "enum": [
                        0,
                        1,
                        2
                    ]
                }
            ],
            "options": {
                "infoText": "PasswordProtectionWarningTrigger"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#passwordprotectionwarningtrigger"
                }
            ]
        },
        "PasswordRevealEnabled": {
            "title": "PasswordRevealEnabled - Enable Password reveal button",
            "description": "Lets you configure the default display of the browser password reveal button for password input fields on websites.\n\nIf you enable or don't configure this policy, the browser user setting defaults to displaying the password reveal button.\n\nIf you disable this policy, the browser user setting won't display the password reveal button.\n\nFor accessibility, users can change the browser setting from the default policy.\n\nThis policy only affects the browser password reveal button, it doesn't affect websites' custom reveal buttons.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "PasswordRevealEnabled"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#passwordrevealenabled"
                }
            ]
        }
    }
}
