{
    "title": "Microsoft Edge Manageability Settings",
    "__version": "1.0",
    "__preferencedomain": "com.microsoft.Edge",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#manageability-policies"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "MAMEnabled": {
            "title": "Enable Mobile App Management",
            "description": "(MAMEnabled)-Allows the Microsoft Edge browser to retrieve policies from the Intune application management services and apply them to users' profiles. If you enable this policy or don't configure it, Mobile App Management (MAM) Policies can be applied. If you disable this policy, Microsoft Edge will not communicate with Intune to request MAM Policies",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        }
    }
}
