{
    "title": "Microsoft Edge SmartScreen Settings",
    "__version": "1.0",
    "__preferencedomain": "com.microsoft.Edge",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#smartscreen-settings-policies"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "PreventSmartScreenPromptOverride": {
            "title": "PreventSmartScreenPromptOverride - Prevent bypassing Microsoft Defender SmartScreen prompts for sites",
            "description": "This policy setting lets you decide whether users can override the Microsoft Defender SmartScreen warnings about potentially malicious websites.\n\nIf you enable this setting, users can't ignore Microsoft Defender SmartScreen warnings and they are blocked from continuing to the site.\n\nIf you disable or don't configure this setting, users can ignore Microsoft Defender SmartScreen warnings and continue to the site.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.",
            "property_order": 920,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "PreventSmartScreenPromptOverride"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#preventsmartscreenpromptoverride"
                }
            ]
        },
        "PreventSmartScreenPromptOverrideForFiles": {
            "title": "PreventSmartScreenPromptOverrideForFiles - Prevent bypassing of Microsoft Defender SmartScreen warnings about downloads",
            "description": "This policy lets you determine whether users can override Microsoft Defender SmartScreen warnings about unverified downloads.\n\nIf you enable this policy, users in your organization can't ignore Microsoft Defender SmartScreen warnings, and they're prevented from completing the unverified downloads.\n\nIf you disable or don't configure this policy, users can ignore Microsoft Defender SmartScreen warnings and complete unverified downloads.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.",
            "property_order": 925,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "PreventSmartScreenPromptOverrideForFiles"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#preventsmartscreenpromptoverrideforfiles"
                }
            ]
        },
        "SmartScreenAllowListDomains": {
            "title": "SmartScreenAllowListDomains - Configure the list of domains for which Microsoft Defender SmartScreen won't trigger warnings",
            "description": "Configure the list of Microsoft Defender SmartScreen trusted domains. This means:\nMicrosoft Defender SmartScreen won't check for potentially malicious resources like phishing software and other malware if the source URLs match these domains.\nThe Microsoft Defender SmartScreen download protection service won't check downloads hosted on these domains.\n\nIf you enable this policy, Microsoft Defender SmartScreen trusts these domains.\nIf you disable or don't set this policy, default Microsoft Defender SmartScreen protection is applied to all resources.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.\nAlso note that this policy does not apply if your organization has enabled Microsoft Defender Advanced Threat Protection. You must configure your allow and block lists in Microsoft Defender Security Center instead.",
            "property_order": 1145,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "SmartScreenAllowListDomains"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#smartscreenallowlistdomains"
                }
            ]
        },
        "SmartScreenEnabled": {
            "title": "SmartScreenEnabled - Configure Microsoft Defender SmartScreen",
            "description": "This policy setting lets you configure whether to turn on Microsoft Defender SmartScreen. Microsoft Defender SmartScreen provides warning messages to help protect your users from potential phishing scams and malicious software. By default, Microsoft Defender SmartScreen is turned on.\n\nIf you enable this setting, Microsoft Defender SmartScreen is turned on.\n\nIf you disable this setting, Microsoft Defender SmartScreen is turned off.\n\nIf you don't configure this setting, users can choose whether to use Microsoft Defender SmartScreen.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.",
            "property_order": 1150,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "SmartScreenEnabled"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#smartscreenenabled"
                }
            ]
        },
        "SmartScreenPuaEnabled": {
            "title": "SmartScreenPuaEnabled - Configure Microsoft Defender SmartScreen to block potentially unwanted apps",
            "description": "This policy setting lets you configure whether to turn on blocking for potentially unwanted apps with Microsoft Defender SmartScreen. Potentially unwanted app blocking with Microsoft Defender SmartScreen provides warning messages to help protect users from adware, coin miners, bundleware, and other low-reputation apps that are hosted by websites. Potentially unwanted app blocking with Microsoft Defender SmartScreen is turned off by default.\n\nIf you enable this setting, potentially unwanted app blocking with Microsoft Defender SmartScreen is turned on.\n\nIf you disable this setting, potentially unwanted app blocking with Microsoft Defender SmartScreen is turned off.\n\nIf you don't configure this setting, users can choose whether to use potentially unwanted app blocking with Microsoft Defender SmartScreen.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.",
            "property_order": 1155,
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "SmartScreenPuaEnabled"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#smartscreenpuaenabled"
                }
            ]
        }
    }
}
