{
    "title": "Microsoft Edge Native Messaging Settings",
    "__version": "1.0",
    "__preferencedomain": "com.microsoft.Edge",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#native-messaging-policies"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "NativeMessagingBlocklist": {
            "title": "NativeMessagingBlocklist - Configure native messaging block list",
            "description": "Specifies which native messaging hosts that shouldn't be used.\n\nUse '*' to block all native messaging hosts unless they are explicitly listed in the allow list.\n\nIf you don't configure this policy, Microsoft Edge will load all installed native messaging hosts.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "NativeMessagingBlocklist"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#nativemessagingblocklist"
                }
            ]
        },
        "NativeMessagingUserLevelHosts": {
            "title": "NativeMessagingUserLevelHosts - Allow user-level native messaging hosts (installed without admin permissions)",
            "description": "Enables user-level installation of native messaging hosts.\n\nIf you disable this policy, Microsoft Edge will only use native messaging hosts installed on the system level.\n\nBy default, if you don't configure this policy, Microsoft Edge will allow usage of user-level native messaging hosts.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "NativeMessagingUserLevelHosts"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#nativemessaginguserlevelhosts"
                }
            ]
        },
        "NativeMessagingAllowlist": {
            "title": "NativeMessagingAllowlist - Control which native messaging hosts users can use",
            "description": "List specific native messaging hosts that users can use in Microsoft Edge.\n\nBy default, all native messaging hosts are allowed. If you set the \"NativeMessagingBlocklist\" policy to *, all native messaging hosts are blocked, and only native messaging hosts listed in here are loaded.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "NativeMessagingAllowlist"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#nativemessagingallowlist"
                }
            ]
        }
    }
}
