{
    "title": "Microsoft Edge Extensions Settings",
    "__version": "1.0",
    "__preferencedomain": "com.microsoft.Edge",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#extensions-policies"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "BlockExternalExtensions": {
            "title": "BlockExternalExtensions - Blocks external extensions from being installed",
            "description": "Control the installation of external extensions.\n\nIf you enable this setting, external extensions are blocked from being installed.\n\nIf you disable this setting or leave it unset, external extensions are allowed to be installed.\n\nExternal extensions and their installation are documented at https://docs.microsoft.com/microsoft-edge/extensions-chromium/developer-guide/alternate-distribution-options.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "BlockExternalExtensions"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#blockexternalextensions"
                }
            ]
        },
        "ExtensionAllowedTypes": {
            "title": "ExtensionAllowedTypes - Configure allowed extension types",
            "description": "Setting the policy controls which apps and extensions may be installed in Microsoft Edge, which hosts they can interact with, and limits runtime access.\n\nIf you don't set this policy, there aren't any restrictions on acceptable extension and app types.\n\nExtensions and apps which have a type that's not on the list won't be installed. Each value should be one of these strings:\n\n* \"extension\"\n\n* \"theme\"\n\n* \"user_script\"\n\n* \"hosted_app\"\n\nSee the Microsoft Edge extensions documentation for more information about these types.\n\nNote: This policy also affects extensions and apps to be force-installed using \"ExtensionInstallForcelist\".",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "ExtensionAllowedTypes"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#extensionallowedtypes"
                }
            ]
        },
        "ExtensionInstallBlocklist": {
            "title": "ExtensionInstallBlocklist - Control which extensions cannot be installed",
            "description": "List specific extensions that users can NOT install in Microsoft Edge. When you deploy this policy, any extensions on this list that were previously installed will be disabled, and the user won't be able to enable them. If you remove an item from the list of blocked extensions, that extension is automatically re-enabled anywhere it was previously installed.\n\nUse \"*\" to block all extensions that aren't explicitly listed in the allow list.\n\nIf you don't configure this policy, users can install any extension in Microsoft Edge.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "ExtensionInstallBlocklist"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#extensioninstallblocklist"
                }
            ]
        },
        "ExtensionInstallForcelist": {
            "title": "ExtensionInstallForcelist - Control which extensions are installed silently",
            "description": "Set this policy to specify a list of apps and extensions that install silently, without user interaction. Users can't uninstall or turn off this setting. Permissions are granted implicitly, including the enterprise.deviceAttributes and enterprise.platformKeys extension APIs. Note: These 2 APIs aren't available to apps and extensions that aren't force-installed.\n\nIf you don't set this policy, no apps or extensions are autoinstalled and users can uninstall any app in Microsoft Edge.\n\nThis policy supercedes \"ExtensionInstallBlocklist\" policy. If a previously force-installed app or extension is removed from this list, Microsoft Edge automatically uninstalls it.\n\nOn Microsoft Windows instances, apps and extensions from outside the Microsoft Edge Add-ons website can only be forced installed if the instance is joined to a Microsoft Active Directory domain, and running Windows 10 Pro.\n\nOn macOS instances, apps and extensions from outside the Microsoft Edge Add-ons website can only be force installed if the instance is managed via MDM, or joined to a domain via MCX.\n\nThe source code of any extension can be altered by users with developer tools, potentially rendering the extension unfunctional. If this is a concern, configure the DeveloperToolsDisabled policy.\n\nEach list item of the policy is a string that contains an extension ID and, optionally, an \"update\" URL separated by a semicolon (;). The extension ID is the 32-letter string found, for example, on edge://extensions when in Developer mode. If specified, the \"update\" URL should point to an Update Manifest XML document ( https://go.microsoft.com/fwlink/?linkid=2095043 ). By default, the Microsoft Edge Add-ons website's update URL is used. The \"update\" URL set in this policy is only used for the initial installation; subsequent updates of the extension use the update URL in the extension's manifest.\n\nNote: This policy doesn't apply to InPrivate mode. Read about hosting extensions (https://docs.microsoft.com/microsoft-edge/extensions-chromium/enterprise/hosting-and-updating).",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "ExtensionInstallForcelist"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#extensioninstallforcelist"
                }
            ]
        },
        "ExtensionInstallSources": {
            "title": "ExtensionInstallSources - Configure extension and user script install sources",
            "description": "Define URLs that can install extensions and themes.\n\nDefine URLs that can install extensions and themes directly without having to drag and drop the packages to the edge://extensions page.\n\nEach item in this list is an extension-style match pattern (see https://go.microsoft.com/fwlink/?linkid=2095039). Users can easily install items from any URL that matches an item in this list. Both the location of the *.crx file and the page where the download is started from (in other words, the referrer) must be allowed by these patterns. Do not host the files at a location that requires authentication.\n\nThe \"ExtensionInstallBlocklist\" policy takes precedence over this policy. Any extensions that's on the block list won't be installed, even if it comes from a site on this list.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "ExtensionInstallSources"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#extensioninstallsources"
                }
            ]
        },
        "ExtensionInstallAllowlist": {
            "title": "ExtensionInstallAllowlist - Allow specific extensions to be installed",
            "description": "By default, all extensions are allowed. However, if you block all extensions by setting the 'ExtensionInstallBlockList' policy to \"*\", users can only install extensions defined in this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "ExtensionInstallAllowlist"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#extensioninstallallowlist"
                }
            ]
        },
        "ExtensionSettings": {
            "title": "Extensions Settings",
            "type": "object",
            "description": "By default, this defines Extension settings for all extensions. If you need to specificy specific extension permissions add them as unique JSON objects",
            "properties": {
                "*": {
                    "properties": {
                        "allowed_types": {
                            "title": "Allowed Extension Types",
                            "description": "extension, hosted_app, legacy_packaged_app, platform_app, theme, user_script are supported",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "array",
                                    "items": {
                                        "type": "string",
                                        "title": "Extension Type"
                                    }
                                }
                            ]
                        },
                        "blocked_install_message": {
                            "title": "Blocked Install Message",
                            "type": "string"
                        },
                        "blocked_permissions": {
                            "title": "Blocked API Permissions",
                            "links": [
                                {
                                    "rel": "Documentation Link",
                                    "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#extensionsettings"
                                }
                            ],
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "array",
                                    "items": {
                                        "type": "string",
                                        "title": "Permission"
                                    }
                                }
                            ]
                        },
                        "install_sources": {
                            "title": "Extension Install Sources",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "array",
                                    "items": {
                                        "type": "string",
                                        "title": "URL Pattern"
                                    }
                                }
                            ]
                        },
                        "installation_mode": {
                            "title": "Installation Mode",
                            "enum": [
                                "blocked",
                                "allowed",
                                "removed",
                                "force_installed",
                                "normal_installed"
                            ],
                            "type": "string"
                        },
                        "toolbar_pin": {
                            "title": "Toolbar Pin Style",
                            "enum": [
                                "force_pinned",
                                "default_unpinned"
                            ],
                            "type": "string"
                        },
                        "minimum_version_required": {
                            "title": "Minimum Version Required",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "string",
                                    "options": {
                                        "inputAttributes": {
                                            "placeholder": "1.1"
                                        }
                                    }
                                }
                            ]
                        },
                        "update_url": {
                            "title": "Update URL",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "string",
                                    "options": {
                                        "inputAttributes": {
                                            "placeholder": "https://clients2.google.com/service/update2/crx"
                                        }
                                    }
                                }
                            ]
                        },
                        "runtime_allowed_hosts": {
                            "title": "Allow Extension Interaction with Websites",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "array",
                                    "items": {
                                        "type": "string",
                                        "title": "URL Pattern"
                                    }
                                }
                            ]
                        },
                        "runtime_blocked_hosts": {
                            "title": "Prevent Extension Interaction with Websites",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "array",
                                    "items": {
                                        "type": "string",
                                        "title": "URL Pattern"
                                    }
                                }
                            ]
                        }
                    }
                }
            }
        }
    }
}
