{
    "title": "Microsoft Edge Sleeping Tabs Settings",
    "__version": "1.0",
    "__preferencedomain": "com.microsoft.Edge",
    "links": [
        {
            "rel": "Documentation Link",
            "href": "https://docs.microsoft.com/en-us/deployedge/microsoft-edge-policies#sleeping-tabs-settings-policies"
        }
    ],
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "SleepingTabsBlockedForUrls": {
            "title": "SleepingTabsBlockedForUrls - Block Sleeping Tabs on specific sites",
            "description": "Define a list of sites, based on URL patterns, that are not allowed to be put to sleep by Sleeping Tabs.\n\nIf the policy \"SleepingTabsEnabled\" is disabled, this list is not used and no sites will be put to sleep automatically.\n\nIf you don't configure this policy, all sites will be eligible to be put to sleep unless the user's personal configuration blocks them.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "SleepingTabsBlockedForUrls"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#sleepingtabsblockedforurls"
                }
            ]
        },
        "SleepingTabsEnabled": {
            "title": "SleepingTabsEnabled - Configure Sleeping Tabs",
            "description": "This policy setting lets you configure whether to turn on Sleeping Tabs. Sleeping Tabs reduces CPU, battery, and memory usage by putting idle background tabs to sleep. Microsoft Edge uses heuristics to avoid putting tabs to sleep that do useful work in the background, such as display notifications, play sound, and stream video. By default, Sleeping Tabs is turned on.\n\nIndividual sites may be blocked from being put to sleep by configuring the policy \"SleepingTabsBlockedForUrls\".\n\nIf you enable this setting, Sleeping Tabs is turned on.\n\nIf you disable this setting, Sleeping Tabs is turned off.\n\nIf you don't configure this setting, users can choose whether to use Sleeping Tabs.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "SleepingTabsEnabled"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#sleepingtabsenabled"
                }
            ]
        },
        "SleepingTabsTimeout": {
            "title": "SleepingTabsTimeout - Set the background tab inactivity timeout for Sleeping Tabs",
            "description": "This policy setting lets you configure the timeout, in seconds, after which inactive background tabs will be automatically put to sleep if Sleeping Tabs is enabled. By default, this timeout is 7,200 seconds (2 hours).\n\nTabs are only put to sleep automatically when the policy \"SleepingTabsEnabled\" is enabled or is not configured and the user has enabled the Sleeping Tabs setting.\n\nIf you don't configure this policy, users can choose the timeout value.\n\nPolicy options mapping:\n\n* 5Minutes (300) = 5 minutes of inactivity\n\n* 15Minutes (900) = 15 minutes of inactivity\n\n* 30Minutes (1800) = 30 minutes of inactivity\n\n* 1Hour (3600) = 1 hour of inactivity\n\n* 2Hours (7200) = 2 hours of inactivity\n\n* 3Hours (10800) = 3 hours of inactivity\n\n* 6Hours (21600) = 6 hours of inactivity\n\n* 12Hours (43200) = 12 hours of inactivity\n\nUse the preceding information when configuring this policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "options": {
                        "enum_titles": [
                            "5Minutes - 5 minutes of inactivity",
                            "15Minutes - 15 minutes of inactivity",
                            "30Minutes - 30 minutes of inactivity",
                            "1Hour - 1 hour of inactivity",
                            "2Hours - 2 hours of inactivity",
                            "3Hours - 3 hours of inactivity",
                            "6Hours - 6 hours of inactivity",
                            "12Hours - 12 hours of inactivity"
                        ]
                    },
                    "enum": [
                        300,
                        900,
                        1800,
                        3600,
                        7200,
                        10800,
                        21600,
                        43200
                    ]
                }
            ],
            "options": {
                "infoText": "SleepingTabsTimeout"
            },
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#sleepingtabstimeout"
                }
            ]
        }
    }
}
