{
    "title": "Microsoft Edge Default Search Provider Preferences",
    "__preferencedomain": "com.microsoft.Edge",
    "properties": {
        "DefaultSearchProviderContextMenuAccessAllowed": {
            "title": "DefaultSearchProviderContextMenuAccessAllowed - Allow default search provider context menu search access",
            "description": "Enables the use of a default search provider on the context menu.\n\nIf you set this policy to disabled the search context menu item that relies on your default search provider and sidebar search will not be available.\n\nIf this policy is set to enabled or not set, the context menu item for your default search provider and sidebar search will be available.\n\nThe policy value is only appled when the \"DefaultSearchProviderEnabled\" policy is enabled, and is not applicable otherwise.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "DefaultSearchProviderContextMenuAccessAllowed"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultsearchprovidercontextmenuaccessallowed"
                }
            ]
        },
        "DefaultSearchProviderEnabled": {
            "title": "DefaultSearchProviderEnabled - Enable the default search provider",
            "description": "Enables the ability to use a default search provider.\n\nIf you enable this policy, a user can search for a term by typing in the address bar (as long as what they type isn't a URL).\n\nYou can specify the default search provider to use by enabling the rest of the default search policies. If these are left empty (not configured) or configured incorrectly, the user can choose the default provider.\n\nIf you disable this policy, the user can't search from the address bar.\n\nIf you enable or disable this policy, users can't change or override it.\n\nIf you don't configure this policy, the default search provider is enabled, and the user can choose the default search provider and set the search provider list.\n\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX..\n\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ],
            "options": {
                "infoText": "DefaultSearchProviderEnabled"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultsearchproviderenabled"
                }
            ]
        },
        "DefaultSearchProviderEncodings": {
            "title": "DefaultSearchProviderEncodings - Default search provider encodings",
            "description": "Specify the character encodings supported by the search provider. Encodings are code page names like UTF-8, GB2312, and ISO-8859-1. They are tried in the order provided.\n\nThis policy is optional. If not configured, the default, UTF-8, is used.\n\nThis policy is applied only if you enable the \"DefaultSearchProviderEnabled\" and \"DefaultSearchProviderSearchURL\" policies.\n\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy. If the user has already set a default search provider, the default search provider configured by this recommended policy will not be added to the list of search providers the user can choose from. If this is the desired behavior, use the \"ManagedSearchEngines\" policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "string",
                        "title": "Entries"
                    }
                }
            ],
            "options": {
                "infoText": "DefaultSearchProviderEncodings"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultsearchproviderencodings"
                }
            ]
        },
        "DefaultSearchProviderImageURL": {
            "title": "DefaultSearchProviderImageURL - Specifies the search-by-image feature for the default search provider",
            "description": "Specifies the URL to the search engine used for image search. Search requests are sent using the GET method.\n\nThis policy is optional. If you don't configure it, image search isn't available.\n\nSpecify Bing's Image Search URL as:\n'{bing:baseURL}images/detail/search?iss=sbiupload&FORM=ANCMS1#enterInsights'.\n\nSpecify Google's Image Search URL as: '{google:baseURL}searchbyimage/upload'.\n\nSee \"DefaultSearchProviderImageURLPostParams\" policy to finish configuring image search.\n\nThis policy is applied only if you enable the \"DefaultSearchProviderEnabled\" and \"DefaultSearchProviderSearchURL\" policies.\n\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy. If the user has already set a default search provider, the default search provider configured by this recommended policy will not be added to the list of search providers the user can choose from. If this is the desired behavior, use the \"ManagedSearchEngines\" policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "DefaultSearchProviderImageURL"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultsearchproviderimageurl"
                }
            ]
        },
        "DefaultSearchProviderImageURLPostParams": {
            "title": "DefaultSearchProviderImageURLPostParams - Parameters for an image URL that uses POST",
            "description": "If you enable this policy, it specifies the parameters used when an image search that uses POST is performed. The policy consists of comma-separated name/value pairs. If a value is a template parameter, like {imageThumbnail} in the preceding example, it's replaced with real image thumbnail data. This policy is applied only if you enable the \"DefaultSearchProviderEnabled\" and \"DefaultSearchProviderSearchURL\" policies.\n\nSpecify Bing's Image Search URL Post Params as:\n'imageBin={google:imageThumbnailBase64}'.\n\nSpecify Google's Image Search URL Post Params as:\n'encoded_image={google:imageThumbnail},image_url={google:imageURL},sbisrc={google:imageSearchSource},original_width={google:imageOriginalWidth},original_height={google:imageOriginalHeight}'.\n\nIf you don't set this policy, image search requests are sent using the GET method.\n\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy. If the user has already set a default search provider, the default search provider configured by this recommended policy will not be added to the list of search providers the user can choose from. If this is the desired behavior, use the \"ManagedSearchEngines\" policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "DefaultSearchProviderImageURLPostParams"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultsearchproviderimageurlpostparams"
                }
            ]
        },
        "DefaultSearchProviderKeyword": {
            "title": "DefaultSearchProviderKeyword - Default search provider keyword",
            "description": "Specifies the keyword, which is the shortcut used in the Address Bar to trigger the search for this provider.\n\nThis policy is optional. If you don't configure it, no keyword activates the search provider.\n\nThis policy is applied only if you enable the \"DefaultSearchProviderEnabled\" and \"DefaultSearchProviderSearchURL\" policies.\n\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy. If the user has already set a default search provider, the default search provider configured by this recommended policy will not be added to the list of search providers the user can choose from. If this is the desired behavior, use the \"ManagedSearchEngines\" policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "DefaultSearchProviderKeyword"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultsearchproviderkeyword"
                }
            ]
        },
        "DefaultSearchProviderName": {
            "title": "DefaultSearchProviderName - Default search provider name",
            "description": "Specifies the name of the default search provider.\n\nIf you enable this policy, you set the name of the default search provider.\n\nIf you don't enable this policy or if you leave it empty, the host name specified by the search URL is used.\n\n'DefaultSearchProviderName' should be set to an organization-approved encrypted search provider that corresponds to the encrypted search provider set in DTBC-0008. This policy is applied only if you enable the \"DefaultSearchProviderEnabled\" and \"DefaultSearchProviderSearchURL\" policies.\n\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy. If the user has already set a default search provider, the default search provider configured by this recommended policy will not be added to the list of search providers the user can choose from. If this is the desired behavior, use the \"ManagedSearchEngines\" policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "DefaultSearchProviderName"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultsearchprovidername"
                }
            ]
        },
        "DefaultSearchProviderSearchURL": {
            "title": "DefaultSearchProviderSearchURL - Default search provider search URL",
            "description": "Specifies the URL of the search engine used for a default search. The URL contains the string '{searchTerms}', which is replaced at query time by the terms the user is searching for.\n\nSpecify Bing's search URL as:\n\n'{bing:baseURL}search?q={searchTerms}'.\n\nSpecify Google's search URL as: '{google:baseURL}search?q={searchTerms}&{google:RLZ}{google:originalQueryForSuggestion}{google:assistedQueryStats}{google:searchFieldtrialParameter}{google:searchClient}{google:sourceId}ie={inputEncoding}'.\n\nThis policy is required when you enable the \"DefaultSearchProviderEnabled\" policy; if you don't enable the latter policy, this policy is ignored.\n\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy. If the user has already set a default search provider, the default search provider configured by this recommended policy will not be added to the list of search providers the user can choose from. If this is the desired behavior, use the \"ManagedSearchEngines\" policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "DefaultSearchProviderSearchURL"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultsearchprovidersearchurl"
                }
            ]
        },
        "DefaultSearchProviderSuggestURL": {
            "title": "DefaultSearchProviderSuggestURL - Default search provider URL for suggestions",
            "description": "Specifies the URL for the search engine used to provide search suggestions. The URL contains the string '{searchTerms}', which is replaced at query time by the text the user has entered so far.\n\nThis policy is optional. If you don't configure it, users won't see search suggestions; they will see suggestions from their browsing history and favorites.\n\nBing's suggest URL can be specified as:\n\n'{bing:baseURL}qbox?query={searchTerms}'.\n\nGoogle's suggest URL can be specified as: '{google:baseURL}complete/search?output=chrome&q={searchTerms}'.\n\nThis policy is applied only if you enable the \"DefaultSearchProviderEnabled\" and \"DefaultSearchProviderSearchURL\" policies.\n\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy. If the user has already set a default search provider, the default search provider configured by this recommended policy will not be added to the list of search providers the user can choose from. If this is the desired behavior, use the \"ManagedSearchEngines\" policy.",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "options": {
                "infoText": "DefaultSearchProviderSuggestURL"
            },
            "links": [
                {
                    "rel": "Documentation for Policy",
                    "href": "https://docs.microsoft.com/deployedge/microsoft-edge-policies#defaultsearchprovidersuggesturl"
                }
            ]
        }
    }
}
