{
    "title": "Jamf Connect Sync Password Preferences",
    "__preferencedomain": "com.jamf.connect.sync",
    "properties": {
        "ChangePasswordTimer": {
            "title": "Change Password Timer",
            "description": "Specifies an interval, in minutes, until the user is prompted to sign in again after a password change",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "pattern": "[1-60]",
                    "default": "3"
                }
            ]
        },
        "LocalPasswordSync": {
            "title": "Sync Local and Network Passwords",
            "description": "Determines if the Okta password is synchronized with the local account",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "LocalPasswordSyncMessage": {
            "title": "Sync Passwords Message",
            "description": "Specifies the alert dialog text displayed to the user when asked to enter in their local password",
            "options": {
                "inputAttributes": {
                    "placeholder": "Please enter your local user account password..."
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "LocalPasswordSyncOnMatchOnly": {
            "title": "Only Sync Matching Account Names",
            "description": "Syncs the password only if the Okta account name matches the local account name",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PasswordChangeCommand": {
            "title": "Password Change Command",
            "description": "Specifies a script or other binary to be run after the user changes a password",
            "options": {
                "inputAttributes": {
                    "placeholder": "/usr/local/bin/change.sh"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "PasswordExpirationMenu": {
            "title": "Display Password Expiration Countdown",
            "description": "Determines if the countdown before password expiration is displayed in the menu bar",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "PasswordExpirationMenuDays": {
            "title": "Password Expiration Countdown Start Date",
            "description": "An integer, in days remaining, before the password expiration countdown is displayed in the menu bar",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "pattern": "[1-90]",
                    "default": "14"
                }
            ]
        },
        "PasswordPolicy": {
            "title": "Password Policy",
            "description": "Defines the password complexity policy for changing the password via Kerberos",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array",
                    "items": {
                        "type": "object",
                        "properties": {
                            "minLength": {
                                "title": "Minimum Password Length",
                                "options": {
                                    "inputAttributes": {
                                        "placeholder": "8"
                                    }
                                },
                                "anyOf": [
                                    {
                                        "type": "null",
                                        "title": "Not Configured"
                                    },
                                    {
                                        "title": "Configured",
                                        "type": "string"
                                    }
                                ]
                            },
                            "minLowerCase": {
                                "title": "Minimum Number of Lowercase Characters",
                                "options": {
                                    "inputAttributes": {
                                        "placeholder": "1"
                                    }
                                },
                                "anyOf": [
                                    {
                                        "type": "null",
                                        "title": "Not Configured"
                                    },
                                    {
                                        "title": "Configured",
                                        "type": "string"
                                    }
                                ]
                            },
                            "minMatches": {
                                "title": "Minimum Number of Recycled Passwords",
                                "options": {
                                    "inputAttributes": {
                                        "placeholder": "1"
                                    }
                                },
                                "anyOf": [
                                    {
                                        "type": "null",
                                        "title": "Not Configured"
                                    },
                                    {
                                        "title": "Configured",
                                        "type": "string"
                                    }
                                ]
                            },
                            "minNumber": {
                                "title": "Minimum Number of Digits",
                                "options": {
                                    "inputAttributes": {
                                        "placeholder": "1"
                                    }
                                },
                                "anyOf": [
                                    {
                                        "type": "null",
                                        "title": "Not Configured"
                                    },
                                    {
                                        "title": "Configured",
                                        "type": "string"
                                    }
                                ]
                            },
                            "minSymbol": {
                                "title": "Minimum Number of Symbols",
                                "options": {
                                    "inputAttributes": {
                                        "placeholder": "1"
                                    }
                                },
                                "anyOf": [
                                    {
                                        "type": "null",
                                        "title": "Not Configured"
                                    },
                                    {
                                        "title": "Configured",
                                        "type": "string"
                                    }
                                ]
                            },
                            "minUpperCase": {
                                "title": "Minimum Number of Uppercase Characters",
                                "options": {
                                    "inputAttributes": {
                                        "placeholder": "1"
                                    }
                                },
                                "anyOf": [
                                    {
                                        "type": "null",
                                        "title": "Not Configured"
                                    },
                                    {
                                        "title": "Configured",
                                        "type": "string"
                                    }
                                ]
                            }
                        }
                    }
                }
            ]
        },
        "PasswordCheckUpdateTime": {
            "title": "Local Password Verification Interval",
            "description": "Specifies the interval, in minutes, that Jamf Connect Sync checks the local password for synchronization",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "pattern": "[1-60]",
                    "default": "15"
                }
            ]
        },
        "PeriodicUpdateTime": {
            "title": "Kerberos Password Verification Interval",
            "description": "Specifies how often Jamf Connect Sync checks a user's local Kerberos password and certificates",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "pattern": "[1-60]",
                    "default": "15"
                }
            ]
        },
        "WarnOnPasswordExpiration": {
            "title": "Password Expiration Warning on Sign-in",
            "description": "Determines whether Jamf Connect Sync should warn the user on sign in if the password is about to expire",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "ExpirationWarningDays": {
            "title": "Password Expiration Notification",
            "description": "Specifies an integer, in days, for Jamf Connect Sync to send notifications via the Notification Center for an upcoming password expiration",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "pattern": "[1-90]",
                    "default": "5"
                }
            ]
        }
    }
}
