{
    "title": "Jamf Connect Sync Menu Text Preferences",
    "__preferencedomain": "com.jamf.connect.sync",
    "properties": {
        "MenuAbout": {
            "title": "About Menu Text",
            "description": "Title of the About menu",
            "options": {
                "inputAttributes": {
                    "placeholder": "About"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "MenuActions": {
            "title": "Actions Menu Text",
            "description": "Title of the Actions menu item",
            "options": {
                "inputAttributes": {
                    "placeholder": "Actions"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "MenuChangePassword": {
            "title": "Change Password Menu Text",
            "description": "Title of the Change Password menu item",
            "options": {
                "inputAttributes": {
                    "placeholder": "Change Password"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "MenuGetHelp": {
            "title": "Get Help Menu Text",
            "description": "Title of the Get Help menu",
            "options": {
                "inputAttributes": {
                    "placeholder": "Get Help"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "MenuGetSoftware": {
            "title": "Get Software Menu Text",
            "description": "Title of the Get Software menu",
            "options": {
                "inputAttributes": {
                    "placeholder": "Get Software"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "MenuIcon": {
            "title": "Menu Icon",
            "description": "Path to the menu bar icon image",
            "options": {
                "inputAttributes": {
                    "placeholder": "/usr/local/images/icon.png"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "MenuLockScreen": {
            "title": "Lock Screen Menu Item",
            "options": {
                "inputAttributes": {
                    "placeholder": "Lock Screen"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "MenuPreferences": {
            "title": "Preferences Menu Text",
            "options": {
                "inputAttributes": {
                    "placeholder": "Preferences"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        },
        "MenuSignIn": {
            "title": "Sign In Menu Text",
            "description": "Menu item text for the Sign In item",
            "options": {
                "inputAttributes": {
                    "placeholder": "Sign In"
                }
            },
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ]
        }
    }
}
