{
    "title": "Microsoft Defender Preferences",
    "__preferencedomain": "com.microsoft.wdav",
    "properties": {
        "antivirusEngine": {
            "type": "object",
            "title": "Anti Virus Engine Properties",
            "properties": {
                "enableRealTimeProtection": {
                    "title": "Enable Real Time Protection",
                    "description": "Specify whether to enable real-time protection which scans files as they are accessed",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "boolean"
                        }
                    ]
                },
                "passiveMode": {
                    "title": "Passive Mode",
                    "description": "Specify whether the antivirus engine runs in passive mode. Passive mode has the following implications:Real-time protection is turned off,On-demand scanning is turned on, Automatic threat remediation is turned off, Security intelligence updates are turned on, Status menu icon is hidden",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "boolean"
                        }
                    ]
                },
                "exclusionsMergePolicy": {
                    "title": "Exclusion merge policy",
                    "description": "Specify the merge policy for exclusions. This can be a combination of administrator-defined and user-defined exclusions (merge) or only administrator-defined exclusions (admin_only). This setting can be used to restrict local users from defining their own exclusions",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "merge"
                        }
                    },
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "string"
                        }
                    ]
                },
                "exclusions": {
                    "type": "array",
                    "title": "Scan Exclusions",
                    "items": {
                        "type": "object",
                        "properties": {
                            "path": {
                                "title": "File System Path",
                                "description": "Full Path",
                                "type": "string"
                            },
                            "isDirectory": {
                                "title": "Target is a Directory",
                                "description": "Indicate if the path property refers to a file or directory",
                                "anyOf": [
                                    {
                                        "type": "null",
                                        "title": "Not Configured"
                                    },
                                    {
                                        "title": "Configured",
                                        "type": "boolean"
                                    }
                                ]
                            },
                            "extension": {
                                "title": "File Extension",
                                "description": "Specify content excluded from being scanned by file extension",
                                "options": {
                                    "inputAttributes": {
                                        "placeholder": "txt"
                                    }
                                },
                                "anyOf": [
                                    {
                                        "type": "null",
                                        "title": "Not Configured"
                                    },
                                    {
                                        "title": "Configured",
                                        "type": "string"
                                    }
                                ]
                            },
                            "name": {
                                "title": "Process Name",
                                "description": "Specify a process for which all file activity is excluded from scanning. The process can be specified either by its name (e.g. cat) or full path (e.g. /bin/cat)",
                                "options": {
                                    "inputAttributes": {
                                        "placeholder": "/bin/cat"
                                    }
                                },
                                "anyOf": [
                                    {
                                        "type": "null",
                                        "title": "Not Configured"
                                    },
                                    {
                                        "title": "Configured",
                                        "type": "string"
                                    }
                                ]
                            }
                        }
                    }
                },
                "allowedThreats": {
                    "title": "Allowed Threats",
                    "description": "Specify threats by name that are not blocked by Microsoft Defender ATP for Mac. These threats will be allowed to run",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "array",
                            "items": {
                                "type": "string"
                            }
                        }
                    ]
                },
                "disallowedThreatActions": {
                    "title": "Disallowed threat actions",
                    "description": "Restricts the actions that the local user of a device can take when threats are detected. The actions included in this list are not displayed in the user interface. allow (restricts users from allowing threats) restore (restricts users from restoring threats from the quarantine)",
                    "anyOf": [
                        {
                            "type": "null",
                            "title": "Not Configured"
                        },
                        {
                            "title": "Configured",
                            "type": "array",
                            "items": {
                                "type": "string"
                            }
                        }
                    ]
                },
                "threatTypeSettings": {
                    "type": "array",
                    "title": "Threat Type Settings",
                    "items": {
                        "type": "object",
                        "properties": {
                            "key": {
                                "title": "Threat Type Key",
                                "description": "potentially_unwanted_application and archive_bomb are supported",
                                "type": "string"
                            },
                            "value": {
                                "title": "Action to Take",
                                "description": "audit (default) block or off",
                                "options": {
                                    "inputAttributes": {
                                        "placeholder": "audit"
                                    }
                                },
                                "anyOf": [
                                    {
                                        "type": "null",
                                        "title": "Not Configured"
                                    },
                                    {
                                        "title": "Configured",
                                        "type": "string"
                                    }
                                ]
                            },
                            "threatTypeSettingsMergePolicy": {
                                "title": "Threat Type Merge Policy",
                                "description": "Specify the merge policy for threat type settings. This can be a combination of administrator-defined and user-defined settings (merge) or only administrator-defined settings (admin_only). This setting can be used to restrict local users from defining their own settings for different threat types",
                                "options": {
                                    "inputAttributes": {
                                        "placeholder": "merge"
                                    }
                                },
                                "anyOf": [
                                    {
                                        "type": "null",
                                        "title": "Not Configured"
                                    },
                                    {
                                        "title": "Configured",
                                        "type": "string"
                                    }
                                ]
                            }
                        }
                    }
                },
                "cloudService": {
                    "type": "object",
                    "title": "Cloud-delivered Protection Preferences",
                    "properties": {
                        "enabled": {
                            "title": "Enable Cloud Services",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "boolean"
                                }
                            ]
                        },
                        "diagnosticLevel": {
                            "title": "Diagnostic Level",
                            "description": "Diagnostic data is used to keep Microsoft Defender ATP secure and up-to-date, detect, diagnose and fix problems, and also make product improvements. This setting determines the level of diagnostics sent by Microsoft Defender ATP to Microsoft",
                            "options": {
                                "inputAttributes": {
                                    "placeholder": "optional or required are supported"
                                }
                            },
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "string"
                                }
                            ]
                        },
                        "automaticSampleSubmission": {
                            "title": "Enable Automatic Sample Submission",
                            "description": "Determines whether suspicious samples (that are likely to contain threats) are sent to Microsoft. You are prompted if the submitted file is likely to contain personal information",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "boolean"
                                }
                            ]
                        },
                        "automaticDefinitionUpdateEnabled": {
                            "title": "Enable Automatic Definition Updates",
                            "description": "Determines whether security intelligence updates are installed automatically",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "boolean"
                                }
                            ]
                        }
                    }
                },
                "userInterface": {
                    "type": "object",
                    "title": "User Interface Preferences",
                    "properties": {
                        "hideStatusMenuIcon": {
                            "title": "Hide Status Menu Icon",
                            "description": "Specify whether to show or hide the status menu icon in the top-right corner of the screen",
                            "anyOf": [
                                {
                                    "type": "null",
                                    "title": "Not Configured"
                                },
                                {
                                    "title": "Configured",
                                    "type": "boolean"
                                }
                            ]
                        }
                    }
                },
                "edr": {
                    "type": "object",
                    "title": "Endpoint Detection Response Preferences",
                    "properties": {
                        "tags": {
                            "type": "object",
                            "title": "Tags",
                            "properties": {
                                "key": {
                                    "title": "Type of Tag. GROUP is supported",
                                    "type": "string"
                                },
                                "value": {
                                    "title": "Value",
                                    "description": "Specifies the value of tag",
                                    "options": {
                                        "inputAttributes": {
                                            "placeholder": "value"
                                        }
                                    },
                                    "anyOf": [
                                        {
                                            "type": "null",
                                            "title": "Not Configured"
                                        },
                                        {
                                            "title": "Configured",
                                            "type": "string"
                                        }
                                    ]
                                }
                            }
                        }
                    }
                }
            }
        }
    }
}
